ChibiOS/ChibiOS/os/common/ext/ADI/ADUCM41x/ADuCM410.h
/* ----------------------------------------------------------------------------------------------------
          CLRI                                                  Value             Description
   ---------------------------------------------------------------------------------------------------- */
#define BITP_TMR_CLRI_TMOUT                                   (0U)           /* Clear Timeout Interrupt */
#define BITL_TMR_CLRI_TMOUT                                   (1U)           /* Clear Timeout Interrupt */
#define BITM_TMR_CLRI_TMOUT                                   (0X0001U)      /* Clear Timeout Interrupt */

/* ----------------------------------------------------------------------------------------------------
          STA                                                   Value             Description
   ---------------------------------------------------------------------------------------------------- */
#define BITP_TMR_STA_TMOUT                                    (0U)           /* Timeout Event Occurred */
#define BITL_TMR_STA_TMOUT                                    (1U)           /* Timeout Event Occurred */
#define BITM_TMR_STA_TMOUT                                    (0X0001U)      /* Timeout Event Occurred */
#define BITP_TMR_STA_BUSY                                     (6U)           /* Timer Busy */
#define BITL_TMR_STA_BUSY                                     (1U)           /* Timer Busy */
#define BITM_TMR_STA_BUSY                                     (0X0040U)      /* Timer Busy */
#define BITP_TMR_STA_PDOK                                     (7U)           /* GPTCLRI Synchronization */
#define BITL_TMR_STA_PDOK                                     (1U)           /* GPTCLRI Synchronization */
#define BITM_TMR_STA_PDOK                                     (0X0080U)      /* GPTCLRI Synchronization */

#define ENUM_TMR_STA_PDOK_CLR_FLAG                            (0X0000U)      /* CLR. the Interrupt is Cleared in the Timer Clock Domain */
#define ENUM_TMR_STA_PDOK_SET_FLAG                            (0X0001U)      /* SET. GPTCLRI[0] is Being Updated in the Timer Clock Domain */
#define ENUM_TMR_STA_BUSY_CLR_FLAG                            (0X0000U)      /* Timer Ready to Receive Commands to GPTCON */
#define ENUM_TMR_STA_BUSY_SET_FLAG                            (0X0001U)      /* Timer Not Ready to Receive Commands to GPTCON */
#define ENUM_TMR_STA_TMOUT_CLR_FLAG                           (0X0000U)      /* No Timeout Event Has Occurred */
#define ENUM_TMR_STA_TMOUT_SET_FLAG                           (0X0001U)      /* a Timeout Event Has Occurred */

#endif  /* end ifndef TMR_ADDR_RDEF_H_ */


#ifndef TIMER_ADDR_RDEF_H_
#define TIMER_ADDR_RDEF_H_    /* TIMER: Timer */

/* ====================================================================================================
        TIMER Module Instances Address and Mask Definitions
   ==================================================================================================== */
#define INST_GPTH0                                               (0X40000C00U)    /* gpth0: */
#define INST_GPTH1                                               (0X40001000U)    /* gpth1: */

#define MASK_TIMER                                               (0X000000FFU)    /* TIMER: Timer */

/* ====================================================================================================
        TIMER Module Register Address Offset Definitions
   ==================================================================================================== */
#define IDX_TIMER_CTL                                           (0X00U)    /* Timer Control */
#define IDX_TIMER_CNT                                           (0X04U)    /* Count Value */
#define IDX_TIMER_STATUS                                        (0X08U)    /* Timer Status */
#define IDX_TIMER_CFG0                                          (0X10U)    /* Capture Compare Configuration */
#define IDX_TIMER_CFG1                                          (0X14U)    /* Capture Compare Configuration */
#define IDX_TIMER_CFG2                                          (0X18U)    /* Capture Compare Configuration */
#define IDX_TIMER_CFG3                                          (0X1CU)    /* Capture Compare Configuration */
#define IDX_TIMER_CC0                                           (0X20U)    /* Compare and Capture Value */
#define IDX_TIMER_CC1                                           (0X24U)    /* Compare and Capture Value */
#define IDX_TIMER_CC2                                           (0X28U)    /* Compare and Capture Value */
#define IDX_TIMER_CC3                                           (0X2CU)    /* Compare and Capture Value */

/* ====================================================================================================
        TIMER Module Register ResetValue Definitions
   ==================================================================================================== */
#define RSTVAL_TIMER_CTL                                           (0X170) 
#define RSTVAL_TIMER_CNT                                           (0X0) 
#define RSTVAL_TIMER_STATUS                                        (0X0) 
#define RSTVAL_TIMER_CFG0                                          (0X0) 
#define RSTVAL_TIMER_CFG1                                          (0X0) 
#define RSTVAL_TIMER_CFG2                                          (0X0) 
#define RSTVAL_TIMER_CFG3                                          (0X0) 
#define RSTVAL_TIMER_CC0                                           (0X0) 
#define RSTVAL_TIMER_CC1                                           (0X0) 
#define RSTVAL_TIMER_CC2                                           (0X0) 
#define RSTVAL_TIMER_CC3                                           (0X0) 

/* ====================================================================================================
        TIMER Module Register BitPositions, Lengths, Masks and Enumerations Definitions
   ==================================================================================================== */

