ChibiOS/ChibiOS/os/common/ext/ADI/ADUCM41x/ADuCM410.h
/* ====================================================================================================
        MISC16 Module Register Address Offset Definitions
   ==================================================================================================== */
#define IDX_MISC16_ADIID                                        (0X020U)    /* ADI ID */
#define IDX_MISC16_CHIPID                                       (0X024U)    /* Chip ID */
#define IDX_MISC16_USERKEY                                      (0X134U)    /* Open to Customer to Protect Important Registers */

/* ====================================================================================================
        MISC16 Module Register ResetValue Definitions
   ==================================================================================================== */
#define RSTVAL_MISC16_ADIID                                        (0X4144) 
#define RSTVAL_MISC16_CHIPID                                       (0X571) 
#define RSTVAL_MISC16_USERKEY                                      (0X0) 

/* ====================================================================================================
        MISC16 Module Register BitPositions, Lengths, Masks and Enumerations Definitions
   ==================================================================================================== */

/* ----------------------------------------------------------------------------------------------------
          ADIID                                                 Value             Description
   ---------------------------------------------------------------------------------------------------- */
#define BITP_MISC16_ADIID_ADIID                               (0U)           /* ADI ID */
#define BITL_MISC16_ADIID_ADIID                               (16U)          /* ADI ID */
#define BITM_MISC16_ADIID_ADIID                               (0X0000FFFFU)  /* ADI ID */

/* ----------------------------------------------------------------------------------------------------
          CHIPID                                                Value             Description
   ---------------------------------------------------------------------------------------------------- */
#define BITP_MISC16_CHIPID_REVISION                           (0U)           /* Silicon Revision Number */
#define BITL_MISC16_CHIPID_REVISION                           (4U)           /* Silicon Revision Number */
#define BITM_MISC16_CHIPID_REVISION                           (0X0000000FU)  /* Silicon Revision Number */
#define BITP_MISC16_CHIPID_PARTID                             (4U)           /* Part Identifier */
#define BITL_MISC16_CHIPID_PARTID                             (12U)          /* Part Identifier */
#define BITM_MISC16_CHIPID_PARTID                             (0X0000FFF0U)  /* Part Identifier */

/* ----------------------------------------------------------------------------------------------------
          USERKEY                                               Value             Description
   ---------------------------------------------------------------------------------------------------- */
#define BITP_MISC16_USERKEY_KEY                               (0U)           /* User Key */
#define BITL_MISC16_USERKEY_KEY                               (32U)          /* User Key */
#define BITM_MISC16_USERKEY_KEY                               (0XFFFFFFFFU)  /* User Key */

#endif  /* end ifndef MISC16_ADDR_RDEF_H_ */


#ifndef WUT_ADDR_RDEF_H_
#define WUT_ADDR_RDEF_H_    /* WUT: WUT */

/* ====================================================================================================
        WUT Module Instances Address and Mask Definitions
   ==================================================================================================== */
#define INST_WUT                                                 (0X40003000U)    /* wut: */

#define MASK_WUT                                                 (0XFFFFFFFFU)    /* WUT: WUT */

/* ====================================================================================================
        WUT Module Register Address Offset Definitions
   ==================================================================================================== */
#define IDX_WUT_T4VAL0                                          (0X00000000U)    /* Current Count Value - LS 16 Bits */
#define IDX_WUT_T4VAL1                                          (0X00000004U)    /* Current Count Value - MS 16 Bits */
#define IDX_WUT_T4CON                                           (0X00000008U)    /* Control Register */
#define IDX_WUT_T4INC                                           (0X0000000CU)    /* 12-bit Interval for Wakeup Field a */
#define IDX_WUT_T4WUFB0                                         (0X00000010U)    /* Wakeup Field B - LS 16 Bits */
#define IDX_WUT_T4WUFB1                                         (0X00000014U)    /* Wakeup Field B - MS 16 Bits */
#define IDX_WUT_T4WUFC0                                         (0X00000018U)    /* Wakeup Field C - LS 16 Bits */
#define IDX_WUT_T4WUFC1                                         (0X0000001CU)    /* Wakeup Field C - MS 16 Bits */
#define IDX_WUT_T4WUFD0                                         (0X00000020U)    /* Wakeup Field D - LS 16 Bits */
#define IDX_WUT_T4WUFD1                                         (0X00000024U)    /* Wakeup Field D - MS 16 Bits */
#define IDX_WUT_T4IEN                                           (0X00000028U)    /* Interrupt Enable Register */
#define IDX_WUT_T4STA                                           (0X0000002CU)    /* Status Register */
#define IDX_WUT_T4CLRI                                          (0X00000030U)    /* Clear Interrupt Register */
#define IDX_WUT_T4WUFA0                                         (0X0000003CU)    /* Wakeup Field a - LS 16 Bits */
#define IDX_WUT_T4WUFA1                                         (0X00000040U)    /* Wakeup Field a - MS 16 Bits */

