ChibiOS/ChibiOS/os/common/ext/ADI/ADUCM41x/ADuCM410.h
/* ====================================================================================================
        WUT Module Register ResetValue Definitions
   ==================================================================================================== */
#define RSTVAL_WUT_T4VAL0                                          (0X0) 
#define RSTVAL_WUT_T4VAL1                                          (0X0) 
#define RSTVAL_WUT_T4CON                                           (0X40) 
#define RSTVAL_WUT_T4INC                                           (0XC8) 
#define RSTVAL_WUT_T4WUFB0                                         (0X1FFF) 
#define RSTVAL_WUT_T4WUFB1                                         (0X0) 
#define RSTVAL_WUT_T4WUFC0                                         (0X2FFF) 
#define RSTVAL_WUT_T4WUFC1                                         (0X0) 
#define RSTVAL_WUT_T4WUFD0                                         (0X3FFF) 
#define RSTVAL_WUT_T4WUFD1                                         (0X0) 
#define RSTVAL_WUT_T4IEN                                           (0X0) 
#define RSTVAL_WUT_T4STA                                           (0X0) 
#define RSTVAL_WUT_T4CLRI                                          (0X0) 
#define RSTVAL_WUT_T4WUFA0                                         (0X1900) 
#define RSTVAL_WUT_T4WUFA1                                         (0X0) 

/* ====================================================================================================
        WUT Module Register BitPositions, Lengths, Masks and Enumerations Definitions
   ==================================================================================================== */

/* ----------------------------------------------------------------------------------------------------
          T4VAL0                                                Value             Description
   ---------------------------------------------------------------------------------------------------- */
#define BITP_WUT_T4VAL0_T4VALL                                (0U)           /* Current Count Low */
#define BITL_WUT_T4VAL0_T4VALL                                (16U)          /* Current Count Low */
#define BITM_WUT_T4VAL0_T4VALL                                (0XFFFFU)      /* Current Count Low */

/* ----------------------------------------------------------------------------------------------------
          T4VAL1                                                Value             Description
   ---------------------------------------------------------------------------------------------------- */
#define BITP_WUT_T4VAL1_T4VALH                                (0U)           /* Current Count High */
#define BITL_WUT_T4VAL1_T4VALH                                (16U)          /* Current Count High */
#define BITM_WUT_T4VAL1_T4VALH                                (0XFFFFU)      /* Current Count High */

/* ----------------------------------------------------------------------------------------------------
          T4CON                                                 Value             Description
   ---------------------------------------------------------------------------------------------------- */
#define BITP_WUT_T4CON_PRE                                    (0U)           /* Prescaler */
#define BITL_WUT_T4CON_PRE                                    (2U)           /* Prescaler */
#define BITM_WUT_T4CON_PRE                                    (0X0003U)      /* Prescaler */
#define BITP_WUT_T4CON_FREEZE                                 (3U)           /* Freeze Enable */
#define BITL_WUT_T4CON_FREEZE                                 (1U)           /* Freeze Enable */
#define BITM_WUT_T4CON_FREEZE                                 (0X0008U)      /* Freeze Enable */
#define BITP_WUT_T4CON_TMODE                                  (6U)           /* Timer Mode */
#define BITL_WUT_T4CON_TMODE                                  (1U)           /* Timer Mode */
#define BITM_WUT_T4CON_TMODE                                  (0X0040U)      /* Timer Mode */
#define BITP_WUT_T4CON_ENABLE                                 (7U)           /* Timer Enable */
#define BITL_WUT_T4CON_ENABLE                                 (1U)           /* Timer Enable */
#define BITM_WUT_T4CON_ENABLE                                 (0X0080U)      /* Timer Enable */
#define BITP_WUT_T4CON_WUEN                                   (8U)           /* Wakeup Enable */
#define BITL_WUT_T4CON_WUEN                                   (1U)           /* Wakeup Enable */
#define BITM_WUT_T4CON_WUEN                                   (0X0100U)      /* Wakeup Enable */
#define BITP_WUT_T4CON_CLK                                    (9U)           /* Clock Select */
#define BITL_WUT_T4CON_CLK                                    (2U)           /* Clock Select */
#define BITM_WUT_T4CON_CLK                                    (0X0600U)      /* Clock Select */
#define BITP_WUT_T4CON_STOP_WUFA                              (11U)          /* Disables Updating Field a Register T4WUFA */
#define BITL_WUT_T4CON_STOP_WUFA                              (1U)           /* Disables Updating Field a Register T4WUFA */
#define BITM_WUT_T4CON_STOP_WUFA                              (0X0800U)      /* Disables Updating Field a Register T4WUFA */

#define ENUM_WUT_T4CON_CLK_PCLK                               (0X0000U)      /* PCLK: PCLK (default) */
#define ENUM_WUT_T4CON_CLK_LFOSC                              (0X0001U)      /* LFOSC: 32 KHz Internal Oscillator */
#define ENUM_WUT_T4CON_CLK_LFOSC1                             (0X0002U)      /* LFOSC: 32kHz Internal Oscillator */
#define ENUM_WUT_T4CON_CLK_ECLKIN                             (0X0003U)      /* ECLKIN: External Clock from P1.0 */
#define ENUM_WUT_T4CON_WUEN_DIS                               (0X0000U)      /* DIS: Cleared by User to Disable the Wake up Timer When the Core Clock is off */
#define ENUM_WUT_T4CON_WUEN_EN                                (0X0001U)      /* EN: Set by User to Enable the Wake up Timer Even When the Core Clock is Off. */
#define ENUM_WUT_T4CON_ENABLE_DIS                             (0X0000U)      /* DIS: Disable the Timer (default). */
#define ENUM_WUT_T4CON_ENABLE_EN                              (0X0001U)      /* EN: Enable the Timer. */
#define ENUM_WUT_T4CON_TMODE_PERIODIC                         (0X0000U)      /* PERIODIC: Cleared by User to Operate in Periodic Mode. in This Mode, the Timer Counts up to T4WUFD */
#define ENUM_WUT_T4CON_TMODE_FREERUN                          (0X0001U)      /* FREERUN: Set by User to Operate in Free Running Mode (default). */
#define ENUM_WUT_T4CON_FREEZE_DIS                             (0X0000U)      /* DIS: Cleared by User to Disable This Feature (default). */
#define ENUM_WUT_T4CON_FREEZE_EN                              (0X0001U)      /* EN: Set by User to Enable the Freeze of the High 16-bits After the Lower Bits Have Been Read from T4VAL0. This Ensures That the Software Will Read an Atomic Shot of the Timer. T4VAL1 Unfreezes After It Has Been Read. */
#define ENUM_WUT_T4CON_PRE_PREDIV1                            (0X0000U)      /* PREDIV1: Source Clock/1 (default). If the Selected Clock Source is PCLK, Then This Setting Results in a Prescaler of 4. */
#define ENUM_WUT_T4CON_PRE_PREDIV16                           (0X0001U)      /* PREDIV16: Source Clock/16 */
#define ENUM_WUT_T4CON_PRE_PREDIV256                          (0X0002U)      /* PREDIV256: Source Clock/256 */
#define ENUM_WUT_T4CON_PRE_PREDIV32768                        (0X0003U)      /* PREDIV32768: Source Clock/32,768 */

