ChibiOS/ChibiOS/os/common/ext/ADI/ADUCM41x/ADuCM410.h
/* ----------------------------------------------------------------------------------------------------
          T4STA                                                 Value             Description
   ---------------------------------------------------------------------------------------------------- */
#define BITP_WUT_T4STA_WUFA                                   (0U)           /* T4WUFA Interrupt Flag */
#define BITL_WUT_T4STA_WUFA                                   (1U)           /* T4WUFA Interrupt Flag */
#define BITM_WUT_T4STA_WUFA                                   (0X0001U)      /* T4WUFA Interrupt Flag */
#define BITP_WUT_T4STA_WUFB                                   (1U)           /* T4WUFB Interrupt Flag */
#define BITL_WUT_T4STA_WUFB                                   (1U)           /* T4WUFB Interrupt Flag */
#define BITM_WUT_T4STA_WUFB                                   (0X0002U)      /* T4WUFB Interrupt Flag */
#define BITP_WUT_T4STA_WUFC                                   (2U)           /* T4WUFC Interrupt Flag */
#define BITL_WUT_T4STA_WUFC                                   (1U)           /* T4WUFC Interrupt Flag */
#define BITM_WUT_T4STA_WUFC                                   (0X0004U)      /* T4WUFC Interrupt Flag */
#define BITP_WUT_T4STA_WUFD                                   (3U)           /* T4WUFD Interrupt Flag */
#define BITL_WUT_T4STA_WUFD                                   (1U)           /* T4WUFD Interrupt Flag */
#define BITM_WUT_T4STA_WUFD                                   (0X0008U)      /* T4WUFD Interrupt Flag */
#define BITP_WUT_T4STA_ROLL                                   (4U)           /* Rollover Interrupt Flag */
#define BITL_WUT_T4STA_ROLL                                   (1U)           /* Rollover Interrupt Flag */
#define BITM_WUT_T4STA_ROLL                                   (0X0010U)      /* Rollover Interrupt Flag */
#define BITP_WUT_T4STA_IRQCRY                                 (6U)           /* Wakeup Status to Powerdown */
#define BITL_WUT_T4STA_IRQCRY                                 (1U)           /* Wakeup Status to Powerdown */
#define BITM_WUT_T4STA_IRQCRY                                 (0X0040U)      /* Wakeup Status to Powerdown */
#define BITP_WUT_T4STA_FREEZE                                 (7U)           /* Timer Value Freeze */
#define BITL_WUT_T4STA_FREEZE                                 (1U)           /* Timer Value Freeze */
#define BITM_WUT_T4STA_FREEZE                                 (0X0080U)      /* Timer Value Freeze */
#define BITP_WUT_T4STA_PDOK                                   (8U)           /* Enable Bit Synchronized */
#define BITL_WUT_T4STA_PDOK                                   (1U)           /* Enable Bit Synchronized */
#define BITM_WUT_T4STA_PDOK                                   (0X0100U)      /* Enable Bit Synchronized */

/* ----------------------------------------------------------------------------------------------------
          T4CLRI                                                Value             Description
   ---------------------------------------------------------------------------------------------------- */
#define BITP_WUT_T4CLRI_WUFA                                  (0U)           /* T4WUFA Interrupt Clear */
#define BITL_WUT_T4CLRI_WUFA                                  (1U)           /* T4WUFA Interrupt Clear */
#define BITM_WUT_T4CLRI_WUFA                                  (0X0001U)      /* T4WUFA Interrupt Clear */
#define BITP_WUT_T4CLRI_WUFB                                  (1U)           /* T4WUFB Interrupt Clear */
#define BITL_WUT_T4CLRI_WUFB                                  (1U)           /* T4WUFB Interrupt Clear */
#define BITM_WUT_T4CLRI_WUFB                                  (0X0002U)      /* T4WUFB Interrupt Clear */
#define BITP_WUT_T4CLRI_WUFC                                  (2U)           /* T4WUFC Interrupt Clear */
#define BITL_WUT_T4CLRI_WUFC                                  (1U)           /* T4WUFC Interrupt Clear */
#define BITM_WUT_T4CLRI_WUFC                                  (0X0004U)      /* T4WUFC Interrupt Clear */
#define BITP_WUT_T4CLRI_WUFD                                  (3U)           /* T4WUFD Interrupt Clear */
#define BITL_WUT_T4CLRI_WUFD                                  (1U)           /* T4WUFD Interrupt Clear */
#define BITM_WUT_T4CLRI_WUFD                                  (0X0008U)      /* T4WUFD Interrupt Clear */
#define BITP_WUT_T4CLRI_ROLL                                  (4U)           /* Rollover Interrupt Clear */
#define BITL_WUT_T4CLRI_ROLL                                  (1U)           /* Rollover Interrupt Clear */
#define BITM_WUT_T4CLRI_ROLL                                  (0X0010U)      /* Rollover Interrupt Clear */

/* ----------------------------------------------------------------------------------------------------
          T4WUFA0                                               Value             Description
   ---------------------------------------------------------------------------------------------------- */
#define BITP_WUT_T4WUFA0_T4WUFAL                              (0U)           /* Wakeup Field a Low */
#define BITL_WUT_T4WUFA0_T4WUFAL                              (16U)          /* Wakeup Field a Low */
#define BITM_WUT_T4WUFA0_T4WUFAL                              (0XFFFFU)      /* Wakeup Field a Low */

/* ----------------------------------------------------------------------------------------------------
          T4WUFA1                                               Value             Description
   ---------------------------------------------------------------------------------------------------- */
#define BITP_WUT_T4WUFA1_T4WUFAH                              (0U)           /* Wakeup Field a High */
#define BITL_WUT_T4WUFA1_T4WUFAH                              (16U)          /* Wakeup Field a High */
#define BITM_WUT_T4WUFA1_T4WUFAH                              (0XFFFFU)      /* Wakeup Field a High */

