ChibiOS/ChibiOS/os/common/ext/ADI/ADUCM41x/ADuCM410.h
/* ----------------------------------------------------------------------------------------------------
          CLRI                                                  Value             Description
   ---------------------------------------------------------------------------------------------------- */
#define BITP_WDT_CLRI_CLRWDG                                  (0U)           /* Refresh Register */
#define BITL_WDT_CLRI_CLRWDG                                  (16U)          /* Refresh Register */
#define BITM_WDT_CLRI_CLRWDG                                  (0XFFFFU)      /* Refresh Register */

/* ----------------------------------------------------------------------------------------------------
          STA                                                   Value             Description
   ---------------------------------------------------------------------------------------------------- */
#define BITP_WDT_STA_IRQ                                      (0U)           /* WDT Interrupt */
#define BITL_WDT_STA_IRQ                                      (1U)           /* WDT Interrupt */
#define BITM_WDT_STA_IRQ                                      (0X0001U)      /* WDT Interrupt */
#define BITP_WDT_STA_CLRI                                     (1U)           /* WDTCLRI Write Status */
#define BITL_WDT_STA_CLRI                                     (1U)           /* WDTCLRI Write Status */
#define BITM_WDT_STA_CLRI                                     (0X0002U)      /* WDTCLRI Write Status */
#define BITP_WDT_STA_TLD                                      (2U)           /* WDTVAL Write Status */
#define BITL_WDT_STA_TLD                                      (1U)           /* WDTVAL Write Status */
#define BITM_WDT_STA_TLD                                      (0X0004U)      /* WDTVAL Write Status */
#define BITP_WDT_STA_CON                                      (3U)           /* WDTCON Write Status */
#define BITL_WDT_STA_CON                                      (1U)           /* WDTCON Write Status */
#define BITM_WDT_STA_CON                                      (0X0008U)      /* WDTCON Write Status */
#define BITP_WDT_STA_LOCKS                                    (4U)           /* Lock Status */
#define BITL_WDT_STA_LOCKS                                    (1U)           /* Lock Status */
#define BITM_WDT_STA_LOCKS                                    (0X0010U)      /* Lock Status */
#define BITP_WDT_STA_OTPWRDONE                                (5U)           /* Reset Type Status */
#define BITL_WDT_STA_OTPWRDONE                                (1U)           /* Reset Type Status */
#define BITM_WDT_STA_OTPWRDONE                                (0X0020U)      /* Reset Type Status */
#define BITP_WDT_STA_TMINLD                                   (6U)           /* WDTMINLD Write Status */
#define BITL_WDT_STA_TMINLD                                   (1U)           /* WDTMINLD Write Status */
#define BITM_WDT_STA_TMINLD                                   (0X0040U)      /* WDTMINLD Write Status */

#define ENUM_WDT_STA_LOCKS_OPENED                             (0X0000U)      /* Timer Operation Not Locked */
#define ENUM_WDT_STA_LOCKS_LOCKED                             (0X0001U)      /* Timer Enabled and Locked */
#define ENUM_WDT_STA_IRQ_CLEARED                              (0X0000U)      /* Watchdog Timer Interrupt Not Pending */
#define ENUM_WDT_STA_IRQ_PENDING                              (0X0001U)      /* Watchdog Timer Interrupt Pending */

/* ----------------------------------------------------------------------------------------------------
          MINLD                                                 Value             Description
   ---------------------------------------------------------------------------------------------------- */
#define BITP_WDT_MINLD_MINLOAD                                (0U)           /* WDT Min Load Value */
#define BITL_WDT_MINLD_MINLOAD                                (16U)          /* WDT Min Load Value */
#define BITM_WDT_MINLD_MINLOAD                                (0XFFFFU)      /* WDT Min Load Value */

#endif  /* end ifndef WDT_ADDR_RDEF_H_ */


#ifndef ALWAYS_ON_ADDR_RDEF_H_
#define ALWAYS_ON_ADDR_RDEF_H_    /* ALWAYS_ON: Always on clock, reset, power management and test */

/* ====================================================================================================
        ALWAYS_ON Module Instances Address and Mask Definitions
   ==================================================================================================== */
#define INST_ALLON                                               (0X40005000U)    /* allon: */

#define MASK_ALWAYS_ON                                           (0XFFFFFFFFU)    /* ALWAYS_ON: Always on clock, reset, power management and test */

/* ====================================================================================================
        ALWAYS_ON Module Register Address Offset Definitions
   ==================================================================================================== */
#define IDX_ALWAYS_ON_PWRMOD                                    (0X00000000U)    /* Power Modes */
#define IDX_ALWAYS_ON_PWRKEY                                    (0X00000004U)    /* Key Protection for PWRMOD */
#define IDX_ALWAYS_ON_RSTCFG                                    (0X00000008U)    /* Reset Configuration */
#define IDX_ALWAYS_ON_RSTKEY                                    (0X0000000CU)    /* Key Protection for RSTCFG */
#define IDX_ALWAYS_ON_EI0CFG                                    (0X00000020U)    /* External Interrupt Configuration 0 */
#define IDX_ALWAYS_ON_EI1CFG                                    (0X00000024U)    /* External Interrupt Configuration 1 */
#define IDX_ALWAYS_ON_EI2CFG                                    (0X00000028U)    /* External Interrupt Configuration 2 */
#define IDX_ALWAYS_ON_EICLR                                     (0X00000030U)    /* External Interrupt Clear */
#define IDX_ALWAYS_ON_RSTSTA                                    (0X00000040U)    /* Reset Status */

