ChibiOS/ChibiOS/os/common/ext/ADI/ADUCM41x/ADuCM410.h
/* ----------------------------------------------------------------------------------------------------
          EI0CFG                                                Value             Description
   ---------------------------------------------------------------------------------------------------- */
#define BITP_ALWAYS_ON_EI0CFG_IRQ0MDE                         (0U)           /* External Interrupt 0 Mode Registers */
#define BITL_ALWAYS_ON_EI0CFG_IRQ0MDE                         (3U)           /* External Interrupt 0 Mode Registers */
#define BITM_ALWAYS_ON_EI0CFG_IRQ0MDE                         (0X0007U)      /* External Interrupt 0 Mode Registers */
#define BITP_ALWAYS_ON_EI0CFG_IRQ0EN                          (3U)           /* External Interrupt 0 Enable Bit */
#define BITL_ALWAYS_ON_EI0CFG_IRQ0EN                          (1U)           /* External Interrupt 0 Enable Bit */
#define BITM_ALWAYS_ON_EI0CFG_IRQ0EN                          (0X0008U)      /* External Interrupt 0 Enable Bit */
#define BITP_ALWAYS_ON_EI0CFG_IRQ1MDE                         (4U)           /* External Interrupt 1 Mode Registers */
#define BITL_ALWAYS_ON_EI0CFG_IRQ1MDE                         (3U)           /* External Interrupt 1 Mode Registers */
#define BITM_ALWAYS_ON_EI0CFG_IRQ1MDE                         (0X0070U)      /* External Interrupt 1 Mode Registers */
#define BITP_ALWAYS_ON_EI0CFG_IRQ1EN                          (7U)           /* External Interrupt 1 Enable Bit */
#define BITL_ALWAYS_ON_EI0CFG_IRQ1EN                          (1U)           /* External Interrupt 1 Enable Bit */
#define BITM_ALWAYS_ON_EI0CFG_IRQ1EN                          (0X0080U)      /* External Interrupt 1 Enable Bit */
#define BITP_ALWAYS_ON_EI0CFG_IRQ2MDE                         (8U)           /* External Interrupt 2 Mode Registers */
#define BITL_ALWAYS_ON_EI0CFG_IRQ2MDE                         (3U)           /* External Interrupt 2 Mode Registers */
#define BITM_ALWAYS_ON_EI0CFG_IRQ2MDE                         (0X0700U)      /* External Interrupt 2 Mode Registers */
#define BITP_ALWAYS_ON_EI0CFG_IRQ2EN                          (11U)          /* External Interrupt 2 Enable Bit */
#define BITL_ALWAYS_ON_EI0CFG_IRQ2EN                          (1U)           /* External Interrupt 2 Enable Bit */
#define BITM_ALWAYS_ON_EI0CFG_IRQ2EN                          (0X0800U)      /* External Interrupt 2 Enable Bit */
#define BITP_ALWAYS_ON_EI0CFG_IRQ3MDE                         (12U)          /* External Interrupt 3 Mode Registers */
#define BITL_ALWAYS_ON_EI0CFG_IRQ3MDE                         (3U)           /* External Interrupt 3 Mode Registers */
#define BITM_ALWAYS_ON_EI0CFG_IRQ3MDE                         (0X7000U)      /* External Interrupt 3 Mode Registers */
#define BITP_ALWAYS_ON_EI0CFG_IRQ3EN                          (15U)          /* External Interrupt 3 Enable Bit */
#define BITL_ALWAYS_ON_EI0CFG_IRQ3EN                          (1U)           /* External Interrupt 3 Enable Bit */
#define BITM_ALWAYS_ON_EI0CFG_IRQ3EN                          (0X8000U)      /* External Interrupt 3 Enable Bit */

#define ENUM_ALWAYS_ON_EI0CFG_IRQ3EN_DIS                      (0X0000U)      /* External Interrupt 3 Disabled */
#define ENUM_ALWAYS_ON_EI0CFG_IRQ3EN_EN                       (0X0001U)      /* External Interrupt 3 Enabled */
#define ENUM_ALWAYS_ON_EI0CFG_IRQ3MDE_RISE                    (0X0000U)      /* Rising Edge */
#define ENUM_ALWAYS_ON_EI0CFG_IRQ3MDE_FALL                    (0X0001U)      /* Falling Edge */
#define ENUM_ALWAYS_ON_EI0CFG_IRQ3MDE_RISEORFALL              (0X0002U)      /* Rising or Falling Edge */
#define ENUM_ALWAYS_ON_EI0CFG_IRQ3MDE_HIGHLEVEL               (0X0003U)      /* High Level */
#define ENUM_ALWAYS_ON_EI0CFG_IRQ3MDE_LOWLEVEL                (0X0004U)      /* Low Level */
#define ENUM_ALWAYS_ON_EI0CFG_IRQ3MDE_FALLAUX                 (0X0005U)      /* Falling Edge (same as 001) */
#define ENUM_ALWAYS_ON_EI0CFG_IRQ3MDE_RISEORFALLAUX           (0X0006U)      /* Rising or Falling Edge (same as 010) */
#define ENUM_ALWAYS_ON_EI0CFG_IRQ3MDE_HIGHLEVELAUX            (0X0007U)      /* High Level (same as 011) */
#define ENUM_ALWAYS_ON_EI0CFG_IRQ2EN_DIS                      (0X0000U)      /* External Interrupt 2 Disabled */
#define ENUM_ALWAYS_ON_EI0CFG_IRQ2EN_EN                       (0X0001U)      /* External Interrupt 2 Enabled */
#define ENUM_ALWAYS_ON_EI0CFG_IRQ2MDE_RISE                    (0X0000U)      /* Rising Edge */
#define ENUM_ALWAYS_ON_EI0CFG_IRQ2MDE_FALL                    (0X0001U)      /* Falling Edge */
#define ENUM_ALWAYS_ON_EI0CFG_IRQ2MDE_RISEORFALL              (0X0002U)      /* Rising or Falling Edge */
#define ENUM_ALWAYS_ON_EI0CFG_IRQ2MDE_HIGHLEVEL               (0X0003U)      /* High Level */
#define ENUM_ALWAYS_ON_EI0CFG_IRQ2MDE_LOWLEVEL                (0X0004U)      /* Low Level */
#define ENUM_ALWAYS_ON_EI0CFG_IRQ2MDE_FALLAUX                 (0X0005U)      /* Falling Edge (same as 001) */
#define ENUM_ALWAYS_ON_EI0CFG_IRQ2MDE_RISEORFALLAUX           (0X0006U)      /* Rising or Falling Edge (same as 010) */
#define ENUM_ALWAYS_ON_EI0CFG_IRQ2MDE_HIGHLEVELAUX            (0X0007U)      /* High Level (same as 011) */
#define ENUM_ALWAYS_ON_EI0CFG_IRQ1EN_DIS                      (0X0000U)      /* External Interrupt 0 Disabled */
#define ENUM_ALWAYS_ON_EI0CFG_IRQ1EN_EN                       (0X0001U)      /* External Interrupt 0 Enabled */
#define ENUM_ALWAYS_ON_EI0CFG_IRQ1MDE_RISE                    (0X0000U)      /* Rising Edge */
#define ENUM_ALWAYS_ON_EI0CFG_IRQ1MDE_FALL                    (0X0001U)      /* Falling Edge */
#define ENUM_ALWAYS_ON_EI0CFG_IRQ1MDE_RISEORFALL              (0X0002U)      /* Rising or Falling Edge */
#define ENUM_ALWAYS_ON_EI0CFG_IRQ1MDE_HIGHLEVEL               (0X0003U)      /* High Level */
#define ENUM_ALWAYS_ON_EI0CFG_IRQ1MDE_LOWLEVEL                (0X0004U)      /* Low Level */
#define ENUM_ALWAYS_ON_EI0CFG_IRQ1MDE_FALLAUX                 (0X0005U)      /* Falling Edge (same as 001) */
#define ENUM_ALWAYS_ON_EI0CFG_IRQ1MDE_RISEORFALLAUX           (0X0006U)      /* Rising or Falling Edge (same as 010) */
#define ENUM_ALWAYS_ON_EI0CFG_IRQ1MDE_HIGHLEVELAUX            (0X0007U)      /* High Level (same as 011) */
#define ENUM_ALWAYS_ON_EI0CFG_IRQ0EN_DIS                      (0X0000U)      /* External Interrupt 0 Disabled */
#define ENUM_ALWAYS_ON_EI0CFG_IRQ0EN_EN                       (0X0001U)      /* External Interrupt 0 Enabled */
#define ENUM_ALWAYS_ON_EI0CFG_IRQ0MDE_RISE                    (0X0000U)      /* Rising Edge */
#define ENUM_ALWAYS_ON_EI0CFG_IRQ0MDE_FALL                    (0X0001U)      /* Falling Edge */
#define ENUM_ALWAYS_ON_EI0CFG_IRQ0MDE_RISEORFALL              (0X0002U)      /* Rising or Falling Edge */
#define ENUM_ALWAYS_ON_EI0CFG_IRQ0MDE_HIGHLEVEL               (0X0003U)      /* High Level */
#define ENUM_ALWAYS_ON_EI0CFG_IRQ0MDE_LOWLEVEL                (0X0004U)      /* Low Level */
#define ENUM_ALWAYS_ON_EI0CFG_IRQ0MDE_FALLAUX                 (0X0005U)      /* Falling Edge (same as 001) */
#define ENUM_ALWAYS_ON_EI0CFG_IRQ0MDE_RISEORFALLAUX           (0X0006U)      /* Rising or Falling Edge (same as 010) */
#define ENUM_ALWAYS_ON_EI0CFG_IRQ0MDE_HIGHLEVELAUX            (0X0007U)      /* High Level (same as 011) */

