ChibiOS/ChibiOS/os/common/ext/ADI/ADUCM41x/ADuCM410.h
/* ----------------------------------------------------------------------------------------------------
          EI1CFG                                                Value             Description
   ---------------------------------------------------------------------------------------------------- */
#define BITP_ALWAYS_ON_EI1CFG_IRQ4MDE                         (0U)           /* External Interrupt 4 Mode Registers */
#define BITL_ALWAYS_ON_EI1CFG_IRQ4MDE                         (3U)           /* External Interrupt 4 Mode Registers */
#define BITM_ALWAYS_ON_EI1CFG_IRQ4MDE                         (0X0007U)      /* External Interrupt 4 Mode Registers */
#define BITP_ALWAYS_ON_EI1CFG_IRQ4EN                          (3U)           /* External Interrupt 4 Enable Bit */
#define BITL_ALWAYS_ON_EI1CFG_IRQ4EN                          (1U)           /* External Interrupt 4 Enable Bit */
#define BITM_ALWAYS_ON_EI1CFG_IRQ4EN                          (0X0008U)      /* External Interrupt 4 Enable Bit */
#define BITP_ALWAYS_ON_EI1CFG_IRQ5MDE                         (4U)           /* External Interrupt 5 Mode Registers */
#define BITL_ALWAYS_ON_EI1CFG_IRQ5MDE                         (3U)           /* External Interrupt 5 Mode Registers */
#define BITM_ALWAYS_ON_EI1CFG_IRQ5MDE                         (0X0070U)      /* External Interrupt 5 Mode Registers */
#define BITP_ALWAYS_ON_EI1CFG_IRQ5EN                          (7U)           /* External Interrupt 5 Enable Bit */
#define BITL_ALWAYS_ON_EI1CFG_IRQ5EN                          (1U)           /* External Interrupt 5 Enable Bit */
#define BITM_ALWAYS_ON_EI1CFG_IRQ5EN                          (0X0080U)      /* External Interrupt 5 Enable Bit */
#define BITP_ALWAYS_ON_EI1CFG_IRQ6MDE                         (8U)           /* External Interrupt 6 Mode Registers */
#define BITL_ALWAYS_ON_EI1CFG_IRQ6MDE                         (3U)           /* External Interrupt 6 Mode Registers */
#define BITM_ALWAYS_ON_EI1CFG_IRQ6MDE                         (0X0700U)      /* External Interrupt 6 Mode Registers */
#define BITP_ALWAYS_ON_EI1CFG_IRQ6EN                          (11U)          /* External Interrupt 6 Enable Bit */
#define BITL_ALWAYS_ON_EI1CFG_IRQ6EN                          (1U)           /* External Interrupt 6 Enable Bit */
#define BITM_ALWAYS_ON_EI1CFG_IRQ6EN                          (0X0800U)      /* External Interrupt 6 Enable Bit */
#define BITP_ALWAYS_ON_EI1CFG_IRQ7MDE                         (12U)          /* External Interrupt 7 Mode Registers */
#define BITL_ALWAYS_ON_EI1CFG_IRQ7MDE                         (3U)           /* External Interrupt 7 Mode Registers */
#define BITM_ALWAYS_ON_EI1CFG_IRQ7MDE                         (0X7000U)      /* External Interrupt 7 Mode Registers */
#define BITP_ALWAYS_ON_EI1CFG_IRQ7EN                          (15U)          /* External Interrupt 7 Enable Bit */
#define BITL_ALWAYS_ON_EI1CFG_IRQ7EN                          (1U)           /* External Interrupt 7 Enable Bit */
#define BITM_ALWAYS_ON_EI1CFG_IRQ7EN                          (0X8000U)      /* External Interrupt 7 Enable Bit */

#define ENUM_ALWAYS_ON_EI1CFG_IRQ7EN_DIS                      (0X0000U)      /* External Interrupt 7 Disabled */
#define ENUM_ALWAYS_ON_EI1CFG_IRQ7EN_EN                       (0X0001U)      /* External Interrupt 7 Enabled */
#define ENUM_ALWAYS_ON_EI1CFG_IRQ7MDE_RISE                    (0X0000U)      /* Rising Edge */
#define ENUM_ALWAYS_ON_EI1CFG_IRQ7MDE_FALL                    (0X0001U)      /* Falling Edge */
#define ENUM_ALWAYS_ON_EI1CFG_IRQ7MDE_RISEORFALL              (0X0002U)      /* Rising or Falling Edge */
#define ENUM_ALWAYS_ON_EI1CFG_IRQ7MDE_HIGHLEVEL               (0X0003U)      /* High Level */
#define ENUM_ALWAYS_ON_EI1CFG_IRQ7MDE_LOWLEVEL                (0X0004U)      /* Low Level */
#define ENUM_ALWAYS_ON_EI1CFG_IRQ7MDE_FALLAUX                 (0X0005U)      /* Falling Edge (same as 001) */
#define ENUM_ALWAYS_ON_EI1CFG_IRQ7MDE_RISEORFALLAUX           (0X0006U)      /* Rising or Falling Edge (same as 010) */
#define ENUM_ALWAYS_ON_EI1CFG_IRQ7MDE_HIGHLEVELAUX            (0X0007U)      /* High Level (same as 011) */
#define ENUM_ALWAYS_ON_EI1CFG_IRQ6EN_DIS                      (0X0000U)      /* External Interrupt 6 Disabled */
#define ENUM_ALWAYS_ON_EI1CFG_IRQ6EN_EN                       (0X0001U)      /* External Interrupt 6 Enabled */
#define ENUM_ALWAYS_ON_EI1CFG_IRQ6MDE_RISE                    (0X0000U)      /* Rising Edge */
#define ENUM_ALWAYS_ON_EI1CFG_IRQ6MDE_FALL                    (0X0001U)      /* Falling Edge */
#define ENUM_ALWAYS_ON_EI1CFG_IRQ6MDE_RISEORFALL              (0X0002U)      /* Rising or Falling Edge */
#define ENUM_ALWAYS_ON_EI1CFG_IRQ6MDE_HIGHLEVEL               (0X0003U)      /* High Level */
#define ENUM_ALWAYS_ON_EI1CFG_IRQ6MDE_LOWLEVEL                (0X0004U)      /* Low Level */
#define ENUM_ALWAYS_ON_EI1CFG_IRQ6MDE_FALLAUX                 (0X0005U)      /* Falling Edge (same as 001) */
#define ENUM_ALWAYS_ON_EI1CFG_IRQ6MDE_RISEORFALLAUX           (0X0006U)      /* Rising or Falling Edge (same as 010) */
#define ENUM_ALWAYS_ON_EI1CFG_IRQ6MDE_HIGHLEVELAUX            (0X0007U)      /* High Level (same as 011) */
#define ENUM_ALWAYS_ON_EI1CFG_IRQ5EN_DIS                      (0X0000U)      /* External Interrupt 5 Disabled */
#define ENUM_ALWAYS_ON_EI1CFG_IRQ5EN_EN                       (0X0001U)      /* External Interrupt 5 Enabled */
#define ENUM_ALWAYS_ON_EI1CFG_IRQ5MDE_RISING                  (0X0000U)      /* Rising Edge */
#define ENUM_ALWAYS_ON_EI1CFG_IRQ5MDE_FALLING                 (0X0001U)      /* Falling Edge */
#define ENUM_ALWAYS_ON_EI1CFG_IRQ5MDE_RISEORFALL              (0X0002U)      /* Rising or Falling Edge */
#define ENUM_ALWAYS_ON_EI1CFG_IRQ5MDE_HIGHLEVEL               (0X0003U)      /* High Level */
#define ENUM_ALWAYS_ON_EI1CFG_IRQ5MDE_LOWLEVEL                (0X0004U)      /* Low Level */
#define ENUM_ALWAYS_ON_EI1CFG_IRQ5MDE_FALLAUX                 (0X0005U)      /* Falling Edge (same as 001) */
#define ENUM_ALWAYS_ON_EI1CFG_IRQ5MDE_RISEORFALLAUX           (0X0006U)      /* Rising or Falling Edge (same as 010) */
#define ENUM_ALWAYS_ON_EI1CFG_IRQ5MDE_HIGHLEVELAUX            (0X0007U)      /* High Level (same as 011) */
#define ENUM_ALWAYS_ON_EI1CFG_IRQ4EN_DIS                      (0X0000U)      /* External Interrupt 4 Disabled */
#define ENUM_ALWAYS_ON_EI1CFG_IRQ4EN_EN                       (0X0001U)      /* External Interrupt 4 Enabled */
#define ENUM_ALWAYS_ON_EI1CFG_IRQ4MDE_RISE                    (0X0000U)      /* Rising Edge */
#define ENUM_ALWAYS_ON_EI1CFG_IRQ4MDE_FALL                    (0X0001U)      /* Falling Edge */
#define ENUM_ALWAYS_ON_EI1CFG_IRQ4MDE_RISEORFALL              (0X0002U)      /* Rising or Falling Edge */
#define ENUM_ALWAYS_ON_EI1CFG_IRQ4MDE_HIGHLEVEL               (0X0003U)      /* High Level */
#define ENUM_ALWAYS_ON_EI1CFG_IRQ4MDE_LOWLEVEL                (0X0004U)      /* Low Level */
#define ENUM_ALWAYS_ON_EI1CFG_IRQ4MDE_FALLAUX                 (0X0005U)      /* Falling Edge (same as 001) */
#define ENUM_ALWAYS_ON_EI1CFG_IRQ4MDE_RISEORFALLAUX           (0X0006U)      /* Rising or Falling Edge (same as 010) */
#define ENUM_ALWAYS_ON_EI1CFG_IRQ4MDE_HIGHLEVELAUX            (0X0007U)      /* High Level (same as 011) */

