ChibiOS/ChibiOS/os/common/ext/ADI/ADUCM41x/ADuCM410.h
/* ----------------------------------------------------------------------------------------------------
          EI2CFG                                                Value             Description
   ---------------------------------------------------------------------------------------------------- */
#define BITP_ALWAYS_ON_EI2CFG_IRQ8MDE                         (0U)           /* External Interrupt 8 Mode Registers */
#define BITL_ALWAYS_ON_EI2CFG_IRQ8MDE                         (3U)           /* External Interrupt 8 Mode Registers */
#define BITM_ALWAYS_ON_EI2CFG_IRQ8MDE                         (0X0007U)      /* External Interrupt 8 Mode Registers */
#define BITP_ALWAYS_ON_EI2CFG_IRQ8EN                          (3U)           /* External Interrupt 8 Enable Bit */
#define BITL_ALWAYS_ON_EI2CFG_IRQ8EN                          (1U)           /* External Interrupt 8 Enable Bit */
#define BITM_ALWAYS_ON_EI2CFG_IRQ8EN                          (0X0008U)      /* External Interrupt 8 Enable Bit */
#define BITP_ALWAYS_ON_EI2CFG_IRQ9MDE                         (4U)           /* External Interrupt 8 Mode Registers */
#define BITL_ALWAYS_ON_EI2CFG_IRQ9MDE                         (3U)           /* External Interrupt 8 Mode Registers */
#define BITM_ALWAYS_ON_EI2CFG_IRQ9MDE                         (0X0070U)      /* External Interrupt 8 Mode Registers */
#define BITP_ALWAYS_ON_EI2CFG_IRQ9EN                          (7U)           /* External Interrupt 8 Enable Bit */
#define BITL_ALWAYS_ON_EI2CFG_IRQ9EN                          (1U)           /* External Interrupt 8 Enable Bit */
#define BITM_ALWAYS_ON_EI2CFG_IRQ9EN                          (0X0080U)      /* External Interrupt 8 Enable Bit */

#define ENUM_ALWAYS_ON_EI2CFG_IRQ9EN_DIS                      (0X0000U)      /* External Interrupt 8 Disabled */
#define ENUM_ALWAYS_ON_EI2CFG_IRQ9EN_EN                       (0X0001U)      /* External Interrupt 8 Enabled */
#define ENUM_ALWAYS_ON_EI2CFG_IRQ9MDE_RISE                    (0X0000U)      /* Rising Edge */
#define ENUM_ALWAYS_ON_EI2CFG_IRQ9MDE_FALL                    (0X0001U)      /* Falling Edge */
#define ENUM_ALWAYS_ON_EI2CFG_IRQ9MDE_RISEORFALL              (0X0002U)      /* Rising or Falling Edge */
#define ENUM_ALWAYS_ON_EI2CFG_IRQ9MDE_HIGHLEVEL               (0X0003U)      /* High Level */
#define ENUM_ALWAYS_ON_EI2CFG_IRQ9MDE_LOWLEVEL                (0X0004U)      /* Low Level */
#define ENUM_ALWAYS_ON_EI2CFG_IRQ9MDE_FALLAUX                 (0X0005U)      /* Falling Edge (same as 001) */
#define ENUM_ALWAYS_ON_EI2CFG_IRQ9MDE_RISEORFALLAUX           (0X0006U)      /* Rising or Falling Edge (same as 010) */
#define ENUM_ALWAYS_ON_EI2CFG_IRQ9MDE_HIGHLEVELAUX            (0X0007U)      /* High Level (same as 011) */
#define ENUM_ALWAYS_ON_EI2CFG_IRQ8EN_DIS                      (0X0000U)      /* External Interrupt 8 Disabled */
#define ENUM_ALWAYS_ON_EI2CFG_IRQ8EN_EN                       (0X0001U)      /* External Interrupt 8 Enabled */
#define ENUM_ALWAYS_ON_EI2CFG_IRQ8MDE_RISE                    (0X0000U)      /* Rising Edge */
#define ENUM_ALWAYS_ON_EI2CFG_IRQ8MDE_FALL                    (0X0001U)      /* Falling Edge */
#define ENUM_ALWAYS_ON_EI2CFG_IRQ8MDE_RISEORFALL              (0X0002U)      /* Rising or Falling Edge */
#define ENUM_ALWAYS_ON_EI2CFG_IRQ8MDE_HIGHLEVEL               (0X0003U)      /* High Level */
#define ENUM_ALWAYS_ON_EI2CFG_IRQ8MDE_LOWLEVEL                (0X0004U)      /* Low Level */
#define ENUM_ALWAYS_ON_EI2CFG_IRQ8MDE_FALLAUX                 (0X0005U)      /* Falling Edge (same as 001) */
#define ENUM_ALWAYS_ON_EI2CFG_IRQ8MDE_RISEORFALLAUX           (0X0006U)      /* Rising or Falling Edge (same as 010) */
#define ENUM_ALWAYS_ON_EI2CFG_IRQ8MDE_HIGHLEVELAUX            (0X0007U)      /* High Level (same as 011) */

/* ----------------------------------------------------------------------------------------------------
          EICLR                                                 Value             Description
   ---------------------------------------------------------------------------------------------------- */
#define BITP_ALWAYS_ON_EICLR_IRQ0                             (0U)           /* External Interrupt 0 */
#define BITL_ALWAYS_ON_EICLR_IRQ0                             (1U)           /* External Interrupt 0 */
#define BITM_ALWAYS_ON_EICLR_IRQ0                             (0X0001U)      /* External Interrupt 0 */
#define BITP_ALWAYS_ON_EICLR_IRQ1                             (1U)           /* External Interrupt 1 */
#define BITL_ALWAYS_ON_EICLR_IRQ1                             (1U)           /* External Interrupt 1 */
#define BITM_ALWAYS_ON_EICLR_IRQ1                             (0X0002U)      /* External Interrupt 1 */
#define BITP_ALWAYS_ON_EICLR_IRQ2                             (2U)           /* External Interrupt 2 */
#define BITL_ALWAYS_ON_EICLR_IRQ2                             (1U)           /* External Interrupt 2 */
#define BITM_ALWAYS_ON_EICLR_IRQ2                             (0X0004U)      /* External Interrupt 2 */
#define BITP_ALWAYS_ON_EICLR_IRQ3                             (3U)           /* External Interrupt 3 */
#define BITL_ALWAYS_ON_EICLR_IRQ3                             (1U)           /* External Interrupt 3 */
#define BITM_ALWAYS_ON_EICLR_IRQ3                             (0X0008U)      /* External Interrupt 3 */
#define BITP_ALWAYS_ON_EICLR_IRQ4                             (4U)           /* External Interrupt 4 */
#define BITL_ALWAYS_ON_EICLR_IRQ4                             (1U)           /* External Interrupt 4 */
#define BITM_ALWAYS_ON_EICLR_IRQ4                             (0X0010U)      /* External Interrupt 4 */
#define BITP_ALWAYS_ON_EICLR_IRQ5                             (5U)           /* External Interrupt 5 */
#define BITL_ALWAYS_ON_EICLR_IRQ5                             (1U)           /* External Interrupt 5 */
#define BITM_ALWAYS_ON_EICLR_IRQ5                             (0X0020U)      /* External Interrupt 5 */
#define BITP_ALWAYS_ON_EICLR_IRQ6                             (6U)           /* External Interrupt 6 */
#define BITL_ALWAYS_ON_EICLR_IRQ6                             (1U)           /* External Interrupt 6 */
#define BITM_ALWAYS_ON_EICLR_IRQ6                             (0X0040U)      /* External Interrupt 6 */
#define BITP_ALWAYS_ON_EICLR_IRQ7                             (7U)           /* External Interrupt 7 */
#define BITL_ALWAYS_ON_EICLR_IRQ7                             (1U)           /* External Interrupt 7 */
#define BITM_ALWAYS_ON_EICLR_IRQ7                             (0X0080U)      /* External Interrupt 7 */
#define BITP_ALWAYS_ON_EICLR_IRQ8                             (8U)           /* External Interrupt 8 */
#define BITL_ALWAYS_ON_EICLR_IRQ8                             (1U)           /* External Interrupt 8 */
#define BITM_ALWAYS_ON_EICLR_IRQ8                             (0X0100U)      /* External Interrupt 8 */
#define BITP_ALWAYS_ON_EICLR_IRQ9                             (9U)           /* External Interrupt 9 */
#define BITL_ALWAYS_ON_EICLR_IRQ9                             (1U)           /* External Interrupt 9 */
#define BITM_ALWAYS_ON_EICLR_IRQ9                             (0X0200U)      /* External Interrupt 9 */

#define ENUM_ALWAYS_ON_EICLR_IRQ9_NOTCLR                      (0X0000U)      /* No description provided */
#define ENUM_ALWAYS_ON_EICLR_IRQ9_CLR                         (0X0001U)      /* No description provided */
#define ENUM_ALWAYS_ON_EICLR_IRQ8_NOTCLR                      (0X0000U)      /* No description provided */
#define ENUM_ALWAYS_ON_EICLR_IRQ8_CLR                         (0X0001U)      /* No description provided */
#define ENUM_ALWAYS_ON_EICLR_IRQ7_NOTCLR                      (0X0000U)      /* No description provided */
#define ENUM_ALWAYS_ON_EICLR_IRQ7_CLR                         (0X0001U)      /* No description provided */
#define ENUM_ALWAYS_ON_EICLR_IRQ6_NOTCLR                      (0X0000U)      /* No description provided */
#define ENUM_ALWAYS_ON_EICLR_IRQ6_CLR                         (0X0001U)      /* No description provided */
#define ENUM_ALWAYS_ON_EICLR_IRQ5_NOTCLR                      (0X0000U)      /* No description provided */
#define ENUM_ALWAYS_ON_EICLR_IRQ5_CLR                         (0X0001U)      /* No description provided */
#define ENUM_ALWAYS_ON_EICLR_IRQ4_NOTCLR                      (0X0000U)      /* No description provided */
#define ENUM_ALWAYS_ON_EICLR_IRQ4_CLR                         (0X0001U)      /* No description provided */
#define ENUM_ALWAYS_ON_EICLR_IRQ3_NOTCLR                      (0X0000U)      /* No description provided */
#define ENUM_ALWAYS_ON_EICLR_IRQ3_CLR                         (0X0001U)      /* No description provided */
#define ENUM_ALWAYS_ON_EICLR_IRQ2_NOTCLR                      (0X0000U)      /* No description provided */
#define ENUM_ALWAYS_ON_EICLR_IRQ2_CLR                         (0X0001U)      /* No description provided */
#define ENUM_ALWAYS_ON_EICLR_IRQ1_NOTCLR                      (0X0000U)      /* No description provided */
#define ENUM_ALWAYS_ON_EICLR_IRQ1_CLR                         (0X0001U)      /* No description provided */
#define ENUM_ALWAYS_ON_EICLR_IRQ0_NOTCLR                      (0X0000U)      /* No description provided */
#define ENUM_ALWAYS_ON_EICLR_IRQ0_CLR                         (0X0001U)      /* No description provided */

