ChibiOS/ChibiOS/os/common/ext/ADI/ADUCM41x/ADuCM410.h
/* ----------------------------------------------------------------------------------------------------
          RSTSTA                                                Value             Description
   ---------------------------------------------------------------------------------------------------- */
#define BITP_ALWAYS_ON_RSTSTA_POR                             (0U)           /* Power-on Reset */
#define BITL_ALWAYS_ON_RSTSTA_POR                             (1U)           /* Power-on Reset */
#define BITM_ALWAYS_ON_RSTSTA_POR                             (0X0001U)      /* Power-on Reset */
#define BITP_ALWAYS_ON_RSTSTA_EXTRST                          (1U)           /* External Reset */
#define BITL_ALWAYS_ON_RSTSTA_EXTRST                          (1U)           /* External Reset */
#define BITM_ALWAYS_ON_RSTSTA_EXTRST                          (0X0002U)      /* External Reset */
#define BITP_ALWAYS_ON_RSTSTA_WDRST                           (2U)           /* Watchdog Timeout */
#define BITL_ALWAYS_ON_RSTSTA_WDRST                           (1U)           /* Watchdog Timeout */
#define BITM_ALWAYS_ON_RSTSTA_WDRST                           (0X0004U)      /* Watchdog Timeout */
#define BITP_ALWAYS_ON_RSTSTA_SWRST                           (3U)           /* Software Reset */
#define BITL_ALWAYS_ON_RSTSTA_SWRST                           (1U)           /* Software Reset */
#define BITM_ALWAYS_ON_RSTSTA_SWRST                           (0X0008U)      /* Software Reset */

#endif  /* end ifndef ALWAYS_ON_ADDR_RDEF_H_ */


#ifndef PLA_ADDR_RDEF_H_
#define PLA_ADDR_RDEF_H_    /* PLA: PLA Register Map */

/* ====================================================================================================
        PLA Module Instances Address and Mask Definitions
   ==================================================================================================== */
#define INST_PLA                                                 (0X40006000U)    /* pla: */

#define MASK_PLA                                                 (0XFFFFFFFFU)    /* PLA: PLA Register Map */

/* ====================================================================================================
        PLA Module Register Address Offset Definitions
   ==================================================================================================== */
#define IDX_PLA_PLA_ELEM0                                       (0X00000000U)    /* ELEMx Configuration Register */
#define IDX_PLA_PLA_ELEM1                                       (0X00000004U)    /* ELEMx Configuration Register */
#define IDX_PLA_PLA_ELEM2                                       (0X00000008U)    /* ELEMx Configuration Register */
#define IDX_PLA_PLA_ELEM3                                       (0X0000000CU)    /* ELEMx Configuration Register */
#define IDX_PLA_PLA_ELEM4                                       (0X00000010U)    /* ELEMx Configuration Register */
#define IDX_PLA_PLA_ELEM5                                       (0X00000014U)    /* ELEMx Configuration Register */
#define IDX_PLA_PLA_ELEM6                                       (0X00000018U)    /* ELEMx Configuration Register */
#define IDX_PLA_PLA_ELEM7                                       (0X0000001CU)    /* ELEMx Configuration Register */
#define IDX_PLA_PLA_ELEM8                                       (0X00000020U)    /* ELEMx Configuration Register */
#define IDX_PLA_PLA_ELEM9                                       (0X00000024U)    /* ELEMx Configuration Register */
#define IDX_PLA_PLA_ELEM10                                      (0X00000028U)    /* ELEMx Configuration Register */
#define IDX_PLA_PLA_ELEM11                                      (0X0000002CU)    /* ELEMx Configuration Register */
#define IDX_PLA_PLA_ELEM12                                      (0X00000030U)    /* ELEMx Configuration Register */
#define IDX_PLA_PLA_ELEM13                                      (0X00000034U)    /* ELEMx Configuration Register */
#define IDX_PLA_PLA_ELEM14                                      (0X00000038U)    /* ELEMx Configuration Register */
#define IDX_PLA_PLA_ELEM15                                      (0X0000003CU)    /* ELEMx Configuration Register */
#define IDX_PLA_PLA_ELEM16                                      (0X00000040U)    /* ELEMx Configuration Register */
#define IDX_PLA_PLA_ELEM17                                      (0X00000044U)    /* ELEMx Configuration Register */
#define IDX_PLA_PLA_ELEM18                                      (0X00000048U)    /* ELEMx Configuration Register */
#define IDX_PLA_PLA_ELEM19                                      (0X0000004CU)    /* ELEMx Configuration Register */
#define IDX_PLA_PLA_ELEM20                                      (0X00000050U)    /* ELEMx Configuration Register */
#define IDX_PLA_PLA_ELEM21                                      (0X00000054U)    /* ELEMx Configuration Register */
#define IDX_PLA_PLA_ELEM22                                      (0X00000058U)    /* ELEMx Configuration Register */
#define IDX_PLA_PLA_ELEM23                                      (0X0000005CU)    /* ELEMx Configuration Register */
#define IDX_PLA_PLA_ELEM24                                      (0X00000060U)    /* ELEMx Configuration Register */
#define IDX_PLA_PLA_ELEM25                                      (0X00000064U)    /* ELEMx Configuration Register */
#define IDX_PLA_PLA_ELEM26                                      (0X00000068U)    /* ELEMx Configuration Register */
#define IDX_PLA_PLA_ELEM27                                      (0X0000006CU)    /* ELEMx Configuration Register */
#define IDX_PLA_PLA_ELEM28                                      (0X00000070U)    /* ELEMx Configuration Register */
#define IDX_PLA_PLA_ELEM29                                      (0X00000074U)    /* ELEMx Configuration Register */
#define IDX_PLA_PLA_ELEM30                                      (0X00000078U)    /* ELEMx Configuration Register */
#define IDX_PLA_PLA_ELEM31                                      (0X0000007CU)    /* ELEMx Configuration Register */
#define IDX_PLA_PLA_CLK                                         (0X00000080U)    /* PLA Clock Select */
#define IDX_PLA_PLA_IRQ0                                        (0X00000084U)    /* Interrupt Register for Block 0 */
#define IDX_PLA_PLA_IRQ1                                        (0X00000088U)    /* Interrupt Register for Block1 */
#define IDX_PLA_PLA_ADC                                         (0X0000008CU)    /* ADC Configuration Register */
#define IDX_PLA_PLA_DIN0                                        (0X00000090U)    /* AMBA Bus Data Input for Block 0 */
#define IDX_PLA_PLA_DOUT0                                       (0X00000098U)    /* AMBA Bus Data Output for Block 0 */
#define IDX_PLA_PLA_DOUT1                                       (0X0000009CU)    /* AMBA Bus Data Output for Block1 */
#define IDX_PLA_PLA_LCK                                         (0X000000A0U)    /* Write Lock Register. */
#define IDX_PLA_PLA_IRQTYPE                                     (0X000000A4U)    /* PLA Interrupt Request and DMA Request Type */

