ChibiOS/ChibiOS/os/common/ext/ADI/ADUCM41x/ADuCM410.h
/* ----------------------------------------------------------------------------------------------------
          PLA_ADC                                               Value             Description
   ---------------------------------------------------------------------------------------------------- */
#define BITP_PLA_PLA_ADC_CONVST_SRC                           (0U)           /* Element for ADC Start Convert Source */
#define BITL_PLA_PLA_ADC_CONVST_SRC                           (5U)           /* Element for ADC Start Convert Source */
#define BITM_PLA_PLA_ADC_CONVST_SRC                           (0X001FU)      /* Element for ADC Start Convert Source */
#define BITP_PLA_PLA_ADC_CONVST_EN                            (5U)           /* Bit to Enable ADC Start Convert from PLA */
#define BITL_PLA_PLA_ADC_CONVST_EN                            (1U)           /* Bit to Enable ADC Start Convert from PLA */
#define BITM_PLA_PLA_ADC_CONVST_EN                            (0X0020U)      /* Bit to Enable ADC Start Convert from PLA */

#define ENUM_PLA_PLA_ADC_CONVST_EN_DISABLE                    (0X0000U)      /* Disable */
#define ENUM_PLA_PLA_ADC_CONVST_EN_ENABLE                     (0X0001U)      /* Enable */

/* ----------------------------------------------------------------------------------------------------
          PLA_DIN0                                              Value             Description
   ---------------------------------------------------------------------------------------------------- */
#define BITP_PLA_PLA_DIN0_DIN                                 (0U)           /* Input Bit to Element 15 to Element 0. */
#define BITL_PLA_PLA_DIN0_DIN                                 (16U)          /* Input Bit to Element 15 to Element 0. */
#define BITM_PLA_PLA_DIN0_DIN                                 (0XFFFFU)      /* Input Bit to Element 15 to Element 0. */

/* ----------------------------------------------------------------------------------------------------
          PLA_DOUT0                                             Value             Description
   ---------------------------------------------------------------------------------------------------- */
#define BITP_PLA_PLA_DOUT0_E0                                 (0U)           /* Output Bit from Element 0 */
#define BITL_PLA_PLA_DOUT0_E0                                 (1U)           /* Output Bit from Element 0 */
#define BITM_PLA_PLA_DOUT0_E0                                 (0X0001U)      /* Output Bit from Element 0 */
#define BITP_PLA_PLA_DOUT0_E1                                 (1U)           /* Output Bit from Element 1 */
#define BITL_PLA_PLA_DOUT0_E1                                 (1U)           /* Output Bit from Element 1 */
#define BITM_PLA_PLA_DOUT0_E1                                 (0X0002U)      /* Output Bit from Element 1 */
#define BITP_PLA_PLA_DOUT0_E2                                 (2U)           /* Output Bit from Element 2 */
#define BITL_PLA_PLA_DOUT0_E2                                 (1U)           /* Output Bit from Element 2 */
#define BITM_PLA_PLA_DOUT0_E2                                 (0X0004U)      /* Output Bit from Element 2 */
#define BITP_PLA_PLA_DOUT0_E3                                 (3U)           /* Output Bit from Element 3 */
#define BITL_PLA_PLA_DOUT0_E3                                 (1U)           /* Output Bit from Element 3 */
#define BITM_PLA_PLA_DOUT0_E3                                 (0X0008U)      /* Output Bit from Element 3 */
#define BITP_PLA_PLA_DOUT0_E4                                 (4U)           /* Output Bit from Element 4 */
#define BITL_PLA_PLA_DOUT0_E4                                 (1U)           /* Output Bit from Element 4 */
#define BITM_PLA_PLA_DOUT0_E4                                 (0X0010U)      /* Output Bit from Element 4 */
#define BITP_PLA_PLA_DOUT0_E5                                 (5U)           /* Output Bit from Element 5 */
#define BITL_PLA_PLA_DOUT0_E5                                 (1U)           /* Output Bit from Element 5 */
#define BITM_PLA_PLA_DOUT0_E5                                 (0X0020U)      /* Output Bit from Element 5 */
#define BITP_PLA_PLA_DOUT0_E6                                 (6U)           /* Output Bit from Element 6 */
#define BITL_PLA_PLA_DOUT0_E6                                 (1U)           /* Output Bit from Element 6 */
#define BITM_PLA_PLA_DOUT0_E6                                 (0X0040U)      /* Output Bit from Element 6 */
#define BITP_PLA_PLA_DOUT0_E7                                 (7U)           /* Output Bit from Element 7 */
#define BITL_PLA_PLA_DOUT0_E7                                 (1U)           /* Output Bit from Element 7 */
#define BITM_PLA_PLA_DOUT0_E7                                 (0X0080U)      /* Output Bit from Element 7 */
#define BITP_PLA_PLA_DOUT0_E8                                 (8U)           /* Output Bit from Element 8 */
#define BITL_PLA_PLA_DOUT0_E8                                 (1U)           /* Output Bit from Element 8 */
#define BITM_PLA_PLA_DOUT0_E8                                 (0X0100U)      /* Output Bit from Element 8 */
#define BITP_PLA_PLA_DOUT0_E9                                 (9U)           /* Output Bit from Element 9 */
#define BITL_PLA_PLA_DOUT0_E9                                 (1U)           /* Output Bit from Element 9 */
#define BITM_PLA_PLA_DOUT0_E9                                 (0X0200U)      /* Output Bit from Element 9 */
#define BITP_PLA_PLA_DOUT0_E10                                (10U)          /* Output Bit from Element 10 */
#define BITL_PLA_PLA_DOUT0_E10                                (1U)           /* Output Bit from Element 10 */
#define BITM_PLA_PLA_DOUT0_E10                                (0X0400U)      /* Output Bit from Element 10 */
#define BITP_PLA_PLA_DOUT0_E11                                (11U)          /* Output Bit from Element 11 */
#define BITL_PLA_PLA_DOUT0_E11                                (1U)           /* Output Bit from Element 11 */
#define BITM_PLA_PLA_DOUT0_E11                                (0X0800U)      /* Output Bit from Element 11 */
#define BITP_PLA_PLA_DOUT0_E12                                (12U)          /* Output Bit from Element 12 */
#define BITL_PLA_PLA_DOUT0_E12                                (1U)           /* Output Bit from Element 12 */
#define BITM_PLA_PLA_DOUT0_E12                                (0X1000U)      /* Output Bit from Element 12 */
#define BITP_PLA_PLA_DOUT0_E13                                (13U)          /* Output Bit from Element 13 */
#define BITL_PLA_PLA_DOUT0_E13                                (1U)           /* Output Bit from Element 13 */
#define BITM_PLA_PLA_DOUT0_E13                                (0X2000U)      /* Output Bit from Element 13 */
#define BITP_PLA_PLA_DOUT0_E14                                (14U)          /* Output Bit from Element 14 */
#define BITL_PLA_PLA_DOUT0_E14                                (1U)           /* Output Bit from Element 14 */
#define BITM_PLA_PLA_DOUT0_E14                                (0X4000U)      /* Output Bit from Element 14 */
#define BITP_PLA_PLA_DOUT0_E15                                (15U)          /* Output Bit from Element 15 */
#define BITL_PLA_PLA_DOUT0_E15                                (1U)           /* Output Bit from Element 15 */
#define BITM_PLA_PLA_DOUT0_E15                                (0X8000U)      /* Output Bit from Element 15 */

