ChibiOS/ChibiOS/os/common/ext/ADI/ADUCM41x/ADuCM410.h
/* ====================================================================================================
        DMAREQ Module Register BitPositions, Lengths, Masks and Enumerations Definitions
   ==================================================================================================== */

/* ----------------------------------------------------------------------------------------------------
          REQEN                                                 Value             Description
   ---------------------------------------------------------------------------------------------------- */
#define BITP_DMAREQ_REQEN_GPLA_DMA_EN0                        (0U)           /* GPT/GPT32 and PLA DMA Request 0 Enable */
#define BITL_DMAREQ_REQEN_GPLA_DMA_EN0                        (1U)           /* GPT/GPT32 and PLA DMA Request 0 Enable */
#define BITM_DMAREQ_REQEN_GPLA_DMA_EN0                        (0X01U)        /* GPT/GPT32 and PLA DMA Request 0 Enable */
#define BITP_DMAREQ_REQEN_GPLA_DMA_EN1                        (1U)           /* GPT/GPT32 and PLA DMA Request 1 Enable */
#define BITL_DMAREQ_REQEN_GPLA_DMA_EN1                        (1U)           /* GPT/GPT32 and PLA DMA Request 1 Enable */
#define BITM_DMAREQ_REQEN_GPLA_DMA_EN1                        (0X02U)        /* GPT/GPT32 and PLA DMA Request 1 Enable */

/* ----------------------------------------------------------------------------------------------------
          REQ0SEL                                               Value             Description
   ---------------------------------------------------------------------------------------------------- */
#define BITP_DMAREQ_REQ0SEL_DMA_REQ0_SEL                      (0U)           /* GPT/GPT32 and PLA DMA Request 0 Source Select */
#define BITL_DMAREQ_REQ0SEL_DMA_REQ0_SEL                      (4U)           /* GPT/GPT32 and PLA DMA Request 0 Source Select */
#define BITM_DMAREQ_REQ0SEL_DMA_REQ0_SEL                      (0X0FU)        /* GPT/GPT32 and PLA DMA Request 0 Source Select */

#define ENUM_DMAREQ_REQ0SEL_DMA_REQ0_SEL_PLA_REQ0             (0X00U)        /* PLA DMA Request 0 */
#define ENUM_DMAREQ_REQ0SEL_DMA_REQ0_SEL_PLA_REQ1             (0X01U)        /* PLA DMA Request 1 */
#define ENUM_DMAREQ_REQ0SEL_DMA_REQ0_SEL_PLA_REQ2             (0X02U)        /* PLA DMA Request 2 */
#define ENUM_DMAREQ_REQ0SEL_DMA_REQ0_SEL_PLA_REQ3             (0X03U)        /* PLA DMA Request 3 */
#define ENUM_DMAREQ_REQ0SEL_DMA_REQ0_SEL_GPT_REQ0             (0X04U)        /* GPT 0 DMA Request */
#define ENUM_DMAREQ_REQ0SEL_DMA_REQ0_SEL_GPT_REQ1             (0X05U)        /* GPT 1 DMA Request */
#define ENUM_DMAREQ_REQ0SEL_DMA_REQ0_SEL_GPT_REQ2             (0X06U)        /* GPT 2 DMA Request */
#define ENUM_DMAREQ_REQ0SEL_DMA_REQ0_SEL_GPT32_REQ0           (0X07U)        /* GPT32 0 DMA Request */
#define ENUM_DMAREQ_REQ0SEL_DMA_REQ0_SEL_GPT32_REQ1           (0X08U)        /* GPT32 1 DMA Request */

/* ----------------------------------------------------------------------------------------------------
          REQ1SEL                                               Value             Description
   ---------------------------------------------------------------------------------------------------- */
#define BITP_DMAREQ_REQ1SEL_DMA_REQ1_SEL                      (0U)           /* GPT/GPT32 and PLA DMA Request 1 Source Select */
#define BITL_DMAREQ_REQ1SEL_DMA_REQ1_SEL                      (4U)           /* GPT/GPT32 and PLA DMA Request 1 Source Select */
#define BITM_DMAREQ_REQ1SEL_DMA_REQ1_SEL                      (0X0FU)        /* GPT/GPT32 and PLA DMA Request 1 Source Select */

#define ENUM_DMAREQ_REQ1SEL_DMA_REQ1_SEL_PLA_REQ0             (0X00U)        /* PLA DMA Request 0 */
#define ENUM_DMAREQ_REQ1SEL_DMA_REQ1_SEL_PLA_REQ1             (0X01U)        /* PLA DMA Request 1 */
#define ENUM_DMAREQ_REQ1SEL_DMA_REQ1_SEL_PLA_REQ2             (0X02U)        /* PLA DMA Request 2 */
#define ENUM_DMAREQ_REQ1SEL_DMA_REQ1_SEL_PLA_REQ3             (0X03U)        /* PLA DMA Request 3 */
#define ENUM_DMAREQ_REQ1SEL_DMA_REQ1_SEL_GPT_REQ0             (0X04U)        /* GPT 0 DMA Request */
#define ENUM_DMAREQ_REQ1SEL_DMA_REQ1_SEL_GPT_REQ1             (0X05U)        /* GPT 1 DMA Request */
#define ENUM_DMAREQ_REQ1SEL_DMA_REQ1_SEL_GPT_REQ2             (0X06U)        /* GPT 2 DMA Request */
#define ENUM_DMAREQ_REQ1SEL_DMA_REQ1_SEL_GPT32_REQ0           (0X07U)        /* GPT32 0 DMA Request */
#define ENUM_DMAREQ_REQ1SEL_DMA_REQ1_SEL_GPT32_REQ1           (0X08U)        /* GPT32 1 DMA Request */

/* ----------------------------------------------------------------------------------------------------
          PLAREQEN                                              Value             Description
   ---------------------------------------------------------------------------------------------------- */
#define BITP_DMAREQ_PLAREQEN_PLA_DMA_REQ0_EN                  (0U)           /* PLA DMA Request 0 Enable */
#define BITL_DMAREQ_PLAREQEN_PLA_DMA_REQ0_EN                  (1U)           /* PLA DMA Request 0 Enable */
#define BITM_DMAREQ_PLAREQEN_PLA_DMA_REQ0_EN                  (0X01U)        /* PLA DMA Request 0 Enable */
#define BITP_DMAREQ_PLAREQEN_PLA_DMA_REQ1_EN                  (1U)           /* PLA DMA Request 1 Enable */
#define BITL_DMAREQ_PLAREQEN_PLA_DMA_REQ1_EN                  (1U)           /* PLA DMA Request 1 Enable */
#define BITM_DMAREQ_PLAREQEN_PLA_DMA_REQ1_EN                  (0X02U)        /* PLA DMA Request 1 Enable */
#define BITP_DMAREQ_PLAREQEN_PLA_DMA_REQ2_EN                  (2U)           /* PLA DMA Request 2 Enable */
#define BITL_DMAREQ_PLAREQEN_PLA_DMA_REQ2_EN                  (1U)           /* PLA DMA Request 2 Enable */
#define BITM_DMAREQ_PLAREQEN_PLA_DMA_REQ2_EN                  (0X04U)        /* PLA DMA Request 2 Enable */
#define BITP_DMAREQ_PLAREQEN_PLA_DMA_REQ3_EN                  (3U)           /* PLA DMA Request 3 Enable */
#define BITL_DMAREQ_PLAREQEN_PLA_DMA_REQ3_EN                  (1U)           /* PLA DMA Request 3 Enable */
#define BITM_DMAREQ_PLAREQEN_PLA_DMA_REQ3_EN                  (0X08U)        /* PLA DMA Request 3 Enable */

