ChibiOS/ChibiOS/os/common/ext/ADI/ADUCM41x/ADuCM410.h
/* ----------------------------------------------------------------------------------------------------
          GPTREQEN                                              Value             Description
   ---------------------------------------------------------------------------------------------------- */
#define BITP_DMAREQ_GPTREQEN_GPT_DMA_REQ0_EN                  (0U)           /* GPT 0 DMA Request Enable */
#define BITL_DMAREQ_GPTREQEN_GPT_DMA_REQ0_EN                  (1U)           /* GPT 0 DMA Request Enable */
#define BITM_DMAREQ_GPTREQEN_GPT_DMA_REQ0_EN                  (0X01U)        /* GPT 0 DMA Request Enable */
#define BITP_DMAREQ_GPTREQEN_GPT_DMA_REQ1_EN                  (1U)           /* GPT 1 DMA Request Enable */
#define BITL_DMAREQ_GPTREQEN_GPT_DMA_REQ1_EN                  (1U)           /* GPT 1 DMA Request Enable */
#define BITM_DMAREQ_GPTREQEN_GPT_DMA_REQ1_EN                  (0X02U)        /* GPT 1 DMA Request Enable */
#define BITP_DMAREQ_GPTREQEN_GPT_DMA_REQ2_EN                  (2U)           /* GPT 2 DMA Request Enable */
#define BITL_DMAREQ_GPTREQEN_GPT_DMA_REQ2_EN                  (1U)           /* GPT 2 DMA Request Enable */
#define BITM_DMAREQ_GPTREQEN_GPT_DMA_REQ2_EN                  (0X04U)        /* GPT 2 DMA Request Enable */
#define BITP_DMAREQ_GPTREQEN_GPT32_DMA_REQ0_EN                (3U)           /* GPT32 0 DMA Request Enable */
#define BITL_DMAREQ_GPTREQEN_GPT32_DMA_REQ0_EN                (1U)           /* GPT32 0 DMA Request Enable */
#define BITM_DMAREQ_GPTREQEN_GPT32_DMA_REQ0_EN                (0X08U)        /* GPT32 0 DMA Request Enable */
#define BITP_DMAREQ_GPTREQEN_GPT32_DMA_REQ1_EN                (4U)           /* GPT32 1 DMA Request Enable */
#define BITL_DMAREQ_GPTREQEN_GPT32_DMA_REQ1_EN                (1U)           /* GPT32 1 DMA Request Enable */
#define BITM_DMAREQ_GPTREQEN_GPT32_DMA_REQ1_EN                (0X10U)        /* GPT32 1 DMA Request Enable */

/* ----------------------------------------------------------------------------------------------------
          GPT_MDA_REQ_TTYPE                                     Value             Description
   ---------------------------------------------------------------------------------------------------- */
#define BITP_DMAREQ_GPT_MDA_REQ_TTYPE_GPT_REQ0_TYPE           (0U)           /* GPT Req0 DMA Require Type */
#define BITL_DMAREQ_GPT_MDA_REQ_TTYPE_GPT_REQ0_TYPE           (2U)           /* GPT Req0 DMA Require Type */
#define BITM_DMAREQ_GPT_MDA_REQ_TTYPE_GPT_REQ0_TYPE           (0X0003U)      /* GPT Req0 DMA Require Type */
#define BITP_DMAREQ_GPT_MDA_REQ_TTYPE_GPT_REQ1_TYPE           (2U)           /* GPT Req1 DMA Require Type */
#define BITL_DMAREQ_GPT_MDA_REQ_TTYPE_GPT_REQ1_TYPE           (2U)           /* GPT Req1 DMA Require Type */
#define BITM_DMAREQ_GPT_MDA_REQ_TTYPE_GPT_REQ1_TYPE           (0X000CU)      /* GPT Req1 DMA Require Type */
#define BITP_DMAREQ_GPT_MDA_REQ_TTYPE_GPT_REQ2_TYPE           (4U)           /* GPT Req2 DMA Require Type */
#define BITL_DMAREQ_GPT_MDA_REQ_TTYPE_GPT_REQ2_TYPE           (2U)           /* GPT Req2 DMA Require Type */
#define BITM_DMAREQ_GPT_MDA_REQ_TTYPE_GPT_REQ2_TYPE           (0X0030U)      /* GPT Req2 DMA Require Type */
#define BITP_DMAREQ_GPT_MDA_REQ_TTYPE_GPT32_REQ0_TYPE         (6U)           /* GPT32 Req0 DMA Require Type */
#define BITL_DMAREQ_GPT_MDA_REQ_TTYPE_GPT32_REQ0_TYPE         (2U)           /* GPT32 Req0 DMA Require Type */
#define BITM_DMAREQ_GPT_MDA_REQ_TTYPE_GPT32_REQ0_TYPE         (0X00C0U)      /* GPT32 Req0 DMA Require Type */
#define BITP_DMAREQ_GPT_MDA_REQ_TTYPE_GPT32_REQ1_TYPE         (8U)           /* GPT32 Req1 DMA Require Type */
#define BITL_DMAREQ_GPT_MDA_REQ_TTYPE_GPT32_REQ1_TYPE         (2U)           /* GPT32 Req1 DMA Require Type */
#define BITM_DMAREQ_GPT_MDA_REQ_TTYPE_GPT32_REQ1_TYPE         (0X0300U)      /* GPT32 Req1 DMA Require Type */

#define ENUM_DMAREQ_GPT_MDA_REQ_TTYPE_GPT32_REQ1_TYPE_HIGH_LEVEL (0X0000U)      /* High Level Trigger Interrupt and High Level Trigger DMA Request */
#define ENUM_DMAREQ_GPT_MDA_REQ_TTYPE_GPT32_REQ1_TYPE_RISING_EDGE (0X0001U)      /* Rising Edge Trigger Interrupt and Rising Edge Trigger DMA Request */
#define ENUM_DMAREQ_GPT_MDA_REQ_TTYPE_GPT32_REQ1_TYPE_LOW_LEVEL (0X0002U)      /* Low Level Trigger Interrupt and Low Level Trigger DMA Request */
#define ENUM_DMAREQ_GPT_MDA_REQ_TTYPE_GPT32_REQ1_TYPE_FALLING_EDGE (0X0003U)      /* Falling Edge Trigger Interrupt and Falling Edge Trigger DMA Request */
#define ENUM_DMAREQ_GPT_MDA_REQ_TTYPE_GPT32_REQ0_TYPE_HIGH_LEVEL (0X0000U)      /* High Level Trigger Interrupt and High Level Trigger DMA Request */
#define ENUM_DMAREQ_GPT_MDA_REQ_TTYPE_GPT32_REQ0_TYPE_RISING_EDGE (0X0001U)      /* Rising Edge Trigger Interrupt and Rising Edge Trigger DMA Request */
#define ENUM_DMAREQ_GPT_MDA_REQ_TTYPE_GPT32_REQ0_TYPE_LOW_LEVEL (0X0002U)      /* Low Level Trigger Interrupt and Low Level Trigger DMA Request */
#define ENUM_DMAREQ_GPT_MDA_REQ_TTYPE_GPT32_REQ0_TYPE_FALLING_EDGE (0X0003U)      /* Falling Edge Trigger Interrupt and Falling Edge Trigger DMA Request */
#define ENUM_DMAREQ_GPT_MDA_REQ_TTYPE_GPT_REQ2_TYPE_HIGH_LEVEL (0X0000U)      /* High Level Trigger Interrupt and High Level Trigger DMA Request */
#define ENUM_DMAREQ_GPT_MDA_REQ_TTYPE_GPT_REQ2_TYPE_RISING_EDGE (0X0001U)      /* Rising Edge Trigger Interrupt and Rising Edge Trigger DMA Request */
#define ENUM_DMAREQ_GPT_MDA_REQ_TTYPE_GPT_REQ2_TYPE_LOW_LEVEL (0X0002U)      /* Low Level Trigger Interrupt and Low Level Trigger DMA Request */
#define ENUM_DMAREQ_GPT_MDA_REQ_TTYPE_GPT_REQ2_TYPE_FALLING_EDGE (0X0003U)      /* Falling Edge Trigger Interrupt and Falling Edge Trigger DMA Request */
#define ENUM_DMAREQ_GPT_MDA_REQ_TTYPE_GPT_REQ1_TYPE_HIGH_LEVEL (0X0000U)      /* High Level Trigger Interrupt and High Level Trigger DMA Request */
#define ENUM_DMAREQ_GPT_MDA_REQ_TTYPE_GPT_REQ1_TYPE_RISING_EDGE (0X0001U)      /* Rising Edge Trigger Interrupt and Rising Edge Trigger DMA Request */
#define ENUM_DMAREQ_GPT_MDA_REQ_TTYPE_GPT_REQ1_TYPE_LOW_LEVEL (0X0002U)      /* Low Level Trigger Interrupt and Low Level Trigger DMA Request */
#define ENUM_DMAREQ_GPT_MDA_REQ_TTYPE_GPT_REQ1_TYPE_FALLING_EDGE (0X0003U)      /* Falling Edge Trigger Interrupt and Falling Edge Trigger DMA Request */
#define ENUM_DMAREQ_GPT_MDA_REQ_TTYPE_GPT_REQ0_TYPE_HIGH_LEVEL (0X0000U)      /* High Level Trigger Interrupt and High Level Trigger DMA Request */
#define ENUM_DMAREQ_GPT_MDA_REQ_TTYPE_GPT_REQ0_TYPE_RISING_EDGE (0X0001U)      /* Rising Edge Trigger Interrupt and Rising Edge Trigger DMA Request */
#define ENUM_DMAREQ_GPT_MDA_REQ_TTYPE_GPT_REQ0_TYPE_LOW_LEVEL (0X0002U)      /* Low Level Trigger Interrupt and Low Level Trigger DMA Request */
#define ENUM_DMAREQ_GPT_MDA_REQ_TTYPE_GPT_REQ0_TYPE_FALLING_EDGE (0X0003U)      /* Falling Edge Trigger Interrupt and Falling Edge Trigger DMA Request */

#endif  /* end ifndef DMAREQ_ADDR_RDEF_H_ */


#ifndef UART_ADDR_RDEF_H_
#define UART_ADDR_RDEF_H_    /* UART: Universal Asynchronous Receiver/Transmitter */

