ChibiOS/ChibiOS/os/common/ext/ADI/ADUCM41x/ADuCM410.h
/* ====================================================================================================
        UART Module Instances Address and Mask Definitions
   ==================================================================================================== */
#define INST_UART0                                               (0X40020000U)    /* uart0: */
#define INST_UART1                                               (0X40020400U)    /* uart1: */

#define MASK_UART                                                (0X000000FFU)    /* UART: Universal Asynchronous Receiver/Transmitter */

/* ====================================================================================================
        UART Module Register Address Offset Definitions
   ==================================================================================================== */
#define IDX_UART_RX                                             (0X00U)    /* Receive/transfer Buffer Register */
#define IDX_UART_IEN                                            (0X04U)    /* Interrupt Enable */
#define IDX_UART_IIR                                            (0X08U)    /* Interrupt ID */
#define IDX_UART_LCR                                            (0X0CU)    /* Line Control */
#define IDX_UART_MCR                                            (0X10U)    /* Modem Control */
#define IDX_UART_LSR                                            (0X14U)    /* Line Status */
#define IDX_UART_MSR                                            (0X18U)    /* Modem Status */
#define IDX_UART_SCR                                            (0X1CU)    /* Scratch Buffer */
#define IDX_UART_FCR                                            (0X20U)    /* FIFO Control */
#define IDX_UART_FBR                                            (0X24U)    /* Fractional Baud Rate */
#define IDX_UART_DIV                                            (0X28U)    /* Baudrate Divider */
#define IDX_UART_LCR2                                           (0X2CU)    /* Second Line Control */
#define IDX_UART_CTL                                            (0X30U)    /* UART Control Register */
#define IDX_UART_RFC                                            (0X34U)    /* RX FIFO Byte Count */
#define IDX_UART_TFC                                            (0X38U)    /* TX FIFO Byte Count */
#define IDX_UART_RSC                                            (0X3CU)    /* RS485 Half-duplex Control */
#define IDX_UART_ACR                                            (0X40U)    /* Auto Baud Control */
#define IDX_UART_ASRL                                           (0X44U)    /* Auto Baud Status (Low) */
#define IDX_UART_ASRH                                           (0X48U)    /* Auto Baud Status (High) */

/* ====================================================================================================
        UART Module Register ResetValue Definitions
   ==================================================================================================== */
#define RSTVAL_UART_RX                                             (0X0) 
#define RSTVAL_UART_IEN                                            (0X0) 
#define RSTVAL_UART_IIR                                            (0X1) 
#define RSTVAL_UART_LCR                                            (0X0) 
#define RSTVAL_UART_MCR                                            (0X0) 
#define RSTVAL_UART_LSR                                            (0X60) 
#define RSTVAL_UART_SCR                                            (0X0) 
#define RSTVAL_UART_FCR                                            (0X0) 
#define RSTVAL_UART_FBR                                            (0X0) 
#define RSTVAL_UART_DIV                                            (0X0) 
#define RSTVAL_UART_LCR2                                           (0X2) 
#define RSTVAL_UART_CTL                                            (0X100) 
#define RSTVAL_UART_RFC                                            (0X0) 
#define RSTVAL_UART_TFC                                            (0X0) 
#define RSTVAL_UART_RSC                                            (0X0) 
#define RSTVAL_UART_ACR                                            (0X0) 
#define RSTVAL_UART_ASRL                                           (0X0) 
#define RSTVAL_UART_ASRH                                           (0X0) 

/* ====================================================================================================
        UART Module Register BitPositions, Lengths, Masks and Enumerations Definitions
   ==================================================================================================== */

/* ----------------------------------------------------------------------------------------------------
          RX                                                    Value             Description
   ---------------------------------------------------------------------------------------------------- */
#define BITP_UART_RX_RBR                                      (0U)           /* Receive Buffer Register */
#define BITL_UART_RX_RBR                                      (8U)           /* Receive Buffer Register */
#define BITM_UART_RX_RBR                                      (0X00FFU)      /* Receive Buffer Register */

/* ----------------------------------------------------------------------------------------------------
          IEN                                                   Value             Description
   ---------------------------------------------------------------------------------------------------- */
#define BITP_UART_IEN_ERBFI                                   (0U)           /* Receive Buffer Full Interrupt */
#define BITL_UART_IEN_ERBFI                                   (1U)           /* Receive Buffer Full Interrupt */
#define BITM_UART_IEN_ERBFI                                   (0X0001U)      /* Receive Buffer Full Interrupt */
#define BITP_UART_IEN_ETBEI                                   (1U)           /* Transmit Buffer Empty Interrupt */
#define BITL_UART_IEN_ETBEI                                   (1U)           /* Transmit Buffer Empty Interrupt */
#define BITM_UART_IEN_ETBEI                                   (0X0002U)      /* Transmit Buffer Empty Interrupt */
#define BITP_UART_IEN_ELSI                                    (2U)           /* Rx Status Interrupt */
#define BITL_UART_IEN_ELSI                                    (1U)           /* Rx Status Interrupt */
#define BITM_UART_IEN_ELSI                                    (0X0004U)      /* Rx Status Interrupt */
#define BITP_UART_IEN_EDSSI                                   (3U)           /* Modem Status Interrupt */
#define BITL_UART_IEN_EDSSI                                   (1U)           /* Modem Status Interrupt */
#define BITM_UART_IEN_EDSSI                                   (0X0008U)      /* Modem Status Interrupt */
#define BITP_UART_IEN_EDMAT                                   (4U)           /* DMA Requests in Transmit Mode */
#define BITL_UART_IEN_EDMAT                                   (1U)           /* DMA Requests in Transmit Mode */
#define BITM_UART_IEN_EDMAT                                   (0X0010U)      /* DMA Requests in Transmit Mode */
#define BITP_UART_IEN_EDMAR                                   (5U)           /* DMA Requests in Receive Mode */
#define BITL_UART_IEN_EDMAR                                   (1U)           /* DMA Requests in Receive Mode */
#define BITM_UART_IEN_EDMAR                                   (0X0020U)      /* DMA Requests in Receive Mode */

#define ENUM_UART_IEN_EDMAR_DIS                               (0X0000U)      /* DMA Requests Disabled */
#define ENUM_UART_IEN_EDMAR_EN                                (0X0001U)      /* DMA Requests Enabled */
#define ENUM_UART_IEN_EDMAT_DIS                               (0X0000U)      /* DMA Requests are Disabled */
#define ENUM_UART_IEN_EDMAT_EN                                (0X0001U)      /* DMA Requests are Enabled */
#define ENUM_UART_IEN_EDSSI_DIS                               (0X0000U)      /* Interrupt Disabled */
#define ENUM_UART_IEN_EDSSI_EN                                (0X0001U)      /* Interrupt Enabled */
#define ENUM_UART_IEN_ELSI_DIS                                (0X0000U)      /* Interrupt Disabled */
#define ENUM_UART_IEN_ELSI_EN                                 (0X0001U)      /* Interrupt Enabled */
#define ENUM_UART_IEN_ETBEI_DIS                               (0X0000U)      /* Interrupt Disabled */
#define ENUM_UART_IEN_ETBEI_EN                                (0X0001U)      /* Interrupt Enabled */
#define ENUM_UART_IEN_ERBFI_DIS                               (0X0000U)      /* Interrupt Disabled */
#define ENUM_UART_IEN_ERBFI_EN                                (0X0001U)      /* Interrupt Enabled */

