ChibiOS/ChibiOS/os/common/ext/ADI/ADUCM41x/ADuCM410.h
/* ----------------------------------------------------------------------------------------------------
          IIR                                                   Value             Description
   ---------------------------------------------------------------------------------------------------- */
#define BITP_UART_IIR_NIRQ                                    (0U)           /* Interrupt Flag */
#define BITL_UART_IIR_NIRQ                                    (1U)           /* Interrupt Flag */
#define BITM_UART_IIR_NIRQ                                    (0X0001U)      /* Interrupt Flag */
#define BITP_UART_IIR_STAT                                    (1U)           /* Interrupt Status */
#define BITL_UART_IIR_STAT                                    (3U)           /* Interrupt Status */
#define BITM_UART_IIR_STAT                                    (0X000EU)      /* Interrupt Status */
#define BITP_UART_IIR_FEND                                    (6U)           /* FIFO Enabled */
#define BITL_UART_IIR_FEND                                    (2U)           /* FIFO Enabled */
#define BITM_UART_IIR_FEND                                    (0X00C0U)      /* FIFO Enabled */

#define ENUM_UART_IIR_FEND_DIS                                (0X0000U)      /* FIFO Not Enabled, 16450 Mode */
#define ENUM_UART_IIR_FEND_EN                                 (0X0003U)      /* FIFO Enabled, 16550 Mode */
#define ENUM_UART_IIR_STAT_MODEMINT                           (0X0000U)      /* Modem Status Interrupt (Read MSR Register to Clear) */
#define ENUM_UART_IIR_STAT_TXEMPTYINT                         (0X0001U)      /* Transmit Buffer Empty Interrupt (Write to Tx Register or Read IIR Register to Clear) */
#define ENUM_UART_IIR_STAT_RXFULLINT                          (0X0002U)      /* Receive Buffer Full Interrupt (Read Rx Register to Clear) */
#define ENUM_UART_IIR_STAT_RXTIMEOUTINT                       (0X0006U)      /* Receive FIFO Time-out Interrupt (Read Rx Register to Clear) */
#define ENUM_UART_IIR_STAT_RXLINEINT                          (0X0003U)      /* Receive Line Status Interrupt (Read LSR Register to Clear) */

/* ----------------------------------------------------------------------------------------------------
          LCR                                                   Value             Description
   ---------------------------------------------------------------------------------------------------- */
#define BITP_UART_LCR_WLS                                     (0U)           /* Word Length Select */
#define BITL_UART_LCR_WLS                                     (2U)           /* Word Length Select */
#define BITM_UART_LCR_WLS                                     (0X0003U)      /* Word Length Select */
#define BITP_UART_LCR_STOPPED                                 (2U)           /* Stop Bit */
#define BITL_UART_LCR_STOPPED                                 (1U)           /* Stop Bit */
#define BITM_UART_LCR_STOPPED                                 (0X0004U)      /* Stop Bit */
#define BITP_UART_LCR_PEN                                     (3U)           /* Parity Enable */
#define BITL_UART_LCR_PEN                                     (1U)           /* Parity Enable */
#define BITM_UART_LCR_PEN                                     (0X0008U)      /* Parity Enable */
#define BITP_UART_LCR_EPS                                     (4U)           /* Parity Select */
#define BITL_UART_LCR_EPS                                     (1U)           /* Parity Select */
#define BITM_UART_LCR_EPS                                     (0X0010U)      /* Parity Select */
#define BITP_UART_LCR_SP                                      (5U)           /* Stick Parity */
#define BITL_UART_LCR_SP                                      (1U)           /* Stick Parity */
#define BITM_UART_LCR_SP                                      (0X0020U)      /* Stick Parity */
#define BITP_UART_LCR_BRK                                     (6U)           /* Set Break */
#define BITL_UART_LCR_BRK                                     (1U)           /* Set Break */
#define BITM_UART_LCR_BRK                                     (0X0040U)      /* Set Break */

#define ENUM_UART_LCR_SP_STICK                                (0X0000U)      /* Parity Will Not Be Forced Based on Parity Select and Parity Enable Bits. */
#define ENUM_UART_LCR_SP_EPSPEN                               (0X0001U)      /* Parity Forced Based on Parity Select and Parity Enable Bits. */
#define ENUM_UART_LCR_EPS_ODD                                 (0X0000U)      /* Odd Parity Will Be Transmitted and Checked. */
#define ENUM_UART_LCR_EPS_EVEN                                (0X0001U)      /* Even Parity Will Be Transmitted and Checked. */
#define ENUM_UART_LCR_PEN_DIS                                 (0X0000U)      /* Parity Will Not Be Transmitted or Checked. */
#define ENUM_UART_LCR_PEN_EN                                  (0X0001U)      /* Parity Will Be Transmitted and Checked. */
#define ENUM_UART_LCR_STOPPED_ONTBIT                          (0X0000U)      /* Send 1 Stop Bit Regardless of the Word Length Select Bit */
#define ENUM_UART_LCR_STOPPED_MULTIBIT                        (0X0001U)      /* Send a Number of Stop Bits Based on the Word Length as Follows: WLS = 00, 1.5 Stop Bits Transmitted (5-bit Word Length) WLS = 01 or 10 or 11, 2 Stop Bits Transmitted (6 or 7 or 8-bit Word Length) */
#define ENUM_UART_LCR_WLS_BITS5                               (0X0000U)      /* 5 Bits */
#define ENUM_UART_LCR_WLS_BITS6                               (0X0001U)      /* 6 Bits */
#define ENUM_UART_LCR_WLS_BITS7                               (0X0002U)      /* 7 Bits */
#define ENUM_UART_LCR_WLS_BITS8                               (0X0003U)      /* 8 Bits */

/* ----------------------------------------------------------------------------------------------------
          MCR                                                   Value             Description
   ---------------------------------------------------------------------------------------------------- */
#define BITP_UART_MCR_DTR                                     (0U)           /* Data Terminal Ready */
#define BITL_UART_MCR_DTR                                     (1U)           /* Data Terminal Ready */
#define BITM_UART_MCR_DTR                                     (0X0001U)      /* Data Terminal Ready */
#define BITP_UART_MCR_RTS                                     (1U)           /* Request to Send */
#define BITL_UART_MCR_RTS                                     (1U)           /* Request to Send */
#define BITM_UART_MCR_RTS                                     (0X0002U)      /* Request to Send */
#define BITP_UART_MCR_OUT1                                    (2U)           /* Output 1 */
#define BITL_UART_MCR_OUT1                                    (1U)           /* Output 1 */
#define BITM_UART_MCR_OUT1                                    (0X0004U)      /* Output 1 */
#define BITP_UART_MCR_OUT2                                    (3U)           /* Output 2 */
#define BITL_UART_MCR_OUT2                                    (1U)           /* Output 2 */
#define BITM_UART_MCR_OUT2                                    (0X0008U)      /* Output 2 */
#define BITP_UART_MCR_LOOPBACK                                (4U)           /* Loop Back Mode */
#define BITL_UART_MCR_LOOPBACK                                (1U)           /* Loop Back Mode */
#define BITM_UART_MCR_LOOPBACK                                (0X0010U)      /* Loop Back Mode */

#define ENUM_UART_MCR_LOOPBACK_DIS                            (0X0000U)      /* Normal Operation - Loopback Disabled */
#define ENUM_UART_MCR_LOOPBACK_EN                             (0X0001U)      /* Loopback Enabled */
#define ENUM_UART_MCR_OUT2_FORCE1                             (0X0000U)      /* Force NOUT2 to a Logic 1 */
#define ENUM_UART_MCR_OUT2_FORCE0                             (0X0001U)      /* Force NOUT2 to a Logic 0 */
#define ENUM_UART_MCR_OUT1_FORCE1                             (0X0000U)      /* Force NOUT1 to a Logic 1 */
#define ENUM_UART_MCR_OUT1_FORCE0                             (0X0001U)      /* Force NOUT1 to a Logic 0 */
#define ENUM_UART_MCR_RTS_FORCE1                              (0X0000U)      /* Force NRTS to a Logic 1 */
#define ENUM_UART_MCR_RTS_FORCE0                              (0X0001U)      /* Force NRTS to a Logic 0 */
#define ENUM_UART_MCR_DTR_FORCE1                              (0X0000U)      /* Force NDTR to a Logic 1 */
#define ENUM_UART_MCR_DTR_FORCE0                              (0X0001U)      /* Force NDTR to a Logic 0 */

