ChibiOS/ChibiOS/os/common/ext/ADI/ADUCM41x/ADuCM410.h
/* ----------------------------------------------------------------------------------------------------
          SCR                                                   Value             Description
   ---------------------------------------------------------------------------------------------------- */
#define BITP_UART_SCR_SCR                                     (0U)           /* Scratch */
#define BITL_UART_SCR_SCR                                     (8U)           /* Scratch */
#define BITM_UART_SCR_SCR                                     (0X00FFU)      /* Scratch */

/* ----------------------------------------------------------------------------------------------------
          FCR                                                   Value             Description
   ---------------------------------------------------------------------------------------------------- */
#define BITP_UART_FCR_FIFOEN                                  (0U)           /* FIFO Enable as to Work in 16550 Mode */
#define BITL_UART_FCR_FIFOEN                                  (1U)           /* FIFO Enable as to Work in 16550 Mode */
#define BITM_UART_FCR_FIFOEN                                  (0X0001U)      /* FIFO Enable as to Work in 16550 Mode */
#define BITP_UART_FCR_RFCLR                                   (1U)           /* Clear RX FIFO */
#define BITL_UART_FCR_RFCLR                                   (1U)           /* Clear RX FIFO */
#define BITM_UART_FCR_RFCLR                                   (0X0002U)      /* Clear RX FIFO */
#define BITP_UART_FCR_TFCLR                                   (2U)           /* Clear TX FIFO */
#define BITL_UART_FCR_TFCLR                                   (1U)           /* Clear TX FIFO */
#define BITM_UART_FCR_TFCLR                                   (0X0004U)      /* Clear TX FIFO */
#define BITP_UART_FCR_FDMAMD                                  (3U)           /* FIFO DMA Mode */
#define BITL_UART_FCR_FDMAMD                                  (1U)           /* FIFO DMA Mode */
#define BITM_UART_FCR_FDMAMD                                  (0X0008U)      /* FIFO DMA Mode */
#define BITP_UART_FCR_RFTRIG                                  (6U)           /* RX FIFO Trig Level */
#define BITL_UART_FCR_RFTRIG                                  (2U)           /* RX FIFO Trig Level */
#define BITM_UART_FCR_RFTRIG                                  (0X00C0U)      /* RX FIFO Trig Level */

#define ENUM_UART_FCR_RFTRIG_BYTE1                            (0X0000U)      /* 1 Byte to Trig RX Interrupt */
#define ENUM_UART_FCR_RFTRIG_BYTE4                            (0X0001U)      /* 4 Byte to Trig RX Interrupt */
#define ENUM_UART_FCR_RFTRIG_BYTE8                            (0X0002U)      /* 8 Byte to Trig RX Interrupt */
#define ENUM_UART_FCR_RFTRIG_BYTE14                           (0X0003U)      /* 14 Byte to Trig RX Interrupt */
#define ENUM_UART_FCR_FDMAMD_MODE0                            (0X0000U)      /* In DMA Mode 0, RX DMA Request Will Be Asserted Whenever There's Data in RBR or RX FIFO and De-assert Whenever RBR or RX FIFO is Empty; TX DMA Request Will Be Asserted Whenever THR or TX FIFO is Empty and De-assert Whenever Data Written To. */
#define ENUM_UART_FCR_FDMAMD_MODE1                            (0X0001U)      /* In DMA Mode 1, RX DMA Request Will Be Asserted Whenever RX FIFO Trig Level or Time Out Reached and De-assert Thereafter When RX FIFO is Empty; TX DMA Request Will Be Asserted Whenever TX FIFO is Empty and De-assert Thereafter When TX FIFO is Completely Filled up Full. */

/* ----------------------------------------------------------------------------------------------------
          FBR                                                   Value             Description
   ---------------------------------------------------------------------------------------------------- */
#define BITP_UART_FBR_DIVN                                    (0U)           /* Fractional Baud Rate N Divide Bits 0 to 2047 */
#define BITL_UART_FBR_DIVN                                    (11U)          /* Fractional Baud Rate N Divide Bits 0 to 2047 */
#define BITM_UART_FBR_DIVN                                    (0X07FFU)      /* Fractional Baud Rate N Divide Bits 0 to 2047 */
#define BITP_UART_FBR_DIVM                                    (11U)          /* Fractional Baud Rate M Divide Bits 1 to 3 */
#define BITL_UART_FBR_DIVM                                    (2U)           /* Fractional Baud Rate M Divide Bits 1 to 3 */
#define BITM_UART_FBR_DIVM                                    (0X1800U)      /* Fractional Baud Rate M Divide Bits 1 to 3 */
#define BITP_UART_FBR_FBEN                                    (15U)          /* Fractional Baud Rate Generator Enable */
#define BITL_UART_FBR_FBEN                                    (1U)           /* Fractional Baud Rate Generator Enable */
#define BITM_UART_FBR_FBEN                                    (0X8000U)      /* Fractional Baud Rate Generator Enable */

/* ----------------------------------------------------------------------------------------------------
          DIV                                                   Value             Description
   ---------------------------------------------------------------------------------------------------- */
#define BITP_UART_DIV_DIV                                     (0U)           /* Baud Rate Divider */
#define BITL_UART_DIV_DIV                                     (16U)          /* Baud Rate Divider */
#define BITM_UART_DIV_DIV                                     (0XFFFFU)      /* Baud Rate Divider */

/* ----------------------------------------------------------------------------------------------------
          LCR2                                                  Value             Description
   ---------------------------------------------------------------------------------------------------- */
#define BITP_UART_LCR2_OSR                                    (0U)           /* Over Sample Rate */
#define BITL_UART_LCR2_OSR                                    (2U)           /* Over Sample Rate */
#define BITM_UART_LCR2_OSR                                    (0X0003U)      /* Over Sample Rate */

#define ENUM_UART_LCR2_OSR_OSR4                               (0X0000U)      /* Over Sample by 4 */
#define ENUM_UART_LCR2_OSR_OSR8                               (0X0001U)      /* Over Sample by 8 */
#define ENUM_UART_LCR2_OSR_OSR16                              (0X0002U)      /* Over Sample by 16 */
#define ENUM_UART_LCR2_OSR_OSR32                              (0X0003U)      /* Over Sample by 32 */

