ChibiOS/ChibiOS/os/common/ext/ADI/ADUCM41x/ADuCM410.h
/* ----------------------------------------------------------------------------------------------------
          ASRL                                                  Value             Description
   ---------------------------------------------------------------------------------------------------- */
#define BITP_UART_ASRL_DONE                                   (0U)           /* Auto Baud Done Successfully */
#define BITL_UART_ASRL_DONE                                   (1U)           /* Auto Baud Done Successfully */
#define BITM_UART_ASRL_DONE                                   (0X0001U)      /* Auto Baud Done Successfully */
#define BITP_UART_ASRL_BRKTO                                  (1U)           /* Timed Out Due to Long Time Break Condition */
#define BITL_UART_ASRL_BRKTO                                  (1U)           /* Timed Out Due to Long Time Break Condition */
#define BITM_UART_ASRL_BRKTO                                  (0X0002U)      /* Timed Out Due to Long Time Break Condition */
#define BITP_UART_ASRL_NSETO                                  (2U)           /* Timed Out Due to No Valid Start Edge Found */
#define BITL_UART_ASRL_NSETO                                  (1U)           /* Timed Out Due to No Valid Start Edge Found */
#define BITM_UART_ASRL_NSETO                                  (0X0004U)      /* Timed Out Due to No Valid Start Edge Found */
#define BITP_UART_ASRL_NEETO                                  (3U)           /* Timed Out Due to No Valid Ending Edge Found */
#define BITL_UART_ASRL_NEETO                                  (1U)           /* Timed Out Due to No Valid Ending Edge Found */
#define BITM_UART_ASRL_NEETO                                  (0X0008U)      /* Timed Out Due to No Valid Ending Edge Found */
#define BITP_UART_ASRL_CNT                                    (4U)           /* Auto Baud Counter Value */
#define BITL_UART_ASRL_CNT                                    (12U)          /* Auto Baud Counter Value */
#define BITM_UART_ASRL_CNT                                    (0XFFF0U)      /* Auto Baud Counter Value */

/* ----------------------------------------------------------------------------------------------------
          ASRH                                                  Value             Description
   ---------------------------------------------------------------------------------------------------- */
#define BITP_UART_ASRH_CNT                                    (0U)           /* Auto Baud Counter Value */
#define BITL_UART_ASRH_CNT                                    (8U)           /* Auto Baud Counter Value */
#define BITM_UART_ASRH_CNT                                    (0X00FFU)      /* Auto Baud Counter Value */

#endif  /* end ifndef UART_ADDR_RDEF_H_ */


#ifndef I2C_ADDR_RDEF_H_
#define I2C_ADDR_RDEF_H_    /* I2C: I2C Master/Slave */

/* ====================================================================================================
        I2C Module Instances Address and Mask Definitions
   ==================================================================================================== */
#define INST_I2C0                                                (0X40020800U)    /* i2c0: */
#define INST_I2C1                                                (0X40020C00U)    /* i2c1: */
#define INST_I2C2                                                (0X40021000U)    /* i2c2: */

#define MASK_I2C                                                 (0X0000007FU)    /* I2C: I2C Master/Slave */

/* ====================================================================================================
        I2C Module Register Address Offset Definitions
   ==================================================================================================== */
#define IDX_I2C_MCTL                                            (0X00U)    /* Master Control */
#define IDX_I2C_MSTAT                                           (0X04U)    /* Master Status */
#define IDX_I2C_MRX                                             (0X08U)    /* Master Receive Data */
#define IDX_I2C_MTX                                             (0X0CU)    /* Master Transmit Data */
#define IDX_I2C_MRXCNT                                          (0X10U)    /* Master Receive Data Count */
#define IDX_I2C_MCRXCNT                                         (0X14U)    /* Master Current Receive Data Count */
#define IDX_I2C_ADDR0                                           (0X18U)    /* 1st Master Address Byte */
#define IDX_I2C_ADDR1                                           (0X1CU)    /* 2nd Master Address Byte */
#define IDX_I2C_BYT                                             (0X20U)    /* Start Byte */
#define IDX_I2C_DIV                                             (0X24U)    /* Serial Clock Period Divisor */
#define IDX_I2C_SCTL                                            (0X28U)    /* Slave Control */
#define IDX_I2C_SSTAT                                           (0X2CU)    /* Slave I2C Status/Error/IRQ */
#define IDX_I2C_SRX                                             (0X30U)    /* Slave Receive */
#define IDX_I2C_STX                                             (0X34U)    /* Slave Transmit */
#define IDX_I2C_ALT                                             (0X38U)    /* Hardware General Call ID */
#define IDX_I2C_ID0                                             (0X3CU)    /* 1st Slave Address Device ID */
#define IDX_I2C_ID1                                             (0X40U)    /* 2nd Slave Address Device ID */
#define IDX_I2C_ID2                                             (0X44U)    /* 3rd Slave Address Device ID */
#define IDX_I2C_ID3                                             (0X48U)    /* 4th Slave Address Device ID */
#define IDX_I2C_STAT                                            (0X4CU)    /* Master and Slave FIFO Status */
#define IDX_I2C_SHCTL                                           (0X50U)    /* Shared Control */
#define IDX_I2C_TCTL                                            (0X54U)    /* Timing Control Register */
#define IDX_I2C_ASTRETCH_SCL                                    (0X58U)    /* Automatic Stretch SCL Register */
#define IDX_I2C_IDFSTA                                          (0X5CU)    /* ID FIFO Status Register */
#define IDX_I2C_SLV_ADDR1                                       (0X60U)    /* Slave 10 Bits Address 1st Byte. */
#define IDX_I2C_SLV_ADDR2                                       (0X64U)    /* Slave 10 Bits Address 2nd Byte. */
#define IDX_I2C_SSTAT2                                          (0X68U)    /* Slave I2C Status/IRQ 2 */

