ChibiOS/ChibiOS/os/common/ext/ADI/ADUCM41x/ADuCM410.h
/* ----------------------------------------------------------------------------------------------------
          MSTAT                                                 Value             Description
   ---------------------------------------------------------------------------------------------------- */
#define BITP_I2C_MSTAT_MTXFSTA                                (0U)           /* Master Transmit FIFO Status */
#define BITL_I2C_MSTAT_MTXFSTA                                (2U)           /* Master Transmit FIFO Status */
#define BITM_I2C_MSTAT_MTXFSTA                                (0X0003U)      /* Master Transmit FIFO Status */
#define BITP_I2C_MSTAT_MTXREQ                                 (2U)           /* Master Transmit Interrupt Bit */
#define BITL_I2C_MSTAT_MTXREQ                                 (1U)           /* Master Transmit Interrupt Bit */
#define BITM_I2C_MSTAT_MTXREQ                                 (0X0004U)      /* Master Transmit Interrupt Bit */
#define BITP_I2C_MSTAT_MRXREQ                                 (3U)           /* Master Receive Request */
#define BITL_I2C_MSTAT_MRXREQ                                 (1U)           /* Master Receive Request */
#define BITM_I2C_MSTAT_MRXREQ                                 (0X0008U)      /* Master Receive Request */
#define BITP_I2C_MSTAT_NACKADDR                               (4U)           /* ACK Not Received in Response to an Address */
#define BITL_I2C_MSTAT_NACKADDR                               (1U)           /* ACK Not Received in Response to an Address */
#define BITM_I2C_MSTAT_NACKADDR                               (0X0010U)      /* ACK Not Received in Response to an Address */
#define BITP_I2C_MSTAT_ALOST                                  (5U)           /* Arbitration Lost */
#define BITL_I2C_MSTAT_ALOST                                  (1U)           /* Arbitration Lost */
#define BITM_I2C_MSTAT_ALOST                                  (0X0020U)      /* Arbitration Lost */
#define BITP_I2C_MSTAT_MBUSY                                  (6U)           /* Master Busy */
#define BITL_I2C_MSTAT_MBUSY                                  (1U)           /* Master Busy */
#define BITM_I2C_MSTAT_MBUSY                                  (0X0040U)      /* Master Busy */
#define BITP_I2C_MSTAT_NACKDATA                               (7U)           /* ACK Not Received in Response to Data Write */
#define BITL_I2C_MSTAT_NACKDATA                               (1U)           /* ACK Not Received in Response to Data Write */
#define BITM_I2C_MSTAT_NACKDATA                               (0X0080U)      /* ACK Not Received in Response to Data Write */
#define BITP_I2C_MSTAT_TCOMP                                  (8U)           /* Transaction Complete or Stop Detected */
#define BITL_I2C_MSTAT_TCOMP                                  (1U)           /* Transaction Complete or Stop Detected */
#define BITM_I2C_MSTAT_TCOMP                                  (0X0100U)      /* Transaction Complete or Stop Detected */
#define BITP_I2C_MSTAT_MRXOF                                  (9U)           /* Master Receive FIFO Overflow */
#define BITL_I2C_MSTAT_MRXOF                                  (1U)           /* Master Receive FIFO Overflow */
#define BITM_I2C_MSTAT_MRXOF                                  (0X0200U)      /* Master Receive FIFO Overflow */
#define BITP_I2C_MSTAT_LINEBUSY                               (10U)          /* Line is Busy */
#define BITL_I2C_MSTAT_LINEBUSY                               (1U)           /* Line is Busy */
#define BITM_I2C_MSTAT_LINEBUSY                               (0X0400U)      /* Line is Busy */
#define BITP_I2C_MSTAT_MSTOP                                  (11U)          /* STOP Driven by This I2C Master */
#define BITL_I2C_MSTAT_MSTOP                                  (1U)           /* STOP Driven by This I2C Master */
#define BITM_I2C_MSTAT_MSTOP                                  (0X0800U)      /* STOP Driven by This I2C Master */
#define BITP_I2C_MSTAT_MTXUFLOW                               (12U)          /* Master Transmit Underflow */
#define BITL_I2C_MSTAT_MTXUFLOW                               (1U)           /* Master Transmit Underflow */
#define BITM_I2C_MSTAT_MTXUFLOW                               (0X1000U)      /* Master Transmit Underflow */
#define BITP_I2C_MSTAT_SDA_FILTERED                           (13U)          /* State of SDA Line */
#define BITL_I2C_MSTAT_SDA_FILTERED                           (1U)           /* State of SDA Line */
#define BITM_I2C_MSTAT_SDA_FILTERED                           (0X2000U)      /* State of SDA Line */
#define BITP_I2C_MSTAT_SCL_FILTERED                           (14U)          /* State of SCL Line */
#define BITL_I2C_MSTAT_SCL_FILTERED                           (1U)           /* State of SCL Line */
#define BITM_I2C_MSTAT_SCL_FILTERED                           (0X4000U)      /* State of SCL Line */
#define BITP_I2C_MSTAT_MSTR_HS_MODE                           (15U)          /* Master High Speed Mode Flag */
#define BITL_I2C_MSTAT_MSTR_HS_MODE                           (1U)           /* Master High Speed Mode Flag */
#define BITM_I2C_MSTAT_MSTR_HS_MODE                           (0X8000U)      /* Master High Speed Mode Flag */

/* ----------------------------------------------------------------------------------------------------
          MRX                                                   Value             Description
   ---------------------------------------------------------------------------------------------------- */
#define BITP_I2C_MRX_ICMRX                                    (0U)           /* Master Receive Register */
#define BITL_I2C_MRX_ICMRX                                    (8U)           /* Master Receive Register */
#define BITM_I2C_MRX_ICMRX                                    (0X00FFU)      /* Master Receive Register */

/* ----------------------------------------------------------------------------------------------------
          MTX                                                   Value             Description
   ---------------------------------------------------------------------------------------------------- */
#define BITP_I2C_MTX_I2CMRX                                   (0U)           /* Master Transmit Register */
#define BITL_I2C_MTX_I2CMRX                                   (8U)           /* Master Transmit Register */
#define BITM_I2C_MTX_I2CMRX                                   (0X00FFU)      /* Master Transmit Register */

