ChibiOS/ChibiOS/os/common/ext/ADI/ADUCM41x/ADuCM410.h
/* ----------------------------------------------------------------------------------------------------
          MRXCNT                                                Value             Description
   ---------------------------------------------------------------------------------------------------- */
#define BITP_I2C_MRXCNT_COUNT                                 (0U)           /* Receive Count */
#define BITL_I2C_MRXCNT_COUNT                                 (8U)           /* Receive Count */
#define BITM_I2C_MRXCNT_COUNT                                 (0X00FFU)      /* Receive Count */
#define BITP_I2C_MRXCNT_EXTEND                                (8U)           /* Extended Read */
#define BITL_I2C_MRXCNT_EXTEND                                (1U)           /* Extended Read */
#define BITM_I2C_MRXCNT_EXTEND                                (0X0100U)      /* Extended Read */

/* ----------------------------------------------------------------------------------------------------
          MCRXCNT                                               Value             Description
   ---------------------------------------------------------------------------------------------------- */
#define BITP_I2C_MCRXCNT_COUNT                                (0U)           /* Current Receive Count */
#define BITL_I2C_MCRXCNT_COUNT                                (8U)           /* Current Receive Count */
#define BITM_I2C_MCRXCNT_COUNT                                (0X00FFU)      /* Current Receive Count */

/* ----------------------------------------------------------------------------------------------------
          ADDR0                                                 Value             Description
   ---------------------------------------------------------------------------------------------------- */
#define BITP_I2C_ADDR0_ADR1                                   (0U)           /* Address Byte 1 */
#define BITL_I2C_ADDR0_ADR1                                   (8U)           /* Address Byte 1 */
#define BITM_I2C_ADDR0_ADR1                                   (0X00FFU)      /* Address Byte 1 */

/* ----------------------------------------------------------------------------------------------------
          ADDR1                                                 Value             Description
   ---------------------------------------------------------------------------------------------------- */
#define BITP_I2C_ADDR1_ADR2                                   (0U)           /* Address Byte 2 */
#define BITL_I2C_ADDR1_ADR2                                   (8U)           /* Address Byte 2 */
#define BITM_I2C_ADDR1_ADR2                                   (0X00FFU)      /* Address Byte 2 */

/* ----------------------------------------------------------------------------------------------------
          BYT                                                   Value             Description
   ---------------------------------------------------------------------------------------------------- */
#define BITP_I2C_BYT_SBYTE                                    (0U)           /* Start Byte */
#define BITL_I2C_BYT_SBYTE                                    (8U)           /* Start Byte */
#define BITM_I2C_BYT_SBYTE                                    (0X00FFU)      /* Start Byte */

/* ----------------------------------------------------------------------------------------------------
          DIV                                                   Value             Description
   ---------------------------------------------------------------------------------------------------- */
#define BITP_I2C_DIV_LOW                                      (0U)           /* Serial Clock Low Time */
#define BITL_I2C_DIV_LOW                                      (8U)           /* Serial Clock Low Time */
#define BITM_I2C_DIV_LOW                                      (0X00FFU)      /* Serial Clock Low Time */
#define BITP_I2C_DIV_HIGH                                     (8U)           /* Serial Clock High Time */
#define BITL_I2C_DIV_HIGH                                     (8U)           /* Serial Clock High Time */
#define BITM_I2C_DIV_HIGH                                     (0XFF00U)      /* Serial Clock High Time */

/* ----------------------------------------------------------------------------------------------------
          SCTL                                                  Value             Description
   ---------------------------------------------------------------------------------------------------- */
#define BITP_I2C_SCTL_SLVEN                                   (0U)           /* Slave Enable */
#define BITL_I2C_SCTL_SLVEN                                   (1U)           /* Slave Enable */
#define BITM_I2C_SCTL_SLVEN                                   (0X0001U)      /* Slave Enable */
#define BITP_I2C_SCTL_ADR10EN                                 (1U)           /* Enabled 10-bit Addressing */
#define BITL_I2C_SCTL_ADR10EN                                 (1U)           /* Enabled 10-bit Addressing */
#define BITM_I2C_SCTL_ADR10EN                                 (0X0002U)      /* Enabled 10-bit Addressing */
#define BITP_I2C_SCTL_GCEN                                    (2U)           /* General Call Enable */
#define BITL_I2C_SCTL_GCEN                                    (1U)           /* General Call Enable */
#define BITM_I2C_SCTL_GCEN                                    (0X0004U)      /* General Call Enable */
#define BITP_I2C_SCTL_HGCEN                                   (3U)           /* Hardware General Call Enable */
#define BITL_I2C_SCTL_HGCEN                                   (1U)           /* Hardware General Call Enable */
#define BITM_I2C_SCTL_HGCEN                                   (0X0008U)      /* Hardware General Call Enable */
#define BITP_I2C_SCTL_GCSBCLR                                 (4U)           /* General Call Status Bit Clear */
#define BITL_I2C_SCTL_GCSBCLR                                 (1U)           /* General Call Status Bit Clear */
#define BITM_I2C_SCTL_GCSBCLR                                 (0X0010U)      /* General Call Status Bit Clear */
#define BITP_I2C_SCTL_EARLYTXR                                (5U)           /* Early Transmit Request Mode */
#define BITL_I2C_SCTL_EARLYTXR                                (1U)           /* Early Transmit Request Mode */
#define BITM_I2C_SCTL_EARLYTXR                                (0X0020U)      /* Early Transmit Request Mode */
#define BITP_I2C_SCTL_NACK                                    (7U)           /* NACK Next Communication */
#define BITL_I2C_SCTL_NACK                                    (1U)           /* NACK Next Communication */
#define BITM_I2C_SCTL_NACK                                    (0X0080U)      /* NACK Next Communication */
#define BITP_I2C_SCTL_IENSTOP                                 (8U)           /* Stop Condition Detected Interrupt Enable */
#define BITL_I2C_SCTL_IENSTOP                                 (1U)           /* Stop Condition Detected Interrupt Enable */
#define BITM_I2C_SCTL_IENSTOP                                 (0X0100U)      /* Stop Condition Detected Interrupt Enable */
#define BITP_I2C_SCTL_IENSRX                                  (9U)           /* Slave Receive Request Interrupt Enable */
#define BITL_I2C_SCTL_IENSRX                                  (1U)           /* Slave Receive Request Interrupt Enable */
#define BITM_I2C_SCTL_IENSRX                                  (0X0200U)      /* Slave Receive Request Interrupt Enable */
#define BITP_I2C_SCTL_IENSTX                                  (10U)          /* Slave Transmit Request Interrupt Enable */
#define BITL_I2C_SCTL_IENSTX                                  (1U)           /* Slave Transmit Request Interrupt Enable */
#define BITM_I2C_SCTL_IENSTX                                  (0X0400U)      /* Slave Transmit Request Interrupt Enable */
#define BITP_I2C_SCTL_SXMITDEC                                (11U)          /* Decrement Slave Tx FIFO Status When Transmitted a Byte */
#define BITL_I2C_SCTL_SXMITDEC                                (1U)           /* Decrement Slave Tx FIFO Status When Transmitted a Byte */
#define BITM_I2C_SCTL_SXMITDEC                                (0X0800U)      /* Decrement Slave Tx FIFO Status When Transmitted a Byte */
#define BITP_I2C_SCTL_IENREPST                                (12U)          /* Repeated Start Interrupt Enable */
#define BITL_I2C_SCTL_IENREPST                                (1U)           /* Repeated Start Interrupt Enable */
#define BITM_I2C_SCTL_IENREPST                                (0X1000U)      /* Repeated Start Interrupt Enable */
#define BITP_I2C_SCTL_SRXDMA                                  (13U)          /* Enable Slave Rx DMA Request */
#define BITL_I2C_SCTL_SRXDMA                                  (1U)           /* Enable Slave Rx DMA Request */
#define BITM_I2C_SCTL_SRXDMA                                  (0X2000U)      /* Enable Slave Rx DMA Request */
#define BITP_I2C_SCTL_STXDMA                                  (14U)          /* Enable Slave Tx DMA Request */
#define BITL_I2C_SCTL_STXDMA                                  (1U)           /* Enable Slave Tx DMA Request */
#define BITM_I2C_SCTL_STXDMA                                  (0X4000U)      /* Enable Slave Tx DMA Request */
#define BITP_I2C_SCTL_ID_FIFO_EN                              (15U)          /* ID FIFO Enable */
#define BITL_I2C_SCTL_ID_FIFO_EN                              (1U)           /* ID FIFO Enable */
#define BITM_I2C_SCTL_ID_FIFO_EN                              (0X8000U)      /* ID FIFO Enable */

