ChibiOS/ChibiOS/os/common/ext/ADI/ADUCM41x/ADuCM410.h
/* ----------------------------------------------------------------------------------------------------
          SSTAT                                                 Value             Description
   ---------------------------------------------------------------------------------------------------- */
#define BITP_I2C_SSTAT_STXFSEREQ                              (0U)           /* Slave Tx FIFO Status or Early Request */
#define BITL_I2C_SSTAT_STXFSEREQ                              (1U)           /* Slave Tx FIFO Status or Early Request */
#define BITM_I2C_SSTAT_STXFSEREQ                              (0X0001U)      /* Slave Tx FIFO Status or Early Request */
#define BITP_I2C_SSTAT_STXUR                                  (1U)           /* Slave Transmit FIFO Underflow */
#define BITL_I2C_SSTAT_STXUR                                  (1U)           /* Slave Transmit FIFO Underflow */
#define BITM_I2C_SSTAT_STXUR                                  (0X0002U)      /* Slave Transmit FIFO Underflow */
#define BITP_I2C_SSTAT_STXREQ                                 (2U)           /* Slave Transmit Interrupt Bit */
#define BITL_I2C_SSTAT_STXREQ                                 (1U)           /* Slave Transmit Interrupt Bit */
#define BITM_I2C_SSTAT_STXREQ                                 (0X0004U)      /* Slave Transmit Interrupt Bit */
#define BITP_I2C_SSTAT_SRXREQ                                 (3U)           /* Slave Receive Request */
#define BITL_I2C_SSTAT_SRXREQ                                 (1U)           /* Slave Receive Request */
#define BITM_I2C_SSTAT_SRXREQ                                 (0X0008U)      /* Slave Receive Request */
#define BITP_I2C_SSTAT_SRXOF                                  (4U)           /* Slave Receive FIFO Overflow */
#define BITL_I2C_SSTAT_SRXOF                                  (1U)           /* Slave Receive FIFO Overflow */
#define BITM_I2C_SSTAT_SRXOF                                  (0X0010U)      /* Slave Receive FIFO Overflow */
#define BITP_I2C_SSTAT_NOACK                                  (5U)           /* Ack Not Generated by the Slave */
#define BITL_I2C_SSTAT_NOACK                                  (1U)           /* Ack Not Generated by the Slave */
#define BITM_I2C_SSTAT_NOACK                                  (0X0020U)      /* Ack Not Generated by the Slave */
#define BITP_I2C_SSTAT_SBUSY                                  (6U)           /* Slave Busy */
#define BITL_I2C_SSTAT_SBUSY                                  (1U)           /* Slave Busy */
#define BITM_I2C_SSTAT_SBUSY                                  (0X0040U)      /* Slave Busy */
#define BITP_I2C_SSTAT_GCINT                                  (7U)           /* General Call Interrupt */
#define BITL_I2C_SSTAT_GCINT                                  (1U)           /* General Call Interrupt */
#define BITM_I2C_SSTAT_GCINT                                  (0X0080U)      /* General Call Interrupt */
#define BITP_I2C_SSTAT_GCID                                   (8U)           /* General ID */
#define BITL_I2C_SSTAT_GCID                                   (2U)           /* General ID */
#define BITM_I2C_SSTAT_GCID                                   (0X0300U)      /* General ID */
#define BITP_I2C_SSTAT_STOP                                   (10U)          /* Stop After Start and Matching Address */
#define BITL_I2C_SSTAT_STOP                                   (1U)           /* Stop After Start and Matching Address */
#define BITM_I2C_SSTAT_STOP                                   (0X0400U)      /* Stop After Start and Matching Address */
#define BITP_I2C_SSTAT_IDMAT                                  (11U)          /* Device ID Matched */
#define BITL_I2C_SSTAT_IDMAT                                  (2U)           /* Device ID Matched */
#define BITM_I2C_SSTAT_IDMAT                                  (0X1800U)      /* Device ID Matched */
#define BITP_I2C_SSTAT_REPSTART                               (13U)          /* Repeated Start and Matching Address */
#define BITL_I2C_SSTAT_REPSTART                               (1U)           /* Repeated Start and Matching Address */
#define BITM_I2C_SSTAT_REPSTART                               (0X2000U)      /* Repeated Start and Matching Address */
#define BITP_I2C_SSTAT_START                                  (14U)          /* Start and Matching Address */
#define BITL_I2C_SSTAT_START                                  (1U)           /* Start and Matching Address */
#define BITM_I2C_SSTAT_START                                  (0X4000U)      /* Start and Matching Address */
#define BITP_I2C_SSTAT_SLV_HS_MODE                            (15U)          /* Slave High Speed Mode Flag */
#define BITL_I2C_SSTAT_SLV_HS_MODE                            (1U)           /* Slave High Speed Mode Flag */
#define BITM_I2C_SSTAT_SLV_HS_MODE                            (0X8000U)      /* Slave High Speed Mode Flag */

#define ENUM_I2C_SSTAT_IDMAT_ID0                              (0X0000U)      /* Received Address Matched ID Register 0 */
#define ENUM_I2C_SSTAT_IDMAT_ID1                              (0X0001U)      /* Received Address Matched ID Register 1 */
#define ENUM_I2C_SSTAT_IDMAT_ID2                              (0X0002U)      /* Received Address Matched ID Register 2 */
#define ENUM_I2C_SSTAT_IDMAT_ID3                              (0X0003U)      /* Received Address Matched ID Register 3 */
#define ENUM_I2C_SSTAT_GCID_NONE                              (0X0000U)      /* No general call */
#define ENUM_I2C_SSTAT_GCID_RESETPROGADDR                     (0X0001U)      /* General call Reset and Program Address */
#define ENUM_I2C_SSTAT_GCID_PROGADDR                          (0X0002U)      /* General Call Program Address */
#define ENUM_I2C_SSTAT_GCID_MATCHID                           (0X0003U)      /* General Call Matching Alternative ID */

/* ----------------------------------------------------------------------------------------------------
          SRX                                                   Value             Description
   ---------------------------------------------------------------------------------------------------- */
#define BITP_I2C_SRX_I2CSRX                                   (0U)           /* Slave Receive Register */
#define BITL_I2C_SRX_I2CSRX                                   (8U)           /* Slave Receive Register */
#define BITM_I2C_SRX_I2CSRX                                   (0X00FFU)      /* Slave Receive Register */

