ChibiOS/ChibiOS/os/common/ext/ADI/ADUCM41x/ADuCM410.h
/* ----------------------------------------------------------------------------------------------------
          SHCTL                                                 Value             Description
   ---------------------------------------------------------------------------------------------------- */
#define BITP_I2C_SHCTL_RESET                                  (0U)           /* Reset START STOP Detect Circuit */
#define BITL_I2C_SHCTL_RESET                                  (1U)           /* Reset START STOP Detect Circuit */
#define BITM_I2C_SHCTL_RESET                                  (0X0001U)      /* Reset START STOP Detect Circuit */
#define BITP_I2C_SHCTL_ADR_BUSY                               (6U)           /* ADR Busy Flag */
#define BITL_I2C_SHCTL_ADR_BUSY                               (1U)           /* ADR Busy Flag */
#define BITM_I2C_SHCTL_ADR_BUSY                               (0X0040U)      /* ADR Busy Flag */
#define BITP_I2C_SHCTL_SDA_DLY                                (8U)           /* Delay Between SDAOUT and SDAOEN */
#define BITL_I2C_SHCTL_SDA_DLY                                (4U)           /* Delay Between SDAOUT and SDAOEN */
#define BITM_I2C_SHCTL_SDA_DLY                                (0X0F00U)      /* Delay Between SDAOUT and SDAOEN */
#define BITP_I2C_SHCTL_SCL_DLY                                (12U)          /* Delay Between SCLOUT and SCLOEN */
#define BITL_I2C_SHCTL_SCL_DLY                                (4U)           /* Delay Between SCLOUT and SCLOEN */
#define BITM_I2C_SHCTL_SCL_DLY                                (0XF000U)      /* Delay Between SCLOUT and SCLOEN */

/* ----------------------------------------------------------------------------------------------------
          TCTL                                                  Value             Description
   ---------------------------------------------------------------------------------------------------- */
#define BITP_I2C_TCTL_THDATIN                                 (0U)           /* Data in Hold Start */
#define BITL_I2C_TCTL_THDATIN                                 (6U)           /* Data in Hold Start */
#define BITM_I2C_TCTL_THDATIN                                 (0X003FU)      /* Data in Hold Start */
#define BITP_I2C_TCTL_FILTEROFF                               (8U)           /* Input Filter Control */
#define BITL_I2C_TCTL_FILTEROFF                               (1U)           /* Input Filter Control */
#define BITM_I2C_TCTL_FILTEROFF                               (0X0100U)      /* Input Filter Control */
#define BITP_I2C_TCTL_PRE_DIV                                 (9U)           /* Presale Divide Counter for SCK DIV */
#define BITL_I2C_TCTL_PRE_DIV                                 (3U)           /* Presale Divide Counter for SCK DIV */
#define BITM_I2C_TCTL_PRE_DIV                                 (0X0E00U)      /* Presale Divide Counter for SCK DIV */
#define BITP_I2C_TCTL_FILTER_TICKS                            (12U)          /* SCK & SDA Gglitch Filter Ticks. */
#define BITL_I2C_TCTL_FILTER_TICKS                            (4U)           /* SCK & SDA Gglitch Filter Ticks. */
#define BITM_I2C_TCTL_FILTER_TICKS                            (0XF000U)      /* SCK & SDA Gglitch Filter Ticks. */

/* ----------------------------------------------------------------------------------------------------
          ASTRETCH_SCL                                          Value             Description
   ---------------------------------------------------------------------------------------------------- */
#define BITP_I2C_ASTRETCH_SCL_STRETCH_MODE_MAS                (0U)           /* Master Automatic Stretch Mode */
#define BITL_I2C_ASTRETCH_SCL_STRETCH_MODE_MAS                (4U)           /* Master Automatic Stretch Mode */
#define BITM_I2C_ASTRETCH_SCL_STRETCH_MODE_MAS                (0X000FU)      /* Master Automatic Stretch Mode */
#define BITP_I2C_ASTRETCH_SCL_STRECTH_MODE_SLV                (4U)           /* Slave Automatic Stretch Mode */
#define BITL_I2C_ASTRETCH_SCL_STRECTH_MODE_SLV                (4U)           /* Slave Automatic Stretch Mode */
#define BITM_I2C_ASTRETCH_SCL_STRECTH_MODE_SLV                (0X00F0U)      /* Slave Automatic Stretch Mode */
#define BITP_I2C_ASTRETCH_SCL_TIMEOUT_SSCL_MAS                (8U)           /* Master Automatic Stretch Timeout */
#define BITL_I2C_ASTRETCH_SCL_TIMEOUT_SSCL_MAS                (1U)           /* Master Automatic Stretch Timeout */
#define BITM_I2C_ASTRETCH_SCL_TIMEOUT_SSCL_MAS                (0X0100U)      /* Master Automatic Stretch Timeout */
#define BITP_I2C_ASTRETCH_SCL_TIMEOUT_SSCL_SLV                (9U)           /* Slave Automatic Stretch Timeout */
#define BITL_I2C_ASTRETCH_SCL_TIMEOUT_SSCL_SLV                (1U)           /* Slave Automatic Stretch Timeout */
#define BITM_I2C_ASTRETCH_SCL_TIMEOUT_SSCL_SLV                (0X0200U)      /* Slave Automatic Stretch Timeout */
#define BITP_I2C_ASTRETCH_SCL_MAN_RLS_EN                      (10U)          /* Manual Release Stretch Enable */
#define BITL_I2C_ASTRETCH_SCL_MAN_RLS_EN                      (1U)           /* Manual Release Stretch Enable */
#define BITM_I2C_ASTRETCH_SCL_MAN_RLS_EN                      (0X0400U)      /* Manual Release Stretch Enable */
#define BITP_I2C_ASTRETCH_SCL_SSCL_AFTER_ACK                  (11U)          /* Slave RX Stretch After ACK Mode */
#define BITL_I2C_ASTRETCH_SCL_SSCL_AFTER_ACK                  (1U)           /* Slave RX Stretch After ACK Mode */
#define BITM_I2C_ASTRETCH_SCL_SSCL_AFTER_ACK                  (0X0800U)      /* Slave RX Stretch After ACK Mode */
#define BITP_I2C_ASTRETCH_SCL_SSCL_RLS                        (12U)          /* Slave Manual Clear Stretch */
#define BITL_I2C_ASTRETCH_SCL_SSCL_RLS                        (1U)           /* Slave Manual Clear Stretch */
#define BITM_I2C_ASTRETCH_SCL_SSCL_RLS                        (0X1000U)      /* Slave Manual Clear Stretch */
#define BITP_I2C_ASTRETCH_SCL_ADDR_ACK_IEN                    (13U)          /* Slave ADDRESS ACK Interruption Enable */
#define BITL_I2C_ASTRETCH_SCL_ADDR_ACK_IEN                    (1U)           /* Slave ADDRESS ACK Interruption Enable */
#define BITM_I2C_ASTRETCH_SCL_ADDR_ACK_IEN                    (0X2000U)      /* Slave ADDRESS ACK Interruption Enable */
#define BITP_I2C_ASTRETCH_SCL_SSCL_IRQ_IEN                    (14U)          /* Slave Stretch Interruption Enable */
#define BITL_I2C_ASTRETCH_SCL_SSCL_IRQ_IEN                    (1U)           /* Slave Stretch Interruption Enable */
#define BITM_I2C_ASTRETCH_SCL_SSCL_IRQ_IEN                    (0X4000U)      /* Slave Stretch Interruption Enable */
#define BITP_I2C_ASTRETCH_SCL_CLR_ADDR_ACK_IRQ                (15U)          /* Write Clear the Address ACK IRQ. */
#define BITL_I2C_ASTRETCH_SCL_CLR_ADDR_ACK_IRQ                (1U)           /* Write Clear the Address ACK IRQ. */
#define BITM_I2C_ASTRETCH_SCL_CLR_ADDR_ACK_IRQ                (0X8000U)      /* Write Clear the Address ACK IRQ. */

