ChibiOS/ChibiOS/os/common/ext/ADI/ADUCM41x/ADuCM410.h
/* ----------------------------------------------------------------------------------------------------
          IDFSTA                                                Value             Description
   ---------------------------------------------------------------------------------------------------- */
#define BITP_I2C_IDFSTA_STX0FSTA                              (0U)           /* Slave Transmit ID0 FIFO Status */
#define BITL_I2C_IDFSTA_STX0FSTA                              (2U)           /* Slave Transmit ID0 FIFO Status */
#define BITM_I2C_IDFSTA_STX0FSTA                              (0X0003U)      /* Slave Transmit ID0 FIFO Status */
#define BITP_I2C_IDFSTA_STX1FSTA                              (2U)           /* Slave Transmit ID1 FIFO Status */
#define BITL_I2C_IDFSTA_STX1FSTA                              (2U)           /* Slave Transmit ID1 FIFO Status */
#define BITM_I2C_IDFSTA_STX1FSTA                              (0X000CU)      /* Slave Transmit ID1 FIFO Status */
#define BITP_I2C_IDFSTA_STX2FSTA                              (4U)           /* Slave Transmit ID2 FIFO Status */
#define BITL_I2C_IDFSTA_STX2FSTA                              (2U)           /* Slave Transmit ID2 FIFO Status */
#define BITM_I2C_IDFSTA_STX2FSTA                              (0X0030U)      /* Slave Transmit ID2 FIFO Status */
#define BITP_I2C_IDFSTA_STX3FSTA                              (6U)           /* Slave Transmit ID3 FIFO Status */
#define BITL_I2C_IDFSTA_STX3FSTA                              (2U)           /* Slave Transmit ID3 FIFO Status */
#define BITM_I2C_IDFSTA_STX3FSTA                              (0X00C0U)      /* Slave Transmit ID3 FIFO Status */
#define BITP_I2C_IDFSTA_SFLUSH0                               (8U)           /* Flush the Slave Transmit ID0 FIFO */
#define BITL_I2C_IDFSTA_SFLUSH0                               (1U)           /* Flush the Slave Transmit ID0 FIFO */
#define BITM_I2C_IDFSTA_SFLUSH0                               (0X0100U)      /* Flush the Slave Transmit ID0 FIFO */
#define BITP_I2C_IDFSTA_SFLUSH1                               (9U)           /* Flush the Slave Transmit ID1 FIFO */
#define BITL_I2C_IDFSTA_SFLUSH1                               (1U)           /* Flush the Slave Transmit ID1 FIFO */
#define BITM_I2C_IDFSTA_SFLUSH1                               (0X0200U)      /* Flush the Slave Transmit ID1 FIFO */
#define BITP_I2C_IDFSTA_SFLUSH2                               (10U)          /* Flush the Slave Transmit ID2 FIFO */
#define BITL_I2C_IDFSTA_SFLUSH2                               (1U)           /* Flush the Slave Transmit ID2 FIFO */
#define BITM_I2C_IDFSTA_SFLUSH2                               (0X0400U)      /* Flush the Slave Transmit ID2 FIFO */
#define BITP_I2C_IDFSTA_SFLUSH3                               (11U)          /* Flush the Slave Transmit ID3 FIFO */
#define BITL_I2C_IDFSTA_SFLUSH3                               (1U)           /* Flush the Slave Transmit ID3 FIFO */
#define BITM_I2C_IDFSTA_SFLUSH3                               (0X0800U)      /* Flush the Slave Transmit ID3 FIFO */
#define BITP_I2C_IDFSTA_STX0UR                                (12U)          /* Slave Transmit ID0 FIFO Underflow */
#define BITL_I2C_IDFSTA_STX0UR                                (1U)           /* Slave Transmit ID0 FIFO Underflow */
#define BITM_I2C_IDFSTA_STX0UR                                (0X1000U)      /* Slave Transmit ID0 FIFO Underflow */
#define BITP_I2C_IDFSTA_STX1UR                                (13U)          /* Slave Transmit ID1 FIFO Underflow */
#define BITL_I2C_IDFSTA_STX1UR                                (1U)           /* Slave Transmit ID1 FIFO Underflow */
#define BITM_I2C_IDFSTA_STX1UR                                (0X2000U)      /* Slave Transmit ID1 FIFO Underflow */
#define BITP_I2C_IDFSTA_STX2UR                                (14U)          /* Slave Transmit ID2 FIFO Underflow */
#define BITL_I2C_IDFSTA_STX2UR                                (1U)           /* Slave Transmit ID2 FIFO Underflow */
#define BITM_I2C_IDFSTA_STX2UR                                (0X4000U)      /* Slave Transmit ID2 FIFO Underflow */
#define BITP_I2C_IDFSTA_STX3UR                                (15U)          /* Slave Transmit ID3 FIFO Underflow */
#define BITL_I2C_IDFSTA_STX3UR                                (1U)           /* Slave Transmit ID3 FIFO Underflow */
#define BITM_I2C_IDFSTA_STX3UR                                (0X8000U)      /* Slave Transmit ID3 FIFO Underflow */

#define ENUM_I2C_IDFSTA_STX3FSTA_EMPTY                        (0X0000U)      /* FIFO Empty */
#define ENUM_I2C_IDFSTA_STX3FSTA_ONE                          (0X0001U)      /* 1 Bytes in the FIFO */
#define ENUM_I2C_IDFSTA_STX3FSTA_TWO                          (0X0002U)      /* 2 Bytes in the FIFO */
#define ENUM_I2C_IDFSTA_STX3FSTA_RESERVED                     (0X0003U)      /* Reserved */
#define ENUM_I2C_IDFSTA_STX2FSTA_EMPTY                        (0X0000U)      /* FIFO Empty */
#define ENUM_I2C_IDFSTA_STX2FSTA_ONE                          (0X0001U)      /* 1 Bytes in the FIFO */
#define ENUM_I2C_IDFSTA_STX2FSTA_TWO                          (0X0002U)      /* 2 Bytes in the FIFO */
#define ENUM_I2C_IDFSTA_STX2FSTA_RESERVED                     (0X0003U)      /* Reserved */
#define ENUM_I2C_IDFSTA_STX1FSTA_EMPTY                        (0X0000U)      /* FIFO Empty */
#define ENUM_I2C_IDFSTA_STX1FSTA_ONE                          (0X0001U)      /* 1 Bytes in the FIFO */
#define ENUM_I2C_IDFSTA_STX1FSTA_TWO                          (0X0002U)      /* 2 Bytes in the FIFO */
#define ENUM_I2C_IDFSTA_STX1FSTA_RESERVED                     (0X0003U)      /* Reserved */
#define ENUM_I2C_IDFSTA_STX0FSTA_EMPTY                        (0X0000U)      /* FIFO Empty */
#define ENUM_I2C_IDFSTA_STX0FSTA_ONE                          (0X0001U)      /* 1 Bytes in the FIFO */
#define ENUM_I2C_IDFSTA_STX0FSTA_TWO                          (0X0002U)      /* 2 Bytes in the FIFO */
#define ENUM_I2C_IDFSTA_STX0FSTA_RESERVED                     (0X0003U)      /* Reserved */

