ChibiOS/ChibiOS/os/common/ext/ADI/ADUCM41x/ADuCM410.h
/* ----------------------------------------------------------------------------------------------------
          SLV_ADDR1                                             Value             Description
   ---------------------------------------------------------------------------------------------------- */
#define BITP_I2C_SLV_ADDR1_SLV_ADR1                           (0U)           /* Slave 10 Bits Address 1st Byte */
#define BITL_I2C_SLV_ADDR1_SLV_ADR1                           (8U)           /* Slave 10 Bits Address 1st Byte */
#define BITM_I2C_SLV_ADDR1_SLV_ADR1                           (0X00FFU)      /* Slave 10 Bits Address 1st Byte */

/* ----------------------------------------------------------------------------------------------------
          SLV_ADDR2                                             Value             Description
   ---------------------------------------------------------------------------------------------------- */
#define BITP_I2C_SLV_ADDR2_SLV_ADR2                           (0U)           /* Slave 10 Bit Address 2nd Byte */
#define BITL_I2C_SLV_ADDR2_SLV_ADR2                           (8U)           /* Slave 10 Bit Address 2nd Byte */
#define BITM_I2C_SLV_ADDR2_SLV_ADR2                           (0X00FFU)      /* Slave 10 Bit Address 2nd Byte */

/* ----------------------------------------------------------------------------------------------------
          SSTAT2                                                Value             Description
   ---------------------------------------------------------------------------------------------------- */
#define BITP_I2C_SSTAT2_SSCL_IRQ                              (0U)           /* Stretch Interruption State. */
#define BITL_I2C_SSTAT2_SSCL_IRQ                              (1U)           /* Stretch Interruption State. */
#define BITM_I2C_SSTAT2_SSCL_IRQ                              (0X0001U)      /* Stretch Interruption State. */
#define BITP_I2C_SSTAT2_ADDR_ACK_IRQ                          (1U)           /* Slave ADDR ACK Interruption State. */
#define BITL_I2C_SSTAT2_ADDR_ACK_IRQ                          (1U)           /* Slave ADDR ACK Interruption State. */
#define BITM_I2C_SSTAT2_ADDR_ACK_IRQ                          (0X0002U)      /* Slave ADDR ACK Interruption State. */
#define BITP_I2C_SSTAT2_RW_DIRECTION                          (2U)           /* Slave I2C RW Direction. */
#define BITL_I2C_SSTAT2_RW_DIRECTION                          (1U)           /* Slave I2C RW Direction. */
#define BITM_I2C_SSTAT2_RW_DIRECTION                          (0X0004U)      /* Slave I2C RW Direction. */

#endif  /* end ifndef I2C_ADDR_RDEF_H_ */


#ifndef MDIO_ADDR_RDEF_H_
#define MDIO_ADDR_RDEF_H_    /* MDIO: MDIO Interface */

/* ====================================================================================================
        MDIO Module Instances Address and Mask Definitions
   ==================================================================================================== */
#define INST_MDIO                                                (0X40022000U)    /* mdio: */

#define MASK_MDIO                                                (0XFFFFFFFFU)    /* MDIO: MDIO Interface */

/* ====================================================================================================
        MDIO Module Register Address Offset Definitions
   ==================================================================================================== */
#define IDX_MDIO_MDCON                                          (0X00000000U)    /* MDIO Block Control */
#define IDX_MDIO_MDFRM                                          (0X00000004U)    /* MDIO Received Frame Control Information */
#define IDX_MDIO_MDRXD                                          (0X00000008U)    /* MDIO Received Data */
#define IDX_MDIO_MDADR                                          (0X0000000CU)    /* MDIO Received Address */
#define IDX_MDIO_MDTXD                                          (0X00000010U)    /* MDIO Data for Transmission */
#define IDX_MDIO_MDPHY                                          (0X00000014U)    /* MDIO PHYADDR Software Values and Selection and DEVADD */
#define IDX_MDIO_MDSTA                                          (0X00000018U)    /* MDIO Progress Signaling Through Frame */
#define IDX_MDIO_MDIEN                                          (0X0000001CU)    /* MDIO Interrupt Enables */
#define IDX_MDIO_MDPIN                                          (0X00000020U)    /* MDIO Read PHYADDR Pins */
#define IDX_MDIO_DMAEN                                          (0X00000028U)    /* MDIO DMA Enable */
#define IDX_MDIO_MDTESTCON                                      (0X0000002CU)    /* MDIO Test Controller Protected by Test Key */

/* ====================================================================================================
        MDIO Module Register ResetValue Definitions
   ==================================================================================================== */
#define RSTVAL_MDIO_MDCON                                          (0X0) 
#define RSTVAL_MDIO_MDFRM                                          (0X0) 
#define RSTVAL_MDIO_MDTXD                                          (0X0) 
#define RSTVAL_MDIO_MDPHY                                          (0X400) 
#define RSTVAL_MDIO_MDSTA                                          (0X0) 
#define RSTVAL_MDIO_MDIEN                                          (0X0) 
#define RSTVAL_MDIO_MDPIN                                          (0X0) 
#define RSTVAL_MDIO_DMAEN                                          (0X0) 
#define RSTVAL_MDIO_MDTESTCON                                      (0X800) 

/* ====================================================================================================
        MDIO Module Register BitPositions, Lengths, Masks and Enumerations Definitions
   ==================================================================================================== */

