ChibiOS/ChibiOS/os/common/ext/ADI/ADUCM41x/ADuCM410.h
/* ----------------------------------------------------------------------------------------------------
          MDCON                                                 Value             Description
   ---------------------------------------------------------------------------------------------------- */
#define BITP_MDIO_MDCON_MD_RST                                (0U)           /* Write 1 to Reset MDIO Block. */
#define BITL_MDIO_MDCON_MD_RST                                (1U)           /* Write 1 to Reset MDIO Block. */
#define BITM_MDIO_MDCON_MD_RST                                (0X0001U)      /* Write 1 to Reset MDIO Block. */
#define BITP_MDIO_MDCON_MD_PHM                                (1U)           /* Enable PHY Address Bit Width */
#define BITL_MDIO_MDCON_MD_PHM                                (1U)           /* Enable PHY Address Bit Width */
#define BITM_MDIO_MDCON_MD_PHM                                (0X0002U)      /* Enable PHY Address Bit Width */
#define BITP_MDIO_MDCON_MD_DRV                                (2U)           /* Enable Open-drain or Push-pull of MDIO Drive */
#define BITL_MDIO_MDCON_MD_DRV                                (1U)           /* Enable Open-drain or Push-pull of MDIO Drive */
#define BITM_MDIO_MDCON_MD_DRV                                (0X0004U)      /* Enable Open-drain or Push-pull of MDIO Drive */
#define BITP_MDIO_MDCON_MD_EN                                 (8U)           /* MD Enable */
#define BITL_MDIO_MDCON_MD_EN                                 (1U)           /* MD Enable */
#define BITM_MDIO_MDCON_MD_EN                                 (0X0100U)      /* MD Enable */

#define ENUM_MDIO_MDCON_MD_DRV_MD_DRV_OD                      (0X0000U)      /* MDIO Drive Open Drain. */
#define ENUM_MDIO_MDCON_MD_DRV_MD_DRV_PP                      (0X0001U)      /* MDIO Drive Push-pull. */
#define ENUM_MDIO_MDCON_MD_PHM_EN_5BIT                        (0X0000U)      /* 5bits PHYADD is active */
#define ENUM_MDIO_MDCON_MD_PHM_EN_3BITS                       (0X0001U)      /* 3bits PHYADD is active, two MSBS are ignored */
#define ENUM_MDIO_MDCON_MD_RST_RSTACTIVE                      (0X0001U)      /* Reset MDIO */
#define ENUM_MDIO_MDCON_MD_RST_RSTINACTIVE                    (0X0000U)      /* Reset MDIO */

/* ----------------------------------------------------------------------------------------------------
          MDFRM                                                 Value             Description
   ---------------------------------------------------------------------------------------------------- */
#define BITP_MDIO_MDFRM_MD_OP                                 (0U)           /* Received OP */
#define BITL_MDIO_MDFRM_MD_OP                                 (2U)           /* Received OP */
#define BITM_MDIO_MDFRM_MD_OP                                 (0X0003U)      /* Received OP */
#define BITP_MDIO_MDFRM_MD_PHY                                (2U)           /* Received PHYADR. */
#define BITL_MDIO_MDFRM_MD_PHY                                (5U)           /* Received PHYADR. */
#define BITM_MDIO_MDFRM_MD_PHY                                (0X007CU)      /* Received PHYADR. */
#define BITP_MDIO_MDFRM_MD_DEV                                (7U)           /* Received DEVADD */
#define BITL_MDIO_MDFRM_MD_DEV                                (5U)           /* Received DEVADD */
#define BITM_MDIO_MDFRM_MD_DEV                                (0X0F80U)      /* Received DEVADD */

#define ENUM_MDIO_MDFRM_MD_OP_MD_OP_ADF                       (0X0000U)      /* Address Frame. */
#define ENUM_MDIO_MDFRM_MD_OP_MD_OP_WRF                       (0X0001U)      /* Write Frame. */
#define ENUM_MDIO_MDFRM_MD_OP_MD_OP_INCF                      (0X0002U)      /* PostReadIncAdd Frame. */
#define ENUM_MDIO_MDFRM_MD_OP_MD_OP_RDF                       (0X0003U)      /* Read Frame. */

/* ----------------------------------------------------------------------------------------------------
          MDRXD                                                 Value             Description
   ---------------------------------------------------------------------------------------------------- */
#define BITP_MDIO_MDRXD_MD_RXD                                (0U)           /* Received Data */
#define BITL_MDIO_MDRXD_MD_RXD                                (16U)          /* Received Data */
#define BITM_MDIO_MDRXD_MD_RXD                                (0XFFFFU)      /* Received Data */

/* ----------------------------------------------------------------------------------------------------
          MDADR                                                 Value             Description
   ---------------------------------------------------------------------------------------------------- */
#define BITP_MDIO_MDADR_MD_ADR                                (0U)           /* Received Address */
#define BITL_MDIO_MDADR_MD_ADR                                (16U)          /* Received Address */
#define BITM_MDIO_MDADR_MD_ADR                                (0XFFFFU)      /* Received Address */

/* ----------------------------------------------------------------------------------------------------
          MDTXD                                                 Value             Description
   ---------------------------------------------------------------------------------------------------- */
#define BITP_MDIO_MDTXD_MD_TXD                                (0U)           /* TX Data */
#define BITL_MDIO_MDTXD_MD_TXD                                (16U)          /* TX Data */
#define BITM_MDIO_MDTXD_MD_TXD                                (0XFFFFU)      /* TX Data */

/* ----------------------------------------------------------------------------------------------------
          MDPHY                                                 Value             Description
   ---------------------------------------------------------------------------------------------------- */
#define BITP_MDIO_MDPHY_MD_PHYSW                              (0U)           /* Software Provided PHYADR */
#define BITL_MDIO_MDPHY_MD_PHYSW                              (5U)           /* Software Provided PHYADR */
#define BITM_MDIO_MDPHY_MD_PHYSW                              (0X001FU)      /* Software Provided PHYADR */
#define BITP_MDIO_MDPHY_MD_PHYSEL                             (5U)           /* Selects Expected PHYADR Bits */
#define BITL_MDIO_MDPHY_MD_PHYSEL                             (5U)           /* Selects Expected PHYADR Bits */
#define BITM_MDIO_MDPHY_MD_PHYSEL                             (0X03E0U)      /* Selects Expected PHYADR Bits */
#define BITP_MDIO_MDPHY_MD_DEVADD                             (10U)          /* Expected DEVADD */
#define BITL_MDIO_MDPHY_MD_DEVADD                             (5U)           /* Expected DEVADD */
#define BITM_MDIO_MDPHY_MD_DEVADD                             (0X7C00U)      /* Expected DEVADD */

