ChibiOS/ChibiOS/os/common/ext/ADI/ADUCM41x/ADuCM410.h
/* ----------------------------------------------------------------------------------------------------
          MDSTA                                                 Value             Description
   ---------------------------------------------------------------------------------------------------- */
#define BITP_MDIO_MDSTA_MD_WRF                                (0U)           /* Write Frame Status */
#define BITL_MDIO_MDSTA_MD_WRF                                (1U)           /* Write Frame Status */
#define BITM_MDIO_MDSTA_MD_WRF                                (0X0001U)      /* Write Frame Status */
#define BITP_MDIO_MDSTA_MD_ADRF                               (1U)           /* Address Frame Status */
#define BITL_MDIO_MDSTA_MD_ADRF                               (1U)           /* Address Frame Status */
#define BITM_MDIO_MDSTA_MD_ADRF                               (0X0002U)      /* Address Frame Status */
#define BITP_MDIO_MDSTA_MD_INCF                               (2U)           /* Post Read Increment Address Frame Status */
#define BITL_MDIO_MDSTA_MD_INCF                               (1U)           /* Post Read Increment Address Frame Status */
#define BITM_MDIO_MDSTA_MD_INCF                               (0X0004U)      /* Post Read Increment Address Frame Status */
#define BITP_MDIO_MDSTA_MD_RDF                                (3U)           /* Read Frame Status */
#define BITL_MDIO_MDSTA_MD_RDF                                (1U)           /* Read Frame Status */
#define BITM_MDIO_MDSTA_MD_RDF                                (0X0008U)      /* Read Frame Status */
#define BITP_MDIO_MDSTA_MD_DEVM                               (4U)           /* Device Address Matching Status */
#define BITL_MDIO_MDSTA_MD_DEVM                               (1U)           /* Device Address Matching Status */
#define BITM_MDIO_MDSTA_MD_DEVM                               (0X0010U)      /* Device Address Matching Status */
#define BITP_MDIO_MDSTA_MD_DEVN                               (5U)           /* Device Address None Match Status */
#define BITL_MDIO_MDSTA_MD_DEVN                               (1U)           /* Device Address None Match Status */
#define BITM_MDIO_MDSTA_MD_DEVN                               (0X0020U)      /* Device Address None Match Status */
#define BITP_MDIO_MDSTA_MD_PHYM                               (6U)           /* PHY Address Matching Status */
#define BITL_MDIO_MDSTA_MD_PHYM                               (1U)           /* PHY Address Matching Status */
#define BITM_MDIO_MDSTA_MD_PHYM                               (0X0040U)      /* PHY Address Matching Status */
#define BITP_MDIO_MDSTA_MD_PHYN                               (7U)           /* PHY Address Non Matching Status */
#define BITL_MDIO_MDSTA_MD_PHYN                               (1U)           /* PHY Address Non Matching Status */
#define BITM_MDIO_MDSTA_MD_PHYN                               (0X0080U)      /* PHY Address Non Matching Status */

/* ----------------------------------------------------------------------------------------------------
          MDIEN                                                 Value             Description
   ---------------------------------------------------------------------------------------------------- */
#define BITP_MDIO_MDIEN_MD_WRFI                               (0U)           /* Interrupt Enable for MD_WRF */
#define BITL_MDIO_MDIEN_MD_WRFI                               (1U)           /* Interrupt Enable for MD_WRF */
#define BITM_MDIO_MDIEN_MD_WRFI                               (0X0001U)      /* Interrupt Enable for MD_WRF */
#define BITP_MDIO_MDIEN_MD_ADRI                               (1U)           /* Interrupt Enable for MD_ADRF */
#define BITL_MDIO_MDIEN_MD_ADRI                               (1U)           /* Interrupt Enable for MD_ADRF */
#define BITM_MDIO_MDIEN_MD_ADRI                               (0X0002U)      /* Interrupt Enable for MD_ADRF */
#define BITP_MDIO_MDIEN_MD_INCFI                              (2U)           /* Interrupt Enable for MD_INCF */
#define BITL_MDIO_MDIEN_MD_INCFI                              (1U)           /* Interrupt Enable for MD_INCF */
#define BITM_MDIO_MDIEN_MD_INCFI                              (0X0004U)      /* Interrupt Enable for MD_INCF */
#define BITP_MDIO_MDIEN_MD_RDFI                               (3U)           /* Interrupt Enable for MD_RDF */
#define BITL_MDIO_MDIEN_MD_RDFI                               (1U)           /* Interrupt Enable for MD_RDF */
#define BITM_MDIO_MDIEN_MD_RDFI                               (0X0008U)      /* Interrupt Enable for MD_RDF */
#define BITP_MDIO_MDIEN_MD_DEVMI                              (4U)           /* Interrupt Enable for MD_DEVM */
#define BITL_MDIO_MDIEN_MD_DEVMI                              (1U)           /* Interrupt Enable for MD_DEVM */
#define BITM_MDIO_MDIEN_MD_DEVMI                              (0X0010U)      /* Interrupt Enable for MD_DEVM */
#define BITP_MDIO_MDIEN_MD_DEVNI                              (5U)           /* Interrupt Enable for MD_DEVN */
#define BITL_MDIO_MDIEN_MD_DEVNI                              (1U)           /* Interrupt Enable for MD_DEVN */
#define BITM_MDIO_MDIEN_MD_DEVNI                              (0X0020U)      /* Interrupt Enable for MD_DEVN */
#define BITP_MDIO_MDIEN_MD_PHYMI                              (6U)           /* Interrupt Enable for MD_PHYM */
#define BITL_MDIO_MDIEN_MD_PHYMI                              (1U)           /* Interrupt Enable for MD_PHYM */
#define BITM_MDIO_MDIEN_MD_PHYMI                              (0X0040U)      /* Interrupt Enable for MD_PHYM */
#define BITP_MDIO_MDIEN_MD_PHYNI                              (7U)           /* Interrupt Enable for MD_PHYN */
#define BITL_MDIO_MDIEN_MD_PHYNI                              (1U)           /* Interrupt Enable for MD_PHYN */
#define BITM_MDIO_MDIEN_MD_PHYNI                              (0X0080U)      /* Interrupt Enable for MD_PHYN */

