ChibiOS/ChibiOS/os/common/ext/ADI/ADUCM41x/ADuCM410.h
/* ----------------------------------------------------------------------------------------------------
          MDPIN                                                 Value             Description
   ---------------------------------------------------------------------------------------------------- */
#define BITP_MDIO_MDPIN_MD_PIN                                (0U)           /* PRTADR Pins */
#define BITL_MDIO_MDPIN_MD_PIN                                (5U)           /* PRTADR Pins */
#define BITM_MDIO_MDPIN_MD_PIN                                (0X001FU)      /* PRTADR Pins */

/* ----------------------------------------------------------------------------------------------------
          DMAEN                                                 Value             Description
   ---------------------------------------------------------------------------------------------------- */
#define BITP_MDIO_DMAEN_RD_DATA                               (0U)           /* Read Data */
#define BITL_MDIO_DMAEN_RD_DATA                               (1U)           /* Read Data */
#define BITM_MDIO_DMAEN_RD_DATA                               (0X0001U)      /* Read Data */
#define BITP_MDIO_DMAEN_INCRD_DATA                            (1U)           /* Increment Read Data */
#define BITL_MDIO_DMAEN_INCRD_DATA                            (1U)           /* Increment Read Data */
#define BITM_MDIO_DMAEN_INCRD_DATA                            (0X0002U)      /* Increment Read Data */
#define BITP_MDIO_DMAEN_WR_ADR                                (2U)           /* Write Address */
#define BITL_MDIO_DMAEN_WR_ADR                                (1U)           /* Write Address */
#define BITM_MDIO_DMAEN_WR_ADR                                (0X0004U)      /* Write Address */
#define BITP_MDIO_DMAEN_WR_DATA                               (3U)           /* Write Data */
#define BITL_MDIO_DMAEN_WR_DATA                               (1U)           /* Write Data */
#define BITM_MDIO_DMAEN_WR_DATA                               (0X0008U)      /* Write Data */

/* ----------------------------------------------------------------------------------------------------
          MDTESTCON                                             Value             Description
   ---------------------------------------------------------------------------------------------------- */
#define BITP_MDIO_MDTESTCON_TA_0_VALUE                        (11U)          /* Output Value During First Bit of OP */
#define BITL_MDIO_MDTESTCON_TA_0_VALUE                        (1U)           /* Output Value During First Bit of OP */
#define BITM_MDIO_MDTESTCON_TA_0_VALUE                        (0X0800U)      /* Output Value During First Bit of OP */
#define BITP_MDIO_MDTESTCON_TA_1_VALUE                        (12U)          /* Output Value During Second Bit of OP */
#define BITL_MDIO_MDTESTCON_TA_1_VALUE                        (1U)           /* Output Value During Second Bit of OP */
#define BITM_MDIO_MDTESTCON_TA_1_VALUE                        (0X1000U)      /* Output Value During Second Bit of OP */
#define BITP_MDIO_MDTESTCON_EN_TA_OUTPUT                      (13U)          /* Enable Output Different During OP Phase */
#define BITL_MDIO_MDTESTCON_EN_TA_OUTPUT                      (1U)           /* Enable Output Different During OP Phase */
#define BITM_MDIO_MDTESTCON_EN_TA_OUTPUT                      (0X2000U)      /* Enable Output Different During OP Phase */

#endif  /* end ifndef MDIO_ADDR_RDEF_H_ */


#ifndef DMA_ADDR_RDEF_H_
#define DMA_ADDR_RDEF_H_    /* DMA: DMA */

/* ====================================================================================================
        DMA Module Instances Address and Mask Definitions
   ==================================================================================================== */
#define INST_DMA                                                 (0X40040000U)    /* dma: */

#define MASK_DMA                                                 (0X00000FFFU)    /* DMA: DMA */

/* ====================================================================================================
        DMA Module Register Address Offset Definitions
   ==================================================================================================== */
#define IDX_DMA_STAT                                            (0X000U)    /* DMA Status */
#define IDX_DMA_CFG                                             (0X004U)    /* DMA Configuration */
#define IDX_DMA_PDBPTR                                          (0X008U)    /* DMA Channel Primary Control Data Base Pointer */
#define IDX_DMA_ADBPTR                                          (0X00CU)    /* DMA Channel Alternate Control Data Base Pointer */
#define IDX_DMA_SWREQ                                           (0X014U)    /* DMA Channel Software Request */
#define IDX_DMA_RMSKSET                                         (0X020U)    /* DMA Channel Request Mask Set */
#define IDX_DMA_RMSKCLR                                         (0X024U)    /* DMA Channel Request Mask Clear */
#define IDX_DMA_ENSET                                           (0X028U)    /* DMA Channel Enable Set */
#define IDX_DMA_ENCLR                                           (0X02CU)    /* DMA Channel Enable Clear */
#define IDX_DMA_ALTSET                                          (0X030U)    /* DMA Channel Primary-alternate Set */
#define IDX_DMA_ALTCLR                                          (0X034U)    /* DMA Channel Primary-alternate Clear */
#define IDX_DMA_PRISET                                          (0X038U)    /* DMA Channel Priority Set */
#define IDX_DMA_PRICLR                                          (0X03CU)    /* DMA Channel Priority Clear */
#define IDX_DMA_ERRCHNLCLR                                      (0X048U)    /* DMA per Channel Error Clear */
#define IDX_DMA_ERRCLR                                          (0X04CU)    /* DMA Bus Error Clear */
#define IDX_DMA_INVALIDDESCCLR                                  (0X050U)    /* DMA per Channel Invalid Descriptor Clear */
#define IDX_DMA_BSSET                                           (0X800U)    /* DMA Channel Bytes Swap Enable Set */
#define IDX_DMA_BSCLR                                           (0X804U)    /* DMA Channel Bytes Swap Enable Clear */
#define IDX_DMA_SRCADDRSET                                      (0X810U)    /* DMA Channel Source Address Decrement Enable Set */
#define IDX_DMA_SRCADDRCLR                                      (0X814U)    /* DMA Channel Source Address Decrement Enable Clear */
#define IDX_DMA_DSTADDRSET                                      (0X818U)    /* DMA Channel Destination Address Decrement Enable Set */
#define IDX_DMA_DSTADDRCLR                                      (0X81CU)    /* DMA Channel Destination Address Decrement Enable Clear */
#define IDX_DMA_REVID                                           (0XFE0U)    /* DMA Controller Revision ID */

