ChibiOS/ChibiOS/os/common/ext/ADI/ADUCM41x/ADuCM410.h
/* ====================================================================================================
        DMA Module Register ResetValue Definitions
   ==================================================================================================== */
#define RSTVAL_DMA_STAT                                            (0X1E0000) 
#define RSTVAL_DMA_CFG                                             (0X0) 
#define RSTVAL_DMA_PDBPTR                                          (0X0) 
#define RSTVAL_DMA_ADBPTR                                          (0X200) 
#define RSTVAL_DMA_SWREQ                                           (0X0) 
#define RSTVAL_DMA_RMSKSET                                         (0X0) 
#define RSTVAL_DMA_RMSKCLR                                         (0X0) 
#define RSTVAL_DMA_ENSET                                           (0X0) 
#define RSTVAL_DMA_ENCLR                                           (0X0) 
#define RSTVAL_DMA_ALTSET                                          (0X0) 
#define RSTVAL_DMA_ALTCLR                                          (0X0) 
#define RSTVAL_DMA_PRISET                                          (0X0) 
#define RSTVAL_DMA_PRICLR                                          (0X0) 
#define RSTVAL_DMA_ERRCHNLCLR                                      (0X0) 
#define RSTVAL_DMA_ERRCLR                                          (0X0) 
#define RSTVAL_DMA_INVALIDDESCCLR                                  (0X0) 
#define RSTVAL_DMA_BSSET                                           (0X0) 
#define RSTVAL_DMA_BSCLR                                           (0X0) 
#define RSTVAL_DMA_SRCADDRSET                                      (0X0) 
#define RSTVAL_DMA_SRCADDRCLR                                      (0X0) 
#define RSTVAL_DMA_DSTADDRSET                                      (0X0) 
#define RSTVAL_DMA_DSTADDRCLR                                      (0X0) 
#define RSTVAL_DMA_REVID                                           (0X2) 

/* ====================================================================================================
        DMA Module Register BitPositions, Lengths, Masks and Enumerations Definitions
   ==================================================================================================== */

/* ----------------------------------------------------------------------------------------------------
          STAT                                                  Value             Description
   ---------------------------------------------------------------------------------------------------- */
#define BITP_DMA_STAT_MEN                                     (0U)           /* Enable Status of the Controller */
#define BITL_DMA_STAT_MEN                                     (1U)           /* Enable Status of the Controller */
#define BITM_DMA_STAT_MEN                                     (0X00000001U)  /* Enable Status of the Controller */
#define BITP_DMA_STAT_CHANM1                                  (16U)          /* Number of Available DMA Channels Minus 1 */
#define BITL_DMA_STAT_CHANM1                                  (5U)           /* Number of Available DMA Channels Minus 1 */
#define BITM_DMA_STAT_CHANM1                                  (0X001F0000U)  /* Number of Available DMA Channels Minus 1 */

/* ----------------------------------------------------------------------------------------------------
          CFG                                                   Value             Description
   ---------------------------------------------------------------------------------------------------- */
#define BITP_DMA_CFG_MEN                                      (0U)           /* Controller Enable */
#define BITL_DMA_CFG_MEN                                      (1U)           /* Controller Enable */
#define BITM_DMA_CFG_MEN                                      (0X00000001U)  /* Controller Enable */

/* ----------------------------------------------------------------------------------------------------
          PDBPTR                                                Value             Description
   ---------------------------------------------------------------------------------------------------- */
#define BITP_DMA_PDBPTR_ADDR                                  (0U)           /* Pointer to the Base Address of the Primary Data Structure */
#define BITL_DMA_PDBPTR_ADDR                                  (32U)          /* Pointer to the Base Address of the Primary Data Structure */
#define BITM_DMA_PDBPTR_ADDR                                  (0XFFFFFFFFU)  /* Pointer to the Base Address of the Primary Data Structure */

/* ----------------------------------------------------------------------------------------------------
          ADBPTR                                                Value             Description
   ---------------------------------------------------------------------------------------------------- */
#define BITP_DMA_ADBPTR_ADDR                                  (0U)           /* Base Address of the Alternate Data Structure */
#define BITL_DMA_ADBPTR_ADDR                                  (32U)          /* Base Address of the Alternate Data Structure */
#define BITM_DMA_ADBPTR_ADDR                                  (0XFFFFFFFFU)  /* Base Address of the Alternate Data Structure */

/* ----------------------------------------------------------------------------------------------------
          SWREQ                                                 Value             Description
   ---------------------------------------------------------------------------------------------------- */
#define BITP_DMA_SWREQ_CHAN                                   (0U)           /* Generate Software Request */
#define BITL_DMA_SWREQ_CHAN                                   (31U)          /* Generate Software Request */
#define BITM_DMA_SWREQ_CHAN                                   (0X7FFFFFFFU)  /* Generate Software Request */

