ChibiOS/ChibiOS/os/common/ext/ADI/ADUCM41x/ADuCM410.h
/* ----------------------------------------------------------------------------------------------------
          RMSKSET                                               Value             Description
   ---------------------------------------------------------------------------------------------------- */
#define BITP_DMA_RMSKSET_CHAN                                 (0U)           /* Mask Requests from DMA Channels */
#define BITL_DMA_RMSKSET_CHAN                                 (31U)          /* Mask Requests from DMA Channels */
#define BITM_DMA_RMSKSET_CHAN                                 (0X7FFFFFFFU)  /* Mask Requests from DMA Channels */

/* ----------------------------------------------------------------------------------------------------
          RMSKCLR                                               Value             Description
   ---------------------------------------------------------------------------------------------------- */
#define BITP_DMA_RMSKCLR_CHAN                                 (0U)           /* Clear REQ_MASK_SET Bits in DMARMSKSET */
#define BITL_DMA_RMSKCLR_CHAN                                 (31U)          /* Clear REQ_MASK_SET Bits in DMARMSKSET */
#define BITM_DMA_RMSKCLR_CHAN                                 (0X7FFFFFFFU)  /* Clear REQ_MASK_SET Bits in DMARMSKSET */

/* ----------------------------------------------------------------------------------------------------
          ENSET                                                 Value             Description
   ---------------------------------------------------------------------------------------------------- */
#define BITP_DMA_ENSET_CHAN                                   (0U)           /* Enable DMA Channels */
#define BITL_DMA_ENSET_CHAN                                   (31U)          /* Enable DMA Channels */
#define BITM_DMA_ENSET_CHAN                                   (0X7FFFFFFFU)  /* Enable DMA Channels */

/* ----------------------------------------------------------------------------------------------------
          ENCLR                                                 Value             Description
   ---------------------------------------------------------------------------------------------------- */
#define BITP_DMA_ENCLR_CHAN                                   (0U)           /* Disable DMA Channels */
#define BITL_DMA_ENCLR_CHAN                                   (31U)          /* Disable DMA Channels */
#define BITM_DMA_ENCLR_CHAN                                   (0X7FFFFFFFU)  /* Disable DMA Channels */

/* ----------------------------------------------------------------------------------------------------
          ALTSET                                                Value             Description
   ---------------------------------------------------------------------------------------------------- */
#define BITP_DMA_ALTSET_CHAN                                  (0U)           /* Control Structure Status / Select Alt Structure */
#define BITL_DMA_ALTSET_CHAN                                  (31U)          /* Control Structure Status / Select Alt Structure */
#define BITM_DMA_ALTSET_CHAN                                  (0X7FFFFFFFU)  /* Control Structure Status / Select Alt Structure */

/* ----------------------------------------------------------------------------------------------------
          ALTCLR                                                Value             Description
   ---------------------------------------------------------------------------------------------------- */
#define BITP_DMA_ALTCLR_CHAN                                  (0U)           /* Select Primary Data Structure */
#define BITL_DMA_ALTCLR_CHAN                                  (31U)          /* Select Primary Data Structure */
#define BITM_DMA_ALTCLR_CHAN                                  (0X7FFFFFFFU)  /* Select Primary Data Structure */

/* ----------------------------------------------------------------------------------------------------
          PRISET                                                Value             Description
   ---------------------------------------------------------------------------------------------------- */
#define BITP_DMA_PRISET_CHAN                                  (0U)           /* Configure Channel for High Priority */
#define BITL_DMA_PRISET_CHAN                                  (31U)          /* Configure Channel for High Priority */
#define BITM_DMA_PRISET_CHAN                                  (0X7FFFFFFFU)  /* Configure Channel for High Priority */

/* ----------------------------------------------------------------------------------------------------
          PRICLR                                                Value             Description
   ---------------------------------------------------------------------------------------------------- */
#define BITP_DMA_PRICLR_CHPRICLR                              (0U)           /* Configure Channel for Default Priority Level */
#define BITL_DMA_PRICLR_CHPRICLR                              (31U)          /* Configure Channel for Default Priority Level */
#define BITM_DMA_PRICLR_CHPRICLR                              (0X7FFFFFFFU)  /* Configure Channel for Default Priority Level */

/* ----------------------------------------------------------------------------------------------------
          ERRCHNLCLR                                            Value             Description
   ---------------------------------------------------------------------------------------------------- */
#define BITP_DMA_ERRCHNLCLR_CHAN                              (0U)           /* Per Channel Bus Error Status/ Clear */
#define BITL_DMA_ERRCHNLCLR_CHAN                              (31U)          /* Per Channel Bus Error Status/ Clear */
#define BITM_DMA_ERRCHNLCLR_CHAN                              (0X7FFFFFFFU)  /* Per Channel Bus Error Status/ Clear */

/* ----------------------------------------------------------------------------------------------------
          ERRCLR                                                Value             Description
   ---------------------------------------------------------------------------------------------------- */
#define BITP_DMA_ERRCLR_CHAN                                  (0U)           /* Bus Error Status */
#define BITL_DMA_ERRCLR_CHAN                                  (31U)          /* Bus Error Status */
#define BITM_DMA_ERRCLR_CHAN                                  (0X7FFFFFFFU)  /* Bus Error Status */

