ChibiOS/ChibiOS/os/common/ext/ADI/ADUCM41x/ADuCM410.h
/* ----------------------------------------------------------------------------------------------------
          INVALIDDESCCLR                                        Value             Description
   ---------------------------------------------------------------------------------------------------- */
#define BITP_DMA_INVALIDDESCCLR_CHAN                          (0U)           /* Per Channel Invalid Descriptor Status */
#define BITL_DMA_INVALIDDESCCLR_CHAN                          (31U)          /* Per Channel Invalid Descriptor Status */
#define BITM_DMA_INVALIDDESCCLR_CHAN                          (0X7FFFFFFFU)  /* Per Channel Invalid Descriptor Status */

/* ----------------------------------------------------------------------------------------------------
          BSSET                                                 Value             Description
   ---------------------------------------------------------------------------------------------------- */
#define BITP_DMA_BSSET_CHAN                                   (0U)           /* Byte Swap Status */
#define BITL_DMA_BSSET_CHAN                                   (31U)          /* Byte Swap Status */
#define BITM_DMA_BSSET_CHAN                                   (0X7FFFFFFFU)  /* Byte Swap Status */

/* ----------------------------------------------------------------------------------------------------
          BSCLR                                                 Value             Description
   ---------------------------------------------------------------------------------------------------- */
#define BITP_DMA_BSCLR_CHAN                                   (0U)           /* Disable Byte Swap */
#define BITL_DMA_BSCLR_CHAN                                   (31U)          /* Disable Byte Swap */
#define BITM_DMA_BSCLR_CHAN                                   (0X7FFFFFFFU)  /* Disable Byte Swap */

/* ----------------------------------------------------------------------------------------------------
          SRCADDRSET                                            Value             Description
   ---------------------------------------------------------------------------------------------------- */
#define BITP_DMA_SRCADDRSET_CHAN                              (0U)           /* Source Address Decrement Status / Configure */
#define BITL_DMA_SRCADDRSET_CHAN                              (31U)          /* Source Address Decrement Status / Configure */
#define BITM_DMA_SRCADDRSET_CHAN                              (0X7FFFFFFFU)  /* Source Address Decrement Status / Configure */

/* ----------------------------------------------------------------------------------------------------
          SRCADDRCLR                                            Value             Description
   ---------------------------------------------------------------------------------------------------- */
#define BITP_DMA_SRCADDRCLR_CHAN                              (0U)           /* Disable Source Address Decrement */
#define BITL_DMA_SRCADDRCLR_CHAN                              (31U)          /* Disable Source Address Decrement */
#define BITM_DMA_SRCADDRCLR_CHAN                              (0X7FFFFFFFU)  /* Disable Source Address Decrement */

/* ----------------------------------------------------------------------------------------------------
          DSTADDRSET                                            Value             Description
   ---------------------------------------------------------------------------------------------------- */
#define BITP_DMA_DSTADDRSET_CHAN                              (0U)           /* Destination Address Decrement Status */
#define BITL_DMA_DSTADDRSET_CHAN                              (31U)          /* Destination Address Decrement Status */
#define BITM_DMA_DSTADDRSET_CHAN                              (0X7FFFFFFFU)  /* Destination Address Decrement Status */

/* ----------------------------------------------------------------------------------------------------
          DSTADDRCLR                                            Value             Description
   ---------------------------------------------------------------------------------------------------- */
#define BITP_DMA_DSTADDRCLR_CHAN                              (0U)           /* Disable Destination Address Decrement */
#define BITL_DMA_DSTADDRCLR_CHAN                              (31U)          /* Disable Destination Address Decrement */
#define BITM_DMA_DSTADDRCLR_CHAN                              (0X7FFFFFFFU)  /* Disable Destination Address Decrement */

/* ----------------------------------------------------------------------------------------------------
          REVID                                                 Value             Description
   ---------------------------------------------------------------------------------------------------- */
#define BITP_DMA_REVID_DMAREVID                               (0U)           /* DMA Controller Revision ID */
#define BITL_DMA_REVID_DMAREVID                               (8U)           /* DMA Controller Revision ID */
#define BITM_DMA_REVID_DMAREVID                               (0X000000FFU)  /* DMA Controller Revision ID */

#endif  /* end ifndef DMA_ADDR_RDEF_H_ */


#ifndef CC_ADDR_RDEF_H_
#define CC_ADDR_RDEF_H_    /* CC: Cache Controller */

/* ====================================================================================================
        CC Module Instances Address and Mask Definitions
   ==================================================================================================== */
#define INST_CACHE                                               (0X40044000U)    /* cache: */

#define MASK_CC                                                  (0X000000FFU)    /* CC: Cache Controller */

/* ====================================================================================================
        CC Module Register Address Offset Definitions
   ==================================================================================================== */
#define IDX_CC_STAT                                             (0X00U)    /* Cache Status Register */
#define IDX_CC_SETUP                                            (0X04U)    /* Cache Setup Register */
#define IDX_CC_KEY                                              (0X08U)    /* Cache Key Register */
#define IDX_CC_PERFSETUP                                        (0X0CU)    /* Cache Performance Monitor Setup Register */
#define IDX_CC_ACCESSCNTR                                       (0X10U)    /* Cache Miss Counter */
#define IDX_CC_MSTRSETUP                                        (0X24U)    /* Cache Master Setup Register */
#define IDX_CC_ECCSTAT                                          (0X34U)    /* Cache SRAM ECC Status Register */
#define IDX_CC_ECCADDR                                          (0X38U)    /* Cache SRAM ECC Address Register */

