ChibiOS/ChibiOS/os/common/ext/ADI/ADUCM41x/ADuCM410.h
/* ====================================================================================================
        CC Module Register ResetValue Definitions
   ==================================================================================================== */
#define RSTVAL_CC_STAT                                             (0X0) 
#define RSTVAL_CC_SETUP                                            (0X0) 
#define RSTVAL_CC_KEY                                              (0X0) 
#define RSTVAL_CC_PERFSETUP                                        (0X0) 
#define RSTVAL_CC_ACCESSCNTR                                       (0X0) 
#define RSTVAL_CC_MSTRSETUP                                        (0X0) 
#define RSTVAL_CC_ECCSTAT                                          (0X0) 
#define RSTVAL_CC_ECCADDR                                          (0X0) 

/* ====================================================================================================
        CC Module Register BitPositions, Lengths, Masks and Enumerations Definitions
   ==================================================================================================== */

/* ----------------------------------------------------------------------------------------------------
          STAT                                                  Value             Description
   ---------------------------------------------------------------------------------------------------- */
#define BITP_CC_STAT_CCEN                                     (0U)           /* Code Cache Enable Status */
#define BITL_CC_STAT_CCEN                                     (1U)           /* Code Cache Enable Status */
#define BITM_CC_STAT_CCEN                                     (0X00000001U)  /* Code Cache Enable Status */
#define BITP_CC_STAT_CCLCK                                    (1U)           /* Code Cache Lock Status */
#define BITL_CC_STAT_CCLCK                                    (1U)           /* Code Cache Lock Status */
#define BITM_CC_STAT_CCLCK                                    (0X00000002U)  /* Code Cache Lock Status */
#define BITP_CC_STAT_CCWIPE                                   (3U)           /* Code Cache Memory Wipe in Progress */
#define BITL_CC_STAT_CCWIPE                                   (1U)           /* Code Cache Memory Wipe in Progress */
#define BITM_CC_STAT_CCWIPE                                   (0X00000008U)  /* Code Cache Memory Wipe in Progress */

/* ----------------------------------------------------------------------------------------------------
          SETUP                                                 Value             Description
   ---------------------------------------------------------------------------------------------------- */
#define BITP_CC_SETUP_CCEN                                    (0U)           /* Code Cache Enable */
#define BITL_CC_SETUP_CCEN                                    (1U)           /* Code Cache Enable */
#define BITM_CC_SETUP_CCEN                                    (0X00000001U)  /* Code Cache Enable */
#define BITP_CC_SETUP_CCFLUSHDIS                              (8U)           /* Disable Automatic Cache and Buffer Flush on Any Flash Update */
#define BITL_CC_SETUP_CCFLUSHDIS                              (1U)           /* Disable Automatic Cache and Buffer Flush on Any Flash Update */
#define BITM_CC_SETUP_CCFLUSHDIS                              (0X00000100U)  /* Disable Automatic Cache and Buffer Flush on Any Flash Update */

/* ----------------------------------------------------------------------------------------------------
          KEY                                                   Value             Description
   ---------------------------------------------------------------------------------------------------- */
#define BITP_CC_KEY_KEY                                       (0U)           /* Cache Key Register */
#define BITL_CC_KEY_KEY                                       (32U)          /* Cache Key Register */
#define BITM_CC_KEY_KEY                                       (0XFFFFFFFFU)  /* Cache Key Register */

/* ----------------------------------------------------------------------------------------------------
          PERFSETUP                                             Value             Description
   ---------------------------------------------------------------------------------------------------- */
#define BITP_CC_PERFSETUP_STOPCNTR                            (0U)           /* Performance Counter Stop */
#define BITL_CC_PERFSETUP_STOPCNTR                            (1U)           /* Performance Counter Stop */
#define BITM_CC_PERFSETUP_STOPCNTR                            (0X00000001U)  /* Performance Counter Stop */
#define BITP_CC_PERFSETUP_STRTCNTR                            (1U)           /* Performance Counter Start */
#define BITL_CC_PERFSETUP_STRTCNTR                            (1U)           /* Performance Counter Start */
#define BITM_CC_PERFSETUP_STRTCNTR                            (0X00000002U)  /* Performance Counter Start */

/* ----------------------------------------------------------------------------------------------------
          ACCESSCNTR                                            Value             Description
   ---------------------------------------------------------------------------------------------------- */
#define BITP_CC_ACCESSCNTR_CNT                                (0U)           /* Cache Internal Performance Counter */
#define BITL_CC_ACCESSCNTR_CNT                                (32U)          /* Cache Internal Performance Counter */
#define BITM_CC_ACCESSCNTR_CNT                                (0XFFFFFFFFU)  /* Cache Internal Performance Counter */

/* ----------------------------------------------------------------------------------------------------
          MSTRSETUP                                             Value             Description
   ---------------------------------------------------------------------------------------------------- */
#define BITP_CC_MSTRSETUP_MSTRNRA                             (0U)           /* No Read Allocate for Master */
#define BITL_CC_MSTRSETUP_MSTRNRA                             (8U)           /* No Read Allocate for Master */
#define BITM_CC_MSTRSETUP_MSTRNRA                             (0X000000FFU)  /* No Read Allocate for Master */

