ChibiOS/ChibiOS/os/common/ext/ADI/ADUCM41x/ADuCM410.h
/* ----------------------------------------------------------------------------------------------------
          ECCSTAT                                               Value             Description
   ---------------------------------------------------------------------------------------------------- */
#define BITP_CC_ECCSTAT_ECCINTSTA                             (0U)           /* Cache SRAM ECC Error Interrupt Status */
#define BITL_CC_ECCSTAT_ECCINTSTA                             (2U)           /* Cache SRAM ECC Error Interrupt Status */
#define BITM_CC_ECCSTAT_ECCINTSTA                             (0X00000003U)  /* Cache SRAM ECC Error Interrupt Status */
#define BITP_CC_ECCSTAT_ECCHRESPSTA                           (2U)           /* Cache SRAM ECC Error Hresp Status */
#define BITL_CC_ECCSTAT_ECCHRESPSTA                           (2U)           /* Cache SRAM ECC Error Hresp Status */
#define BITM_CC_ECCSTAT_ECCHRESPSTA                           (0X0000000CU)  /* Cache SRAM ECC Error Hresp Status */
#define BITP_CC_ECCSTAT_ECCERRORCNT                           (4U)           /* Cache SRAM ECC Error Counter */
#define BITL_CC_ECCSTAT_ECCERRORCNT                           (3U)           /* Cache SRAM ECC Error Counter */
#define BITM_CC_ECCSTAT_ECCERRORCNT                           (0X00000070U)  /* Cache SRAM ECC Error Counter */

#define ENUM_CC_ECCSTAT_ECCHRESPSTA_NOERROR                   (0X00000000U)  /* No Error */
#define ENUM_CC_ECCSTAT_ECCHRESPSTA_ERROR2BIT                 (0X00000001U)  /* 2 Bit Error */
#define ENUM_CC_ECCSTAT_ECCHRESPSTA_ERROR1BIT                 (0X00000002U)  /* 1 Bit Error */
#define ENUM_CC_ECCSTAT_ECCHRESPSTA_RESERVED                  (0X00000003U)  /* Reserved */
#define ENUM_CC_ECCSTAT_ECCINTSTA_NOERROR                     (0X00000000U)  /* No Error */
#define ENUM_CC_ECCSTAT_ECCINTSTA_ERROR2BIT                   (0X00000001U)  /* 2 Bit Error */
#define ENUM_CC_ECCSTAT_ECCINTSTA_ERROR1BIT                   (0X00000002U)  /* 1 Bit Error */
#define ENUM_CC_ECCSTAT_ECCINTSTA_ERROR1OR2BIT                (0X00000003U)  /* Either 1 Bit Error or 2 Bit Error */

/* ----------------------------------------------------------------------------------------------------
          ECCADDR                                               Value             Description
   ---------------------------------------------------------------------------------------------------- */
#define BITP_CC_ECCADDR_ECCADDR                               (0U)           /* Cache SRAM ECC Error Interrupt Address */
#define BITL_CC_ECCADDR_ECCADDR                               (11U)          /* Cache SRAM ECC Error Interrupt Address */
#define BITM_CC_ECCADDR_ECCADDR                               (0X000007FFU)  /* Cache SRAM ECC Error Interrupt Address */

#endif  /* end ifndef CC_ADDR_RDEF_H_ */


#ifndef FLASH_ADDR_RDEF_H_
#define FLASH_ADDR_RDEF_H_    /* FLASH: Flash Controller */

/* ====================================================================================================
        FLASH Module Instances Address and Mask Definitions
   ==================================================================================================== */
#define INST_FLASH                                               (0X40048000U)    /* flash: */

#define MASK_FLASH                                               (0XFFFFFFFFU)    /* FLASH: Flash Controller */

/* ====================================================================================================
        FLASH Module Register Address Offset Definitions
   ==================================================================================================== */
#define IDX_FLASH_FEESTA                                        (0X00000000U)    /* Status Register */
#define IDX_FLASH_FEECON0                                       (0X00000004U)    /* Command Control Register – Interrupt Enable Register */
#define IDX_FLASH_FEECMD                                        (0X00000008U)    /* Command Register */
#define IDX_FLASH_FEEFLADR                                      (0X0000000CU)    /* Flash Address Key - Hole Register */
#define IDX_FLASH_FEEFLDATA0                                    (0X00000010U)    /* Flash Data Register - Key - Hole Interface Lower 32 Bits */
#define IDX_FLASH_FEEFLDATA1                                    (0X00000014U)    /* Flash Data Register - Key - Hole Interface Upper 32 Bits */
#define IDX_FLASH_FEEADR0                                       (0X00000018U)    /* Lower Page Address */
#define IDX_FLASH_FEEADR1                                       (0X0000001CU)    /* Upper Page Address */
#define IDX_FLASH_FEEKEY                                        (0X00000020U)    /* Flash Key Register. */
#define IDX_FLASH_FEEPRO0                                       (0X00000028U)    /* Write Protection Register for Flash0 */
#define IDX_FLASH_FEEPRO1                                       (0X0000002CU)    /* Write Protection Register for Flash1 */
#define IDX_FLASH_FEESIG                                        (0X00000034U)    /* Flash Signature */
#define IDX_FLASH_FEECON1                                       (0X00000038U)    /* User Setup Register */
#define IDX_FLASH_FEEWRADDRA                                    (0X00000040U)    /* Write Abort Address Register */
#define IDX_FLASH_FEEAEN0                                       (0X00000048U)    /* Lower 32 Bits of the Sys Irq Abort Enable Register. */
#define IDX_FLASH_FEEAEN1                                       (0X0000004CU)    /* Middle 32 Bits of the Sys Irq Abort Enable Register. */
#define IDX_FLASH_FEEAEN2                                       (0X00000050U)    /* Upper 32 Bits of the Sys Irq Abort Enable Register. */
#define IDX_FLASH_FEEECCCONFIG                                  (0X00000064U)    /* Configurable ECC Enable/disable, Error Response */
#define IDX_FLASH_FEEECCADDRC0                                  (0X00000074U)    /* Flash 0 ECC Error Address via CODE Bus */
#define IDX_FLASH_FEEECCADDRC1                                  (0X00000078U)    /* Flash 1 ECC Error Address via CODE Bus */
#define IDX_FLASH_FEEECCADDRD0                                  (0X00000094U)    /* Flash 0 ECC Error Address via DMA Bus */
#define IDX_FLASH_FEEECCADDRD1                                  (0X00000098U)    /* Flash 1 ECC Error Address via DMA Bus */

