ChibiOS/ChibiOS/os/common/ext/ADI/ADUCM41x/ADuCM410.h
/* ====================================================================================================
        FLASH Module Register ResetValue Definitions
   ==================================================================================================== */
#define RSTVAL_FLASH_FEESTA                                        (0X0) 
#define RSTVAL_FLASH_FEECON0                                       (0X0) 
#define RSTVAL_FLASH_FEECMD                                        (0X0) 
#define RSTVAL_FLASH_FEEFLADR                                      (0X0) 
#define RSTVAL_FLASH_FEEFLDATA0                                    (0X0) 
#define RSTVAL_FLASH_FEEFLDATA1                                    (0X0) 
#define RSTVAL_FLASH_FEEADR0                                       (0X0) 
#define RSTVAL_FLASH_FEEADR1                                       (0X0) 
#define RSTVAL_FLASH_FEEKEY                                        (0X0) 
#define RSTVAL_FLASH_FEEPRO0                                       (0XFFFFFFFF) 
#define RSTVAL_FLASH_FEEPRO1                                       (0XFFFFFFFF) 
#define RSTVAL_FLASH_FEECON1                                       (0X0) 
#define RSTVAL_FLASH_FEEAEN0                                       (0X0) 
#define RSTVAL_FLASH_FEEAEN1                                       (0X0) 
#define RSTVAL_FLASH_FEEAEN2                                       (0X0) 
#define RSTVAL_FLASH_FEEECCCONFIG                                  (0X12) 
#define RSTVAL_FLASH_FEEECCADDRC0                                  (0X0) 
#define RSTVAL_FLASH_FEEECCADDRC1                                  (0X0) 
#define RSTVAL_FLASH_FEEECCADDRD0                                  (0X0) 
#define RSTVAL_FLASH_FEEECCADDRD1                                  (0X0) 

/* ====================================================================================================
        FLASH Module Register BitPositions, Lengths, Masks and Enumerations Definitions
   ==================================================================================================== */

/* ----------------------------------------------------------------------------------------------------
          FEESTA                                                Value             Description
   ---------------------------------------------------------------------------------------------------- */
#define BITP_FLASH_FEESTA_CMDBUSY                             (0U)           /* Command Busy. */
#define BITL_FLASH_FEESTA_CMDBUSY                             (1U)           /* Command Busy. */
#define BITM_FLASH_FEESTA_CMDBUSY                             (0X00000001U)  /* Command Busy. */
#define BITP_FLASH_FEESTA_WRCLOSE                             (1U)           /* Key-hole Registers Closed for Access */
#define BITL_FLASH_FEESTA_WRCLOSE                             (1U)           /* Key-hole Registers Closed for Access */
#define BITM_FLASH_FEESTA_WRCLOSE                             (0X00000002U)  /* Key-hole Registers Closed for Access */
#define BITP_FLASH_FEESTA_CMDCOMP                             (2U)           /* Command Complete */
#define BITL_FLASH_FEESTA_CMDCOMP                             (1U)           /* Command Complete */
#define BITM_FLASH_FEESTA_CMDCOMP                             (0X00000004U)  /* Command Complete */
#define BITP_FLASH_FEESTA_WRALCOMP                            (3U)           /* Write Almost Complete – Key-hole Registers Open for Access */
#define BITL_FLASH_FEESTA_WRALCOMP                            (1U)           /* Write Almost Complete – Key-hole Registers Open for Access */
#define BITM_FLASH_FEESTA_WRALCOMP                            (0X00000008U)  /* Write Almost Complete – Key-hole Registers Open for Access */
#define BITP_FLASH_FEESTA_CMDFAIL                             (4U)           /* Command Failed */
#define BITL_FLASH_FEESTA_CMDFAIL                             (2U)           /* Command Failed */
#define BITM_FLASH_FEESTA_CMDFAIL                             (0X00000030U)  /* Command Failed */
#define BITP_FLASH_FEESTA_ECCERRCMD                           (7U)           /* ECC Errors Produced During Signature Commands */
#define BITL_FLASH_FEESTA_ECCERRCMD                           (2U)           /* ECC Errors Produced During Signature Commands */
#define BITM_FLASH_FEESTA_ECCERRCMD                           (0X00000180U)  /* ECC Errors Produced During Signature Commands */
#define BITP_FLASH_FEESTA_ECCREADERRFLSH0                     (9U)           /* ECC Interrupt Errors During AHB Read to Flash 0. */
#define BITL_FLASH_FEESTA_ECCREADERRFLSH0                     (2U)           /* ECC Interrupt Errors During AHB Read to Flash 0. */
#define BITM_FLASH_FEESTA_ECCREADERRFLSH0                     (0X00000600U)  /* ECC Interrupt Errors During AHB Read to Flash 0. */
#define BITP_FLASH_FEESTA_ECCREADERRFLSH1                     (11U)          /* ECC Interrupt Errors During AHB Read to Flash 1. */
#define BITL_FLASH_FEESTA_ECCREADERRFLSH1                     (2U)           /* ECC Interrupt Errors During AHB Read to Flash 1. */
#define BITM_FLASH_FEESTA_ECCREADERRFLSH1                     (0X00001800U)  /* ECC Interrupt Errors During AHB Read to Flash 1. */
#define BITP_FLASH_FEESTA_SIGNERR                             (13U)          /* Initial Signature Check Error on Info Space */
#define BITL_FLASH_FEESTA_SIGNERR                             (1U)           /* Initial Signature Check Error on Info Space */
#define BITM_FLASH_FEESTA_SIGNERR                             (0X00002000U)  /* Initial Signature Check Error on Info Space */
#define BITP_FLASH_FEESTA_INIT                                (14U)          /* Initialization Upload in Progress. */
#define BITL_FLASH_FEESTA_INIT                                (1U)           /* Initialization Upload in Progress. */
#define BITM_FLASH_FEESTA_INIT                                (0X00004000U)  /* Initialization Upload in Progress. */
#define BITP_FLASH_FEESTA_ECCERRINITSIGN                      (15U)          /* ECC Error on Initial Info Signature Check */
#define BITL_FLASH_FEESTA_ECCERRINITSIGN                      (2U)           /* ECC Error on Initial Info Signature Check */
#define BITM_FLASH_FEESTA_ECCERRINITSIGN                      (0X00018000U)  /* ECC Error on Initial Info Signature Check */
#define BITP_FLASH_FEESTA_ECCERRCNTC0                         (17U)          /* ECC Error Count via CODE Bus of Flash 0 */
#define BITL_FLASH_FEESTA_ECCERRCNTC0                         (3U)           /* ECC Error Count via CODE Bus of Flash 0 */
#define BITM_FLASH_FEESTA_ECCERRCNTC0                         (0X000E0000U)  /* ECC Error Count via CODE Bus of Flash 0 */
#define BITP_FLASH_FEESTA_ECCERRCNTD0                         (20U)          /* ECC Error Count via DMA Bus of Flash 0 */
#define BITL_FLASH_FEESTA_ECCERRCNTD0                         (2U)           /* ECC Error Count via DMA Bus of Flash 0 */
#define BITM_FLASH_FEESTA_ECCERRCNTD0                         (0X00300000U)  /* ECC Error Count via DMA Bus of Flash 0 */
#define BITP_FLASH_FEESTA_ECCERRCNTC1                         (22U)          /* ECC Error Count via CODE Bus of Flash 1 */
#define BITL_FLASH_FEESTA_ECCERRCNTC1                         (3U)           /* ECC Error Count via CODE Bus of Flash 1 */
#define BITM_FLASH_FEESTA_ECCERRCNTC1                         (0X01C00000U)  /* ECC Error Count via CODE Bus of Flash 1 */
#define BITP_FLASH_FEESTA_ECCHRESPCODE                        (25U)          /* ECC Error Response on CODE Bus */
#define BITL_FLASH_FEESTA_ECCHRESPCODE                        (2U)           /* ECC Error Response on CODE Bus */
#define BITM_FLASH_FEESTA_ECCHRESPCODE                        (0X06000000U)  /* ECC Error Response on CODE Bus */
#define BITP_FLASH_FEESTA_ECCHRESPDMA                         (27U)          /* ECC Error Response on DMA Bus */
#define BITL_FLASH_FEESTA_ECCHRESPDMA                         (2U)           /* ECC Error Response on DMA Bus */
#define BITM_FLASH_FEESTA_ECCHRESPDMA                         (0X18000000U)  /* ECC Error Response on DMA Bus */
#define BITP_FLASH_FEESTA_ECCERRCNTD1                         (29U)          /* ECC Error Count via DMA Bus of Flash 1 */
#define BITL_FLASH_FEESTA_ECCERRCNTD1                         (2U)           /* ECC Error Count via DMA Bus of Flash 1 */
#define BITM_FLASH_FEESTA_ECCERRCNTD1                         (0X60000000U)  /* ECC Error Count via DMA Bus of Flash 1 */

#define ENUM_FLASH_FEESTA_ECCHRESPDMA_NOERROR                 (0X00000000U)  /* No Error. Successful Read from Program Flash via AHB Bus */
#define ENUM_FLASH_FEESTA_ECCHRESPDMA_ERROR2BIT               (0X00000001U)  /* During AHB Read to Flash, 2 Bit Error Detected, Not Corrected. */
#define ENUM_FLASH_FEESTA_ECCHRESPDMA_ERROR1BIT               (0X00000002U)  /* 1 Bit Error is Corrected for One Flash Location While Doing AHB Read to Program Flash */
#define ENUM_FLASH_FEESTA_ECCHRESPDMA_RESERVED                (0X00000003U)  /* Reserved */
#define ENUM_FLASH_FEESTA_ECCHRESPCODE_NOERROR                (0X00000000U)  /* No Error. Successful Read from Program Flash via AHB Bus */
#define ENUM_FLASH_FEESTA_ECCHRESPCODE_ERROR2BIT              (0X00000001U)  /* During AHB Read to Flash, 2 Bit Error Detected, Not Corrected. */
#define ENUM_FLASH_FEESTA_ECCHRESPCODE_ERROR1BIT              (0X00000002U)  /* 1 Bit Error is Corrected for One Flash Location While Doing AHB Read to Program Flash */
#define ENUM_FLASH_FEESTA_ECCHRESPCODE_RESERVED               (0X00000003U)  /* Reserved */
#define ENUM_FLASH_FEESTA_ECCERRINITSIGN_NOERROR              (0X00000000U)  /* No Error, Successful Flash Read Operation During Initial Signature Check, Page Signature Check */
#define ENUM_FLASH_FEESTA_ECCERRINITSIGN_ERROR2BIT            (0X00000001U)  /* During Initial Signature Check, 2 Bit Error Detected, Not Corrected for at Least One Flash Location */
#define ENUM_FLASH_FEESTA_ECCERRINITSIGN_ERROR1BIT            (0X00000002U)  /* 1 Bit Error is Corrected for One Flash Location While Doing Signature Commands */
#define ENUM_FLASH_FEESTA_ECCERRINITSIGN_ERROR1OR2BIT         (0X00000003U)  /* During Initial Signature Command, 1 Bit Error and 2 Bit Errors are Detected on One or More Flash Locations */
#define ENUM_FLASH_FEESTA_ECCREADERRFLSH1_NOERROR             (0X00000000U)  /* No Error. Successful Read from Data Flash via AHB Bus */
#define ENUM_FLASH_FEESTA_ECCREADERRFLSH1_ERROR2BIT           (0X00000001U)  /* 1 Bit Error is Corrected for One Flash Location While Doing AHB Read to Data Flash */
#define ENUM_FLASH_FEESTA_ECCREADERRFLSH1_ERROR1BIT           (0X00000002U)  /* During AHB Read to Flash, 2 Bit Error Detected, Not Corrected. */
#define ENUM_FLASH_FEESTA_ECCREADERRFLSH1_ERROR1OR2BIT        (0X00000003U)  /* During AHB Read, It is Either ECC Error or ECC Corrected Error Only. but This Condition Can Occur If the Consecutive Access Had AHB HRESP Error Due to ECC Error, Before the Status Register is Read. */
#define ENUM_FLASH_FEESTA_ECCREADERRFLSH0_NOERROR             (0X00000000U)  /* No Error. Successful Read from Program Flash via AHB Bus */
#define ENUM_FLASH_FEESTA_ECCREADERRFLSH0_ERROR2BIT           (0X00000001U)  /* During AHB Read to Flash, 2 Bit Error Detected, Not Corrected. */
#define ENUM_FLASH_FEESTA_ECCREADERRFLSH0_ERROR1BIT           (0X00000002U)  /* 1 Bit Error is Corrected for One Flash Location While Doing AHB Read to Program Flash */
#define ENUM_FLASH_FEESTA_ECCREADERRFLSH0_ERROR1OR2BIT        (0X00000003U)  /* During AHB Read, It is Either ECC Error or ECC Corrected Error Only. but This Condition Can Occur If the Consecutive Access Had AHB HRESP Error Due to ECC Error, Before the Status Register is Read. */
#define ENUM_FLASH_FEESTA_ECCERRCMD_NOERROR                   (0X00000000U)  /* No Error, Successful Flash Read Operation During Signature Check */
#define ENUM_FLASH_FEESTA_ECCERRCMD_ERROR2BIT                 (0X00000001U)  /* During Signature Commands, 2 Bit Error is Detected on One or More Flash Locations, Not Corrected. */
#define ENUM_FLASH_FEESTA_ECCERRCMD_ERROR1BIT                 (0X00000002U)  /* 1 Bit Error is Corrected for One or More Flash Locations While Doing Signature Commands */
#define ENUM_FLASH_FEESTA_ECCERRCMD_ERROR1OR2BIT              (0X00000003U)  /* During Signature Commands, 1 Bit Error and 2 Bit Errors are Detected on One or More Flash Locations */
#define ENUM_FLASH_FEESTA_CMDFAIL_SUCCESS                     (0X00000000U)  /* Successful Completion of a Command or a Write */
#define ENUM_FLASH_FEESTA_CMDFAIL_DENIED                      (0X00000001U)  /* Attempted Signcheck,write or Erase of a Protected Location or Out of Memory Location. the Command is Ignored. */
#define ENUM_FLASH_FEESTA_CMDFAIL_VERIFYERR                   (0X00000002U)  /* Read Verify Error */
#define ENUM_FLASH_FEESTA_CMDFAIL_ABORTED                     (0X00000003U)  /* Indicates That a Command or a Write Was Aborted by an Abort Command or a System Interrupt Has Caused an Abort */

