ChibiOS/ChibiOS/os/common/ext/ADI/ADUCM41x/ADuCM410.h
/* ----------------------------------------------------------------------------------------------------
          OE                                                    Value             Description
   ---------------------------------------------------------------------------------------------------- */
#define BITP_GPIO_OE_OE                                       (0U)           /* Open Drain Enable */
#define BITL_GPIO_OE_OE                                       (8U)           /* Open Drain Enable */
#define BITM_GPIO_OE_OE                                       (0XFFU)        /* Open Drain Enable */

/* ----------------------------------------------------------------------------------------------------
          IE                                                    Value             Description
   ---------------------------------------------------------------------------------------------------- */
#define BITP_GPIO_IE_IE                                       (0U)           /* Input Enable */
#define BITL_GPIO_IE_IE                                       (8U)           /* Input Enable */
#define BITM_GPIO_IE_IE                                       (0XFFU)        /* Input Enable */

/* ----------------------------------------------------------------------------------------------------
          IN                                                    Value             Description
   ---------------------------------------------------------------------------------------------------- */
#define BITP_GPIO_IN_A                                        (0U)           /* Diver Data Input */
#define BITL_GPIO_IN_A                                        (8U)           /* Diver Data Input */
#define BITM_GPIO_IN_A                                        (0XFFU)        /* Diver Data Input */

/* ----------------------------------------------------------------------------------------------------
          OUT                                                   Value             Description
   ---------------------------------------------------------------------------------------------------- */
#define BITP_GPIO_OUT_Y                                       (0U)           /* Input Data from Pad */
#define BITL_GPIO_OUT_Y                                       (8U)           /* Input Data from Pad */
#define BITM_GPIO_OUT_Y                                       (0XFFU)        /* Input Data from Pad */

/* ----------------------------------------------------------------------------------------------------
          SET                                                   Value             Description
   ---------------------------------------------------------------------------------------------------- */
#define BITP_GPIO_SET_SETUP                                   (0U)           /* Set the Output HIGH for the Pin */
#define BITL_GPIO_SET_SETUP                                   (8U)           /* Set the Output HIGH for the Pin */
#define BITM_GPIO_SET_SETUP                                   (0XFFU)        /* Set the Output HIGH for the Pin */

/* ----------------------------------------------------------------------------------------------------
          CLR                                                   Value             Description
   ---------------------------------------------------------------------------------------------------- */
#define BITP_GPIO_CLR_CLR                                     (0U)           /* Set the Output Low for the Port Pin */
#define BITL_GPIO_CLR_CLR                                     (8U)           /* Set the Output Low for the Port Pin */
#define BITM_GPIO_CLR_CLR                                     (0XFFU)        /* Set the Output Low for the Port Pin */

/* ----------------------------------------------------------------------------------------------------
          TGL                                                   Value             Description
   ---------------------------------------------------------------------------------------------------- */
#define BITP_GPIO_TGL_TGL                                     (0U)           /* Toggle the Output of the Port Pin */
#define BITL_GPIO_TGL_TGL                                     (8U)           /* Toggle the Output of the Port Pin */
#define BITM_GPIO_TGL_TGL                                     (0XFFU)        /* Toggle the Output of the Port Pin */

/* ----------------------------------------------------------------------------------------------------
          ODE                                                   Value             Description
   ---------------------------------------------------------------------------------------------------- */
#define BITP_GPIO_ODE_ODE                                     (0U)           /* Open Drain Enable */
#define BITL_GPIO_ODE_ODE                                     (8U)           /* Open Drain Enable */
#define BITM_GPIO_ODE_ODE                                     (0XFFU)        /* Open Drain Enable */

/* ----------------------------------------------------------------------------------------------------
          IS                                                    Value             Description
   ---------------------------------------------------------------------------------------------------- */
#define BITP_GPIO_IS_IS                                       (0U)           /* Input Select */
#define BITL_GPIO_IS_IS                                       (8U)           /* Input Select */
#define BITM_GPIO_IS_IS                                       (0XFFU)        /* Input Select */

/* ----------------------------------------------------------------------------------------------------
          PE                                                    Value             Description
   ---------------------------------------------------------------------------------------------------- */
#define BITP_GPIO_PE_PE                                       (0U)           /* Pull Enable */
#define BITL_GPIO_PE_PE                                       (8U)           /* Pull Enable */
#define BITM_GPIO_PE_PE                                       (0XFFU)        /* Pull Enable */

