ChibiOS/ChibiOS/os/common/ext/ADI/ADUCM41x/ADuCM410.h
/* ----------------------------------------------------------------------------------------------------
          PWR                                                   Value             Description
   ---------------------------------------------------------------------------------------------------- */
#define BITP_GPIO_PWR_PWR                                     (0U)           /* Pad Power Select */
#define BITL_GPIO_PWR_PWR                                     (8U)           /* Pad Power Select */
#define BITM_GPIO_PWR_PWR                                     (0XFFU)        /* Pad Power Select */

/* ----------------------------------------------------------------------------------------------------
          POL                                                   Value             Description
   ---------------------------------------------------------------------------------------------------- */
#define BITP_GPIO_POL_INTPOL                                  (0U)           /* Parametric Output */
#define BITL_GPIO_POL_INTPOL                                  (8U)           /* Parametric Output */
#define BITM_GPIO_POL_INTPOL                                  (0XFFU)        /* Parametric Output */

/* ----------------------------------------------------------------------------------------------------
          IENA                                                  Value             Description
   ---------------------------------------------------------------------------------------------------- */
#define BITP_GPIO_IENA_INTAEN                                 (0U)           /* InterruptA Enable */
#define BITL_GPIO_IENA_INTAEN                                 (8U)           /* InterruptA Enable */
#define BITM_GPIO_IENA_INTAEN                                 (0XFFU)        /* InterruptA Enable */

/* ----------------------------------------------------------------------------------------------------
          IENB                                                  Value             Description
   ---------------------------------------------------------------------------------------------------- */
#define BITP_GPIO_IENB_INTBEN                                 (0U)           /* InterruptA Enable */
#define BITL_GPIO_IENB_INTBEN                                 (8U)           /* InterruptA Enable */
#define BITM_GPIO_IENB_INTBEN                                 (0XFFU)        /* InterruptA Enable */

/* ----------------------------------------------------------------------------------------------------
          INT                                                   Value             Description
   ---------------------------------------------------------------------------------------------------- */
#define BITP_GPIO_INT_INTSTATUS                               (0U)           /* Interrupt Status */
#define BITL_GPIO_INT_INTSTATUS                               (8U)           /* Interrupt Status */
#define BITM_GPIO_INT_INTSTATUS                               (0XFFU)        /* Interrupt Status */

#endif  /* end ifndef GPIO_ADDR_RDEF_H_ */


#ifndef SPI_ADDR_RDEF_H_
#define SPI_ADDR_RDEF_H_    /* SPI: Serial Peripheral Interface */

/* ====================================================================================================
        SPI Module Instances Address and Mask Definitions
   ==================================================================================================== */
#define INST_SPI0                                                (0X40054000U)    /* spi0: */
#define INST_SPI1                                                (0X40058000U)    /* spi1: */
#define INST_SPI2                                                (0X4005C000U)    /* spi2: */

#define MASK_SPI                                                 (0X000000FFU)    /* SPI: Serial Peripheral Interface */

/* ====================================================================================================
        SPI Module Register Address Offset Definitions
   ==================================================================================================== */
#define IDX_SPI_STAT                                            (0X00U)    /* Status */
#define IDX_SPI_RX                                              (0X04U)    /* Receive */
#define IDX_SPI_TX                                              (0X08U)    /* Transmit */
#define IDX_SPI_DIV                                             (0X0CU)    /* SPI Baud Rate Selection */
#define IDX_SPI_CTL                                             (0X10U)    /* SPI Configuration 1 */
#define IDX_SPI_IEN                                             (0X14U)    /* SPI Configuration 2 */
#define IDX_SPI_CNT                                             (0X18U)    /* Transfer Byte Count */
#define IDX_SPI_DMA                                             (0X1CU)    /* SPI DMA Enable */
#define IDX_SPI_FIFOSTAT                                        (0X20U)    /* FIFO Status */
#define IDX_SPI_RDCTL                                           (0X24U)    /* Read Control */
#define IDX_SPI_FLOWCTL                                         (0X28U)    /* Flow Control */
#define IDX_SPI_WAITTMR                                         (0X2CU)    /* Wait Timer for Flow Control */
#define IDX_SPI_CSOVERRIDE                                      (0X34U)    /* Chip-Select Override */

/* ====================================================================================================
        SPI Module Register ResetValue Definitions
   ==================================================================================================== */
#define RSTVAL_SPI_STAT                                            (0X800) 
#define RSTVAL_SPI_RX                                              (0X0) 
#define RSTVAL_SPI_TX                                              (0X0) 
#define RSTVAL_SPI_DIV                                             (0X0) 
#define RSTVAL_SPI_CTL                                             (0X0) 
#define RSTVAL_SPI_IEN                                             (0X0) 
#define RSTVAL_SPI_CNT                                             (0X0) 
#define RSTVAL_SPI_DMA                                             (0X0) 
#define RSTVAL_SPI_FIFOSTAT                                        (0X0) 
#define RSTVAL_SPI_RDCTL                                           (0X0) 
#define RSTVAL_SPI_FLOWCTL                                         (0X0) 
#define RSTVAL_SPI_WAITTMR                                         (0X0) 
#define RSTVAL_SPI_CSOVERRIDE                                      (0X0) 

