ChibiOS/ChibiOS/os/common/ext/ADI/ADUCM41x/ADuCM410.h
/* ====================================================================================================
        SPI Module Register BitPositions, Lengths, Masks and Enumerations Definitions
   ==================================================================================================== */

/* ----------------------------------------------------------------------------------------------------
          STAT                                                  Value             Description
   ---------------------------------------------------------------------------------------------------- */
#define BITP_SPI_STAT_IRQ                                     (0U)           /* SPI Interrupt Status */
#define BITL_SPI_STAT_IRQ                                     (1U)           /* SPI Interrupt Status */
#define BITM_SPI_STAT_IRQ                                     (0X0001U)      /* SPI Interrupt Status */
#define BITP_SPI_STAT_XFRDONE                                 (1U)           /* SPI Transfer Completion */
#define BITL_SPI_STAT_XFRDONE                                 (1U)           /* SPI Transfer Completion */
#define BITM_SPI_STAT_XFRDONE                                 (0X0002U)      /* SPI Transfer Completion */
#define BITP_SPI_STAT_TXEMPTY                                 (2U)           /* SPI Tx FIFO Empty Interrupt */
#define BITL_SPI_STAT_TXEMPTY                                 (1U)           /* SPI Tx FIFO Empty Interrupt */
#define BITM_SPI_STAT_TXEMPTY                                 (0X0004U)      /* SPI Tx FIFO Empty Interrupt */
#define BITP_SPI_STAT_TXDONE                                  (3U)           /* SPI Tx Done in Read Command Mode */
#define BITL_SPI_STAT_TXDONE                                  (1U)           /* SPI Tx Done in Read Command Mode */
#define BITM_SPI_STAT_TXDONE                                  (0X0008U)      /* SPI Tx Done in Read Command Mode */
#define BITP_SPI_STAT_TXUNDR                                  (4U)           /* SPI Tx FIFO Underflow */
#define BITL_SPI_STAT_TXUNDR                                  (1U)           /* SPI Tx FIFO Underflow */
#define BITM_SPI_STAT_TXUNDR                                  (0X0010U)      /* SPI Tx FIFO Underflow */
#define BITP_SPI_STAT_TXIRQ                                   (5U)           /* SPI Tx IRQ */
#define BITL_SPI_STAT_TXIRQ                                   (1U)           /* SPI Tx IRQ */
#define BITM_SPI_STAT_TXIRQ                                   (0X0020U)      /* SPI Tx IRQ */
#define BITP_SPI_STAT_RXIRQ                                   (6U)           /* SPI Rx IRQ */
#define BITL_SPI_STAT_RXIRQ                                   (1U)           /* SPI Rx IRQ */
#define BITM_SPI_STAT_RXIRQ                                   (0X0040U)      /* SPI Rx IRQ */
#define BITP_SPI_STAT_RXOVR                                   (7U)           /* SPI Rx FIFO Overflow */
#define BITL_SPI_STAT_RXOVR                                   (1U)           /* SPI Rx FIFO Overflow */
#define BITM_SPI_STAT_RXOVR                                   (0X0080U)      /* SPI Rx FIFO Overflow */
#define BITP_SPI_STAT_CS                                      (11U)          /* CS Status */
#define BITL_SPI_STAT_CS                                      (1U)           /* CS Status */
#define BITM_SPI_STAT_CS                                      (0X0800U)      /* CS Status */
#define BITP_SPI_STAT_CSERR                                   (12U)          /* Detected a CS Error Condition in Slave Mode */
#define BITL_SPI_STAT_CSERR                                   (1U)           /* Detected a CS Error Condition in Slave Mode */
#define BITM_SPI_STAT_CSERR                                   (0X1000U)      /* Detected a CS Error Condition in Slave Mode */
#define BITP_SPI_STAT_CSRISE                                  (13U)          /* Detected a Rising Edge on CS, in Slave CON Mode */
#define BITL_SPI_STAT_CSRISE                                  (1U)           /* Detected a Rising Edge on CS, in Slave CON Mode */
#define BITM_SPI_STAT_CSRISE                                  (0X2000U)      /* Detected a Rising Edge on CS, in Slave CON Mode */
#define BITP_SPI_STAT_CSFALL                                  (14U)          /* Detected a Falling Edge on CS, in Slave CON Mode */
#define BITL_SPI_STAT_CSFALL                                  (1U)           /* Detected a Falling Edge on CS, in Slave CON Mode */
#define BITM_SPI_STAT_CSFALL                                  (0X4000U)      /* Detected a Falling Edge on CS, in Slave CON Mode */
#define BITP_SPI_STAT_RDY                                     (15U)          /* Detected an Edge on Ready Indicator for Flow-control */
#define BITL_SPI_STAT_RDY                                     (1U)           /* Detected an Edge on Ready Indicator for Flow-control */
#define BITM_SPI_STAT_RDY                                     (0X8000U)      /* Detected an Edge on Ready Indicator for Flow-control */

/* ----------------------------------------------------------------------------------------------------
          RX                                                    Value             Description
   ---------------------------------------------------------------------------------------------------- */
#define BITP_SPI_RX_BYTE1                                     (0U)           /* 8-bit Receive Buffer */
#define BITL_SPI_RX_BYTE1                                     (8U)           /* 8-bit Receive Buffer */
#define BITM_SPI_RX_BYTE1                                     (0X00FFU)      /* 8-bit Receive Buffer */
#define BITP_SPI_RX_BYTE2                                     (8U)           /* 8-bit Receive Buffer, Used Only in DMA Modes */
#define BITL_SPI_RX_BYTE2                                     (8U)           /* 8-bit Receive Buffer, Used Only in DMA Modes */
#define BITM_SPI_RX_BYTE2                                     (0XFF00U)      /* 8-bit Receive Buffer, Used Only in DMA Modes */

