ChibiOS/ChibiOS/os/common/ext/ADI/ADUCM41x/ADuCM410.h
/* ----------------------------------------------------------------------------------------------------
          TX                                                    Value             Description
   ---------------------------------------------------------------------------------------------------- */
#define BITP_SPI_TX_BYTE1                                     (0U)           /* 8-bit Transmit Buffer */
#define BITL_SPI_TX_BYTE1                                     (8U)           /* 8-bit Transmit Buffer */
#define BITM_SPI_TX_BYTE1                                     (0X00FFU)      /* 8-bit Transmit Buffer */
#define BITP_SPI_TX_BYTE2                                     (8U)           /* 8-bit Transmit Buffer, Used Only in DMA Modes */
#define BITL_SPI_TX_BYTE2                                     (8U)           /* 8-bit Transmit Buffer, Used Only in DMA Modes */
#define BITM_SPI_TX_BYTE2                                     (0XFF00U)      /* 8-bit Transmit Buffer, Used Only in DMA Modes */

/* ----------------------------------------------------------------------------------------------------
          DIV                                                   Value             Description
   ---------------------------------------------------------------------------------------------------- */
#define BITP_SPI_DIV_DIV                                      (0U)           /* SPI Clock Divider */
#define BITL_SPI_DIV_DIV                                      (6U)           /* SPI Clock Divider */
#define BITM_SPI_DIV_DIV                                      (0X003FU)      /* SPI Clock Divider */
#define BITP_SPI_DIV_SFR                                      (8U)           /* Slave Free Run Mode */
#define BITL_SPI_DIV_SFR                                      (1U)           /* Slave Free Run Mode */
#define BITM_SPI_DIV_SFR                                      (0X0100U)      /* Slave Free Run Mode */

/* ----------------------------------------------------------------------------------------------------
          CTL                                                   Value             Description
   ---------------------------------------------------------------------------------------------------- */
#define BITP_SPI_CTL_SPIEN                                    (0U)           /* SPI Enable */
#define BITL_SPI_CTL_SPIEN                                    (1U)           /* SPI Enable */
#define BITM_SPI_CTL_SPIEN                                    (0X0001U)      /* SPI Enable */
#define BITP_SPI_CTL_MASEN                                    (1U)           /* Master Mode Enable */
#define BITL_SPI_CTL_MASEN                                    (1U)           /* Master Mode Enable */
#define BITM_SPI_CTL_MASEN                                    (0X0002U)      /* Master Mode Enable */
#define BITP_SPI_CTL_CPHA                                     (2U)           /* Serial Clock Phase Mode */
#define BITL_SPI_CTL_CPHA                                     (1U)           /* Serial Clock Phase Mode */
#define BITM_SPI_CTL_CPHA                                     (0X0004U)      /* Serial Clock Phase Mode */
#define BITP_SPI_CTL_CPOL                                     (3U)           /* Serial Clock Polarity */
#define BITL_SPI_CTL_CPOL                                     (1U)           /* Serial Clock Polarity */
#define BITM_SPI_CTL_CPOL                                     (0X0008U)      /* Serial Clock Polarity */
#define BITP_SPI_CTL_WOM                                      (4U)           /* SPI Wired or Mode */
#define BITL_SPI_CTL_WOM                                      (1U)           /* SPI Wired or Mode */
#define BITM_SPI_CTL_WOM                                      (0X0010U)      /* SPI Wired or Mode */
#define BITP_SPI_CTL_LSB                                      (5U)           /* LSB First Transfer Enable */
#define BITL_SPI_CTL_LSB                                      (1U)           /* LSB First Transfer Enable */
#define BITM_SPI_CTL_LSB                                      (0X0020U)      /* LSB First Transfer Enable */
#define BITP_SPI_CTL_TIM                                      (6U)           /* SPI Transfer and Interrupt Mode */
#define BITL_SPI_CTL_TIM                                      (1U)           /* SPI Transfer and Interrupt Mode */
#define BITM_SPI_CTL_TIM                                      (0X0040U)      /* SPI Transfer and Interrupt Mode */
#define BITP_SPI_CTL_ZEN                                      (7U)           /* Transmit Zeros Enable */
#define BITL_SPI_CTL_ZEN                                      (1U)           /* Transmit Zeros Enable */
#define BITM_SPI_CTL_ZEN                                      (0X0080U)      /* Transmit Zeros Enable */
#define BITP_SPI_CTL_RXOF                                     (8U)           /* RX Overflow Overwrite Enable */
#define BITL_SPI_CTL_RXOF                                     (1U)           /* RX Overflow Overwrite Enable */
#define BITM_SPI_CTL_RXOF                                     (0X0100U)      /* RX Overflow Overwrite Enable */
#define BITP_SPI_CTL_OEN                                      (9U)           /* Slave MISO Output Enable */
#define BITL_SPI_CTL_OEN                                      (1U)           /* Slave MISO Output Enable */
#define BITM_SPI_CTL_OEN                                      (0X0200U)      /* Slave MISO Output Enable */
#define BITP_SPI_CTL_LOOPBACK                                 (10U)          /* Loopback Enable */
#define BITL_SPI_CTL_LOOPBACK                                 (1U)           /* Loopback Enable */
#define BITM_SPI_CTL_LOOPBACK                                 (0X0400U)      /* Loopback Enable */
#define BITP_SPI_CTL_CON                                      (11U)          /* Continuous Transfer Enable */
#define BITL_SPI_CTL_CON                                      (1U)           /* Continuous Transfer Enable */
#define BITM_SPI_CTL_CON                                      (0X0800U)      /* Continuous Transfer Enable */
#define BITP_SPI_CTL_RFLUSH                                   (12U)          /* SPI Rx FIFO Flush Enable */
#define BITL_SPI_CTL_RFLUSH                                   (1U)           /* SPI Rx FIFO Flush Enable */
#define BITM_SPI_CTL_RFLUSH                                   (0X1000U)      /* SPI Rx FIFO Flush Enable */
#define BITP_SPI_CTL_TFLUSH                                   (13U)          /* SPI Tx FIFO Flush Enable */
#define BITL_SPI_CTL_TFLUSH                                   (1U)           /* SPI Tx FIFO Flush Enable */
#define BITM_SPI_CTL_TFLUSH                                   (0X2000U)      /* SPI Tx FIFO Flush Enable */
#define BITP_SPI_CTL_CSRST                                    (14U)          /* Reset Mode for CS Error Bit */
#define BITL_SPI_CTL_CSRST                                    (1U)           /* Reset Mode for CS Error Bit */
#define BITM_SPI_CTL_CSRST                                    (0X4000U)      /* Reset Mode for CS Error Bit */

