ChibiOS/ChibiOS/os/common/ext/ADI/ADUCM41x/ADuCM410.h
/* ----------------------------------------------------------------------------------------------------
          IEN                                                   Value             Description
   ---------------------------------------------------------------------------------------------------- */
#define BITP_SPI_IEN_IRQMODE                                  (0U)           /* SPI IRQ Mode Bits */
#define BITL_SPI_IEN_IRQMODE                                  (3U)           /* SPI IRQ Mode Bits */
#define BITM_SPI_IEN_IRQMODE                                  (0X0007U)      /* SPI IRQ Mode Bits */
#define BITP_SPI_IEN_CS                                       (8U)           /* Enable Interrupt on Every CS Edge in Slave CON Mode */
#define BITL_SPI_IEN_CS                                       (1U)           /* Enable Interrupt on Every CS Edge in Slave CON Mode */
#define BITM_SPI_IEN_CS                                       (0X0100U)      /* Enable Interrupt on Every CS Edge in Slave CON Mode */
#define BITP_SPI_IEN_TXUNDR                                   (9U)           /* Tx-underflow Interrupt Enable */
#define BITL_SPI_IEN_TXUNDR                                   (1U)           /* Tx-underflow Interrupt Enable */
#define BITM_SPI_IEN_TXUNDR                                   (0X0200U)      /* Tx-underflow Interrupt Enable */
#define BITP_SPI_IEN_RXOVR                                    (10U)          /* Rx-overflow Interrupt Enable */
#define BITL_SPI_IEN_RXOVR                                    (1U)           /* Rx-overflow Interrupt Enable */
#define BITM_SPI_IEN_RXOVR                                    (0X0400U)      /* Rx-overflow Interrupt Enable */
#define BITP_SPI_IEN_RDY                                      (11U)          /* Ready Signal Edge Interrupt Enable */
#define BITL_SPI_IEN_RDY                                      (1U)           /* Ready Signal Edge Interrupt Enable */
#define BITM_SPI_IEN_RDY                                      (0X0800U)      /* Ready Signal Edge Interrupt Enable */
#define BITP_SPI_IEN_TXDONE                                   (12U)          /* SPI Transmit Done Interrupt Enable */
#define BITL_SPI_IEN_TXDONE                                   (1U)           /* SPI Transmit Done Interrupt Enable */
#define BITM_SPI_IEN_TXDONE                                   (0X1000U)      /* SPI Transmit Done Interrupt Enable */
#define BITP_SPI_IEN_XFRDONE                                  (13U)          /* SPI Transfer Completion Interrupt Enable */
#define BITL_SPI_IEN_XFRDONE                                  (1U)           /* SPI Transfer Completion Interrupt Enable */
#define BITM_SPI_IEN_XFRDONE                                  (0X2000U)      /* SPI Transfer Completion Interrupt Enable */
#define BITP_SPI_IEN_TXEMPTY                                  (14U)          /* Tx-FIFO Empty Interrupt Enable */
#define BITL_SPI_IEN_TXEMPTY                                  (1U)           /* Tx-FIFO Empty Interrupt Enable */
#define BITM_SPI_IEN_TXEMPTY                                  (0X4000U)      /* Tx-FIFO Empty Interrupt Enable */

#define ENUM_SPI_IEN_IRQMODE_TX1RX1                           (0X0000U)      /* Interrupt Occurs After 1 Byte is Transfered or Received */
#define ENUM_SPI_IEN_IRQMODE_TX2RX2                           (0X0001U)      /* Interrupt Occurs After 2 Byte is Transfered or Received */
#define ENUM_SPI_IEN_IRQMODE_TX3RX3                           (0X0002U)      /* Interrupt Occurs After 3 Byte is Transfered or Received */
#define ENUM_SPI_IEN_IRQMODE_TX4RX4                           (0X0003U)      /* Interrupt Occurs After 4 Byte is Transfered or Received */
#define ENUM_SPI_IEN_IRQMODE_TX5RX5                           (0X0004U)      /* Interrupt Occurs After 5 Byte is Transfered or Received */
#define ENUM_SPI_IEN_IRQMODE_TX6RX6                           (0X0005U)      /* Interrupt Occurs After 6 Byte is Transfered or Received */
#define ENUM_SPI_IEN_IRQMODE_TX7RX7                           (0X0006U)      /* Interrupt Occurs After 7 Byte is Transfered or Received */
#define ENUM_SPI_IEN_IRQMODE_TX8RX8                           (0X0007U)      /* Interrupt Occurs After 8 Byte is Transfered or Received */

/* ----------------------------------------------------------------------------------------------------
          CNT                                                   Value             Description
   ---------------------------------------------------------------------------------------------------- */
#define BITP_SPI_CNT_VALUES                                   (0U)           /* Transfer Byte Count */
#define BITL_SPI_CNT_VALUES                                   (14U)          /* Transfer Byte Count */
#define BITM_SPI_CNT_VALUES                                   (0X3FFFU)      /* Transfer Byte Count */
#define BITP_SPI_CNT_FRAMECONT                                (15U)          /* Continue Frame */
#define BITL_SPI_CNT_FRAMECONT                                (1U)           /* Continue Frame */
#define BITM_SPI_CNT_FRAMECONT                                (0X8000U)      /* Continue Frame */

/* ----------------------------------------------------------------------------------------------------
          DMA                                                   Value             Description
   ---------------------------------------------------------------------------------------------------- */
#define BITP_SPI_DMA_EN                                       (0U)           /* Enable DMA for Data Transfer */
#define BITL_SPI_DMA_EN                                       (1U)           /* Enable DMA for Data Transfer */
#define BITM_SPI_DMA_EN                                       (0X0001U)      /* Enable DMA for Data Transfer */
#define BITP_SPI_DMA_TXEN                                     (1U)           /* Enable Transmit DMA Request */
#define BITL_SPI_DMA_TXEN                                     (1U)           /* Enable Transmit DMA Request */
#define BITM_SPI_DMA_TXEN                                     (0X0002U)      /* Enable Transmit DMA Request */
#define BITP_SPI_DMA_RXEN                                     (2U)           /* Enable Receive DMA Request */
#define BITL_SPI_DMA_RXEN                                     (1U)           /* Enable Receive DMA Request */
#define BITM_SPI_DMA_RXEN                                     (0X0004U)      /* Enable Receive DMA Request */

