ChibiOS/ChibiOS/os/common/ext/ADI/ADUCM41x/ADuCM410.h
/* ====================================================================================================
        PWM Module Instances Address and Mask Definitions
   ==================================================================================================== */
#define INST_PWM                                                 (0X40064000U)    /* pwm: */

#define MASK_PWM                                                 (0XFFFFFFFFU)    /* PWM: PWM MMR */

/* ====================================================================================================
        PWM Module Register Address Offset Definitions
   ==================================================================================================== */
#define IDX_PWM_PWMCON0                                         (0X00000000U)    /* PWM Control Register */
#define IDX_PWM_PWMCON1                                         (0X00000004U)    /* ADC Conversion Start and Trip Control Register */
#define IDX_PWM_PWMICLR                                         (0X00000008U)    /* Hardware Trip Configuration Register */
#define IDX_PWM_PWM0COM0                                        (0X00000010U)    /* Compare Register 0 for PWM0 and PWM1 */
#define IDX_PWM_PWM0COM1                                        (0X00000014U)    /* Compare Register 1 for PWM0 and PWM1 */
#define IDX_PWM_PWM0COM2                                        (0X00000018U)    /* Compare Register 2 for PWM0 and PWM1 */
#define IDX_PWM_PWM0LEN                                         (0X0000001CU)    /* Period Value Register for PWM0 and PWM1 */
#define IDX_PWM_PWM1COM0                                        (0X00000020U)    /* Compare Register 0 for PWM2 and PWM3 */
#define IDX_PWM_PWM1COM1                                        (0X00000024U)    /* Compare Register 1 for PWM2 and PWM3 */
#define IDX_PWM_PWM1COM2                                        (0X00000028U)    /* Compare Register 2 for PWM2 and PWM3 */
#define IDX_PWM_PWM1LEN                                         (0X0000002CU)    /* Period Value Register for PWM2 and PWM3 */
#define IDX_PWM_PWM2COM0                                        (0X00000030U)    /* Compare Register 0 for PWM4 and PWM5 */
#define IDX_PWM_PWM2COM1                                        (0X00000034U)    /* Compare Register 1 for PWM4 and PWM5 */
#define IDX_PWM_PWM2COM2                                        (0X00000038U)    /* Compare Register 2 for PWM4 and PWM5 */
#define IDX_PWM_PWM2LEN                                         (0X0000003CU)    /* Period Value Register for PWM4 and PWM5 */

/* ====================================================================================================
        PWM Module Register ResetValue Definitions
   ==================================================================================================== */
#define RSTVAL_PWM_PWMCON0                                         (0X12) 
#define RSTVAL_PWM_PWMCON1                                         (0X0) 
#define RSTVAL_PWM_PWMICLR                                         (0X0) 
#define RSTVAL_PWM_PWM0COM0                                        (0X0) 
#define RSTVAL_PWM_PWM0COM1                                        (0X0) 
#define RSTVAL_PWM_PWM0COM2                                        (0X0) 
#define RSTVAL_PWM_PWM0LEN                                         (0X0) 
#define RSTVAL_PWM_PWM1COM0                                        (0X0) 
#define RSTVAL_PWM_PWM1COM1                                        (0X0) 
#define RSTVAL_PWM_PWM1COM2                                        (0X0) 
#define RSTVAL_PWM_PWM1LEN                                         (0X0) 
#define RSTVAL_PWM_PWM2COM0                                        (0X0) 
#define RSTVAL_PWM_PWM2COM1                                        (0X0) 
#define RSTVAL_PWM_PWM2COM2                                        (0X0) 
#define RSTVAL_PWM_PWM2LEN                                         (0X0) 

/* ====================================================================================================
        PWM Module Register BitPositions, Lengths, Masks and Enumerations Definitions
   ==================================================================================================== */

/* ----------------------------------------------------------------------------------------------------
          PWMCON0                                               Value             Description
   ---------------------------------------------------------------------------------------------------- */
#define BITP_PWM_PWMCON0_PWMEN                                (0U)           /* Master Enable for PWM */
#define BITL_PWM_PWMCON0_PWMEN                                (1U)           /* Master Enable for PWM */
#define BITM_PWM_PWMCON0_PWMEN                                (0X0001U)      /* Master Enable for PWM */
#define BITP_PWM_PWMCON0_HMODE                                (1U)           /* Set to Enable H-bridge Mode */
#define BITL_PWM_PWMCON0_HMODE                                (1U)           /* Set to Enable H-bridge Mode */
#define BITM_PWM_PWMCON0_HMODE                                (0X0002U)      /* Set to Enable H-bridge Mode */
#define BITP_PWM_PWMCON0_HDIR                                 (2U)           /* Direction Control When PWM is in H-bridge Mode */
#define BITL_PWM_PWMCON0_HDIR                                 (1U)           /* Direction Control When PWM is in H-bridge Mode */
#define BITM_PWM_PWMCON0_HDIR                                 (0X0004U)      /* Direction Control When PWM is in H-bridge Mode */
#define BITP_PWM_PWMCON0_LCOMP                                (3U)           /* Signal to Load a New Set of Compare Register Values */
#define BITL_PWM_PWMCON0_LCOMP                                (1U)           /* Signal to Load a New Set of Compare Register Values */
#define BITM_PWM_PWMCON0_LCOMP                                (0X0008U)      /* Signal to Load a New Set of Compare Register Values */
#define BITP_PWM_PWMCON0_HOFF                                 (4U)           /* Set to Turn off the High-side for Pair 0/1 in H-bridge Mode */
#define BITL_PWM_PWMCON0_HOFF                                 (1U)           /* Set to Turn off the High-side for Pair 0/1 in H-bridge Mode */
#define BITM_PWM_PWMCON0_HOFF                                 (0X0010U)      /* Set to Turn off the High-side for Pair 0/1 in H-bridge Mode */
#define BITP_PWM_PWMCON0_POINV                                (5U)           /* Set to Invert PWM Outputs for Pair 0/1 in H-bridge Mode */
#define BITL_PWM_PWMCON0_POINV                                (1U)           /* Set to Invert PWM Outputs for Pair 0/1 in H-bridge Mode */
#define BITM_PWM_PWMCON0_POINV                                (0X0020U)      /* Set to Invert PWM Outputs for Pair 0/1 in H-bridge Mode */
#define BITP_PWM_PWMCON0_PWMCMP                               (6U)           /* PWM Clock Prescaler. Sets UCLK Divider. */
#define BITL_PWM_PWMCON0_PWMCMP                               (3U)           /* PWM Clock Prescaler. Sets UCLK Divider. */
#define BITM_PWM_PWMCON0_PWMCMP                               (0X01C0U)      /* PWM Clock Prescaler. Sets UCLK Divider. */
#define BITP_PWM_PWMCON0_ENA                                  (9U)           /* Enable for Pair 0 and 1 When HOFF=0 and HMODE=1 */
#define BITL_PWM_PWMCON0_ENA                                  (1U)           /* Enable for Pair 0 and 1 When HOFF=0 and HMODE=1 */
#define BITM_PWM_PWMCON0_ENA                                  (0X0200U)      /* Enable for Pair 0 and 1 When HOFF=0 and HMODE=1 */
#define BITP_PWM_PWMCON0_PWMIEN                               (10U)          /* Set to Enable Interrupts for PWM */
#define BITL_PWM_PWMCON0_PWMIEN                               (1U)           /* Set to Enable Interrupts for PWM */
#define BITM_PWM_PWMCON0_PWMIEN                               (0X0400U)      /* Set to Enable Interrupts for PWM */
#define BITP_PWM_PWMCON0_PWM1INV                              (11U)          /* Set to Invert PWM1 Output */
#define BITL_PWM_PWMCON0_PWM1INV                              (1U)           /* Set to Invert PWM1 Output */
#define BITM_PWM_PWMCON0_PWM1INV                              (0X0800U)      /* Set to Invert PWM1 Output */
#define BITP_PWM_PWMCON0_PWM3INV                              (12U)          /* Set to Invert PWM3 Output */
#define BITL_PWM_PWMCON0_PWM3INV                              (1U)           /* Set to Invert PWM3 Output */
#define BITM_PWM_PWMCON0_PWM3INV                              (0X1000U)      /* Set to Invert PWM3 Output */
#define BITP_PWM_PWMCON0_PWM5INV                              (13U)          /* Set to Invert PWM5 Output */
#define BITL_PWM_PWMCON0_PWM5INV                              (1U)           /* Set to Invert PWM5 Output */
#define BITM_PWM_PWMCON0_PWM5INV                              (0X2000U)      /* Set to Invert PWM5 Output */
#define BITP_PWM_PWMCON0_SYNC                                 (15U)          /* Set to Enable PWM Synchronization from the SYNC Pin */
#define BITL_PWM_PWMCON0_SYNC                                 (1U)           /* Set to Enable PWM Synchronization from the SYNC Pin */
#define BITM_PWM_PWMCON0_SYNC                                 (0X8000U)      /* Set to Enable PWM Synchronization from the SYNC Pin */

