ChibiOS/ChibiOS/os/common/ext/ADI/ADUCM41x/ADuCM410.h
#define ENUM_PWM_PWMCON0_SYNC_DIS                             (0X0000U)      /* Ignore Transition from the SYNC Pin */
#define ENUM_PWM_PWMCON0_SYNC_EN                              (0X0001U)      /* All PWM Counters are Reset on the Next Clock Cycle After Detection of a Falling Edge from SYNC Pin */
#define ENUM_PWM_PWMCON0_ENA_DIS                              (0X0000U)      /* Disable Pair 0 and 1 */
#define ENUM_PWM_PWMCON0_ENA_EN                               (0X0001U)      /* Enable Pair 0 and 1 */
#define ENUM_PWM_PWMCON0_PWMCMP_DIV2                          (0X0000U)      /* UCLK/2 */
#define ENUM_PWM_PWMCON0_PWMCMP_DIV4                          (0X0001U)      /* UCLK/4 */
#define ENUM_PWM_PWMCON0_PWMCMP_DIV8                          (0X0002U)      /* UCLK/8 */
#define ENUM_PWM_PWMCON0_PWMCMP_DIV16                         (0X0003U)      /* UCLK/16 */
#define ENUM_PWM_PWMCON0_PWMCMP_DIV32                         (0X0004U)      /* UCLK/32 */
#define ENUM_PWM_PWMCON0_PWMCMP_DIV64                         (0X0005U)      /* UCLK/64 */
#define ENUM_PWM_PWMCON0_PWMCMP_DIV128                        (0X0006U)      /* UCLK/128 */
#define ENUM_PWM_PWMCON0_PWMCMP_DIV256                        (0X0007U)      /* UCLK/256 */
#define ENUM_PWM_PWMCON0_LCOMP_DIS                            (0X0000U)      /* Use the Values Previously Store in the Compare and Length Registers */
#define ENUM_PWM_PWMCON0_LCOMP_EN                             (0X0001U)      /* Load the Internal Compare Registers with Values Stored in the PWMxCOMx and PWMxLEN Registers */
#define ENUM_PWM_PWMCON0_HDIR_DIS                             (0X0000U)      /* PWM2 and PWM3 Act as Output Signals While PWM0 and PWM1 are Held Low */
#define ENUM_PWM_PWMCON0_HDIR_EN                              (0X0001U)      /* PWM0 and PWM1 Act as Output Signals While PWM2 and PWM3 are Held Low */
#define ENUM_PWM_PWMCON0_PWMEN_DIS                            (0X0000U)      /* Disable All PWM Outputs */
#define ENUM_PWM_PWMCON0_PWMEN_EN                             (0X0001U)      /* Enable All PWM Outputs */

/* ----------------------------------------------------------------------------------------------------
          PWMCON1                                               Value             Description
   ---------------------------------------------------------------------------------------------------- */
#define BITP_PWM_PWMCON1_REVREG0                              (4U)           /* Reserved */
#define BITL_PWM_PWMCON1_REVREG0                              (2U)           /* Reserved */
#define BITM_PWM_PWMCON1_REVREG0                              (0X0030U)      /* Reserved */
#define BITP_PWM_PWMCON1_TRIP_EN                              (6U)           /* Set to Enable PWM Trip Functionality */
#define BITL_PWM_PWMCON1_TRIP_EN                              (1U)           /* Set to Enable PWM Trip Functionality */
#define BITM_PWM_PWMCON1_TRIP_EN                              (0X0040U)      /* Set to Enable PWM Trip Functionality */
#define BITP_PWM_PWMCON1_REVREG1                              (8U)           /* Reserved. Return 0 on Reads */
#define BITL_PWM_PWMCON1_REVREG1                              (8U)           /* Reserved. Return 0 on Reads */
#define BITM_PWM_PWMCON1_REVREG1                              (0XFF00U)      /* Reserved. Return 0 on Reads */

/* ----------------------------------------------------------------------------------------------------
          PWMICLR                                               Value             Description
   ---------------------------------------------------------------------------------------------------- */
#define BITP_PWM_PWMICLR_PWM0                                 (0U)           /* Write a 1 to Clear Latched IRQPWM0 Interrupt. */
#define BITL_PWM_PWMICLR_PWM0                                 (1U)           /* Write a 1 to Clear Latched IRQPWM0 Interrupt. */
#define BITM_PWM_PWMICLR_PWM0                                 (0X0001U)      /* Write a 1 to Clear Latched IRQPWM0 Interrupt. */
#define BITP_PWM_PWMICLR_PWM1                                 (1U)           /* Write a 1 to Clear Latched IRQPWM1 Interrupt. */
#define BITL_PWM_PWMICLR_PWM1                                 (1U)           /* Write a 1 to Clear Latched IRQPWM1 Interrupt. */
#define BITM_PWM_PWMICLR_PWM1                                 (0X0002U)      /* Write a 1 to Clear Latched IRQPWM1 Interrupt. */
#define BITP_PWM_PWMICLR_PWM2                                 (2U)           /* Write a 1 to Clear Latched IRQPWM2 Interrupt. */
#define BITL_PWM_PWMICLR_PWM2                                 (1U)           /* Write a 1 to Clear Latched IRQPWM2 Interrupt. */
#define BITM_PWM_PWMICLR_PWM2                                 (0X0004U)      /* Write a 1 to Clear Latched IRQPWM2 Interrupt. */
#define BITP_PWM_PWMICLR_TRIP                                 (4U)           /* Write a 1 to Clear Latched IRQPWMTrip Interrupt. */
#define BITL_PWM_PWMICLR_TRIP                                 (1U)           /* Write a 1 to Clear Latched IRQPWMTrip Interrupt. */
#define BITM_PWM_PWMICLR_TRIP                                 (0X0010U)      /* Write a 1 to Clear Latched IRQPWMTrip Interrupt. */
#define BITP_PWM_PWMICLR_REVREG2                              (5U)           /* Reserved. Return 0 on Reads */
#define BITL_PWM_PWMICLR_REVREG2                              (11U)          /* Reserved. Return 0 on Reads */
#define BITM_PWM_PWMICLR_REVREG2                              (0XFFE0U)      /* Reserved. Return 0 on Reads */

/* ----------------------------------------------------------------------------------------------------
          PWM0COM0                                              Value             Description
   ---------------------------------------------------------------------------------------------------- */
#define BITP_PWM_PWM0COM0_PWM0COM0                            (0U)           /* Compare Register 0 for PWM0 and PWM1 */
#define BITL_PWM_PWM0COM0_PWM0COM0                            (16U)          /* Compare Register 0 for PWM0 and PWM1 */
#define BITM_PWM_PWM0COM0_PWM0COM0                            (0XFFFFU)      /* Compare Register 0 for PWM0 and PWM1 */

