ChibiOS/ChibiOS/os/common/ext/ADI/ADUCM41x/ADuCM410.h
/* ----------------------------------------------------------------------------------------------------
          PWM2COM2                                              Value             Description
   ---------------------------------------------------------------------------------------------------- */
#define BITP_PWM_PWM2COM2_PWM2COM2                            (0U)           /* Compare Register 2 for PWM4 and PWM5 */
#define BITL_PWM_PWM2COM2_PWM2COM2                            (16U)          /* Compare Register 2 for PWM4 and PWM5 */
#define BITM_PWM_PWM2COM2_PWM2COM2                            (0XFFFFU)      /* Compare Register 2 for PWM4 and PWM5 */

/* ----------------------------------------------------------------------------------------------------
          PWM2LEN                                               Value             Description
   ---------------------------------------------------------------------------------------------------- */
#define BITP_PWM_PWM2LEN_PWM2LEN                              (0U)           /* Period Value Register for PWM4 and PWM5 */
#define BITL_PWM_PWM2LEN_PWM2LEN                              (16U)          /* Period Value Register for PWM4 and PWM5 */
#define BITM_PWM_PWM2LEN_PWM2LEN                              (0XFFFFU)      /* Period Value Register for PWM4 and PWM5 */

#endif  /* end ifndef PWM_ADDR_RDEF_H_ */


#ifndef SUBSYS_ADDR_RDEF_H_
#define SUBSYS_ADDR_RDEF_H_    /* SUBSYS: Your module description, here. */

/* ====================================================================================================
        SUBSYS Module Instances Address and Mask Definitions
   ==================================================================================================== */
#define INST_SRAM                                                (0X40065000U)    /* sram: */

#define MASK_SUBSYS                                              (0X00000FFFU)    /* SUBSYS: Your module description, here. */

/* ====================================================================================================
        SUBSYS Module Register Address Offset Definitions
   ==================================================================================================== */
#define IDX_SUBSYS_SRAMCON                                      (0X000U)    /* SRAM Control Register */
#define IDX_SUBSYS_SRAMECCCON                                   (0X00CU)    /* SRAM ECC Control Register */
#define IDX_SUBSYS_SRAMECCSTA                                   (0X010U)    /* SRAM ECC Status Register */
#define IDX_SUBSYS_SRAMECCA0                                    (0X014U)    /* SRAM0 ECC Error Address Register */
#define IDX_SUBSYS_SRAMECCD0                                    (0X018U)    /* SRAM0 ECC Error Data Register */
#define IDX_SUBSYS_SRAMECCP0                                    (0X01CU)    /* SRAM0 ECC Error Parity Register */
#define IDX_SUBSYS_SRAMECCA1                                    (0X020U)    /* SRAM1 ECC Error Address Register */
#define IDX_SUBSYS_SRAMECCD1                                    (0X024U)    /* SRAM1 ECC Error Data Register */
#define IDX_SUBSYS_SRAMECCP1                                    (0X028U)    /* SRAM1 ECC Error Parity Register */
#define IDX_SUBSYS_SRAMECCA2                                    (0X02CU)    /* SRAM2 ECC Error Address Register */
#define IDX_SUBSYS_SRAMECCD2                                    (0X030U)    /* SRAM2 ECC Error Data Register */
#define IDX_SUBSYS_SRAMECCP2                                    (0X034U)    /* SRAM2 ECC Error Parity Register */

/* ====================================================================================================
        SUBSYS Module Register ResetValue Definitions
   ==================================================================================================== */
#define RSTVAL_SUBSYS_SRAMCON                                      (0X2) 
#define RSTVAL_SUBSYS_SRAMECCCON                                   (0XCF) 
#define RSTVAL_SUBSYS_SRAMECCSTA                                   (0X0) 
#define RSTVAL_SUBSYS_SRAMECCA0                                    (0X0) 
#define RSTVAL_SUBSYS_SRAMECCD0                                    (0X0) 
#define RSTVAL_SUBSYS_SRAMECCP0                                    (0X0) 
#define RSTVAL_SUBSYS_SRAMECCA1                                    (0X0) 
#define RSTVAL_SUBSYS_SRAMECCD1                                    (0X0) 
#define RSTVAL_SUBSYS_SRAMECCP1                                    (0X0) 
#define RSTVAL_SUBSYS_SRAMECCA2                                    (0X0) 
#define RSTVAL_SUBSYS_SRAMECCD2                                    (0X0) 
#define RSTVAL_SUBSYS_SRAMECCP2                                    (0X0) 

/* ====================================================================================================
        SUBSYS Module Register BitPositions, Lengths, Masks and Enumerations Definitions
   ==================================================================================================== */

/* ----------------------------------------------------------------------------------------------------
          SRAMCON                                               Value             Description
   ---------------------------------------------------------------------------------------------------- */
#define BITP_SUBSYS_SRAMCON_REMAP                             (0U)           /* Using SRAM0 as Instruction SRAM */
#define BITL_SUBSYS_SRAMCON_REMAP                             (1U)           /* Using SRAM0 as Instruction SRAM */
#define BITM_SUBSYS_SRAMCON_REMAP                             (0X00000001U)  /* Using SRAM0 as Instruction SRAM */
#define BITP_SUBSYS_SRAMCON_CSEL                              (1U)           /* Use Cache as a Part of SRAM0 */
#define BITL_SUBSYS_SRAMCON_CSEL                              (1U)           /* Use Cache as a Part of SRAM0 */
#define BITM_SUBSYS_SRAMCON_CSEL                              (0X00000002U)  /* Use Cache as a Part of SRAM0 */

#define ENUM_SUBSYS_SRAMCON_CSEL_CAS                          (0X00000001U)  /* Cache as SRAM */
#define ENUM_SUBSYS_SRAMCON_CSEL_NCAS                         (0X00000000U)  /* Cache not as SRAM */
#define ENUM_SUBSYS_SRAMCON_REMAP_CODRAM                      (0X00000000U)  /* Using as Code SRAM */
#define ENUM_SUBSYS_SRAMCON_REMAP_SYSRAM                      (0X00000001U)  /* Using as System SRAM */

