ChibiOS/ChibiOS/os/common/ext/ADI/ADUCM41x/ADuCM410.h
/* ----------------------------------------------------------------------------------------------------
          SRAMECCCON                                            Value             Description
   ---------------------------------------------------------------------------------------------------- */
#define BITP_SUBSYS_SRAMECCCON_EN                             (0U)           /* ECC Check Enable */
#define BITL_SUBSYS_SRAMECCCON_EN                             (3U)           /* ECC Check Enable */
#define BITM_SUBSYS_SRAMECCCON_EN                             (0X00000007U)  /* ECC Check Enable */
#define BITP_SUBSYS_SRAMECCCON_BUSERRTYPE                     (3U)           /* ECC AHB Bus Error Response Type */
#define BITL_SUBSYS_SRAMECCCON_BUSERRTYPE                     (2U)           /* ECC AHB Bus Error Response Type */
#define BITM_SUBSYS_SRAMECCCON_BUSERRTYPE                     (0X00000018U)  /* ECC AHB Bus Error Response Type */
#define BITP_SUBSYS_SRAMECCCON_INTERRTYPE                     (5U)           /* ECC Interrupt Error Response Type */
#define BITL_SUBSYS_SRAMECCCON_INTERRTYPE                     (2U)           /* ECC Interrupt Error Response Type */
#define BITM_SUBSYS_SRAMECCCON_INTERRTYPE                     (0X00000060U)  /* ECC Interrupt Error Response Type */
#define BITP_SUBSYS_SRAMECCCON_RECERRTYPE                     (7U)           /* ECC Error Address and Data Record Type */
#define BITL_SUBSYS_SRAMECCCON_RECERRTYPE                     (2U)           /* ECC Error Address and Data Record Type */
#define BITM_SUBSYS_SRAMECCCON_RECERRTYPE                     (0X00000180U)  /* ECC Error Address and Data Record Type */

#define ENUM_SUBSYS_SRAMECCCON_RECERRTYPE_CURERR              (0X00000000U)  /* Return Current Error Address and Data Information */
#define ENUM_SUBSYS_SRAMECCCON_RECERRTYPE_STRERR0             (0X00000001U)  /* Return Stored Error Address and Data Information */
#define ENUM_SUBSYS_SRAMECCCON_INTERRTYPE_NOERR               (0X00000000U)  /* No Error Report */
#define ENUM_SUBSYS_SRAMECCCON_INTERRTYPE_ERR2B               (0X00000001U)  /* 2 Bits Error Report */
#define ENUM_SUBSYS_SRAMECCCON_INTERRTYPE_ERR1B               (0X00000002U)  /* 1 Bit Error Report */
#define ENUM_SUBSYS_SRAMECCCON_INTERRTYPE_ALERR               (0X00000003U)  /* 1 or 2 Bits Error Report */
#define ENUM_SUBSYS_SRAMECCCON_BUSERRTYPE_NOERR               (0X00000000U)  /* No Error Report */
#define ENUM_SUBSYS_SRAMECCCON_BUSERRTYPE_ERR2B               (0X00000001U)  /* 2 Bits Error Report */
#define ENUM_SUBSYS_SRAMECCCON_BUSERRTYPE_ERR1B               (0X00000002U)  /* 1 Bit Error Report */
#define ENUM_SUBSYS_SRAMECCCON_BUSERRTYPE_ALERR               (0X00000003U)  /* 1 or 2 Bits Error Report */
#define ENUM_SUBSYS_SRAMECCCON_EN_EN0                         (0X00000001U)  /* SRAM0 ECC Enable */
#define ENUM_SUBSYS_SRAMECCCON_EN_EN1                         (0X00000002U)  /* SRAM1 ECC Enable */
#define ENUM_SUBSYS_SRAMECCCON_EN_EN2                         (0X00000004U)  /* SRAM2 ECC Enable */
#define ENUM_SUBSYS_SRAMECCCON_EN_EN01                        (0X00000003U)  /* SRAM0 and SRAM1 ECC Enable */
#define ENUM_SUBSYS_SRAMECCCON_EN_EN02                        (0X00000005U)  /* SRAM0 and SRAM2 ECC Enable */
#define ENUM_SUBSYS_SRAMECCCON_EN_EN12                        (0X00000006U)  /* SRAM1 and SRAM2 ECC Enable */
#define ENUM_SUBSYS_SRAMECCCON_EN_EN012                       (0X00000007U)  /* SRAM0 and SRAM1 and SRAM2 ECC Enable */
#define ENUM_SUBSYS_SRAMECCCON_EN_ENNA                        (0X00000000U)  /* None SRAM ECC Enable */

/* ----------------------------------------------------------------------------------------------------
          SRAMECCSTA                                            Value             Description
   ---------------------------------------------------------------------------------------------------- */
#define BITP_SUBSYS_SRAMECCSTA_S0ERR2B                        (0U)           /* SRAM0 ECC 2 Bits Error */
#define BITL_SUBSYS_SRAMECCSTA_S0ERR2B                        (1U)           /* SRAM0 ECC 2 Bits Error */
#define BITM_SUBSYS_SRAMECCSTA_S0ERR2B                        (0X00000001U)  /* SRAM0 ECC 2 Bits Error */
#define BITP_SUBSYS_SRAMECCSTA_S0ERR1B                        (1U)           /* SRAM0 ECC 1 Bit Error */
#define BITL_SUBSYS_SRAMECCSTA_S0ERR1B                        (1U)           /* SRAM0 ECC 1 Bit Error */
#define BITM_SUBSYS_SRAMECCSTA_S0ERR1B                        (0X00000002U)  /* SRAM0 ECC 1 Bit Error */
#define BITP_SUBSYS_SRAMECCSTA_S1ERR2B                        (2U)           /* SRAM1 ECC 2 Bits Error */
#define BITL_SUBSYS_SRAMECCSTA_S1ERR2B                        (1U)           /* SRAM1 ECC 2 Bits Error */
#define BITM_SUBSYS_SRAMECCSTA_S1ERR2B                        (0X00000004U)  /* SRAM1 ECC 2 Bits Error */
#define BITP_SUBSYS_SRAMECCSTA_S1ERR1B                        (3U)           /* SRAM1 ECC 1 Bit Error */
#define BITL_SUBSYS_SRAMECCSTA_S1ERR1B                        (1U)           /* SRAM1 ECC 1 Bit Error */
#define BITM_SUBSYS_SRAMECCSTA_S1ERR1B                        (0X00000008U)  /* SRAM1 ECC 1 Bit Error */
#define BITP_SUBSYS_SRAMECCSTA_S2ERR2B                        (4U)           /* SRAM2 ECC 2 Bits Error */
#define BITL_SUBSYS_SRAMECCSTA_S2ERR2B                        (1U)           /* SRAM2 ECC 2 Bits Error */
#define BITM_SUBSYS_SRAMECCSTA_S2ERR2B                        (0X00000010U)  /* SRAM2 ECC 2 Bits Error */
#define BITP_SUBSYS_SRAMECCSTA_S2ERR1B                        (5U)           /* SRAM2 ECC 1 Bits Error */
#define BITL_SUBSYS_SRAMECCSTA_S2ERR1B                        (1U)           /* SRAM2 ECC 1 Bits Error */
#define BITM_SUBSYS_SRAMECCSTA_S2ERR1B                        (0X00000020U)  /* SRAM2 ECC 1 Bits Error */
#define BITP_SUBSYS_SRAMECCSTA_ERRCNT                         (8U)           /* ECC Error Counter */
#define BITL_SUBSYS_SRAMECCSTA_ERRCNT                         (3U)           /* ECC Error Counter */
#define BITM_SUBSYS_SRAMECCSTA_ERRCNT                         (0X00000700U)  /* ECC Error Counter */

