ChibiOS/ChibiOS/os/common/ext/ADI/ADUCM41x/ADuCM410.h
/* ----------------------------------------------------------------------------------------------------
          SRAMECCA0                                             Value             Description
   ---------------------------------------------------------------------------------------------------- */
#define BITP_SUBSYS_SRAMECCA0_ADDR                            (0U)           /* ECC Error Address */
#define BITL_SUBSYS_SRAMECCA0_ADDR                            (32U)          /* ECC Error Address */
#define BITM_SUBSYS_SRAMECCA0_ADDR                            (0XFFFFFFFFU)  /* ECC Error Address */

/* ----------------------------------------------------------------------------------------------------
          SRAMECCD0                                             Value             Description
   ---------------------------------------------------------------------------------------------------- */
#define BITP_SUBSYS_SRAMECCD0_DATA                            (0U)           /* ECC Error Raw Data */
#define BITL_SUBSYS_SRAMECCD0_DATA                            (32U)          /* ECC Error Raw Data */
#define BITM_SUBSYS_SRAMECCD0_DATA                            (0XFFFFFFFFU)  /* ECC Error Raw Data */

/* ----------------------------------------------------------------------------------------------------
          SRAMECCP0                                             Value             Description
   ---------------------------------------------------------------------------------------------------- */
#define BITP_SUBSYS_SRAMECCP0_PARITY                          (0U)           /* ECC Error Raw Parity */
#define BITL_SUBSYS_SRAMECCP0_PARITY                          (7U)           /* ECC Error Raw Parity */
#define BITM_SUBSYS_SRAMECCP0_PARITY                          (0X0000007FU)  /* ECC Error Raw Parity */

/* ----------------------------------------------------------------------------------------------------
          SRAMECCA1                                             Value             Description
   ---------------------------------------------------------------------------------------------------- */
#define BITP_SUBSYS_SRAMECCA1_ADDR                            (0U)           /* ECC Error Address */
#define BITL_SUBSYS_SRAMECCA1_ADDR                            (32U)          /* ECC Error Address */
#define BITM_SUBSYS_SRAMECCA1_ADDR                            (0XFFFFFFFFU)  /* ECC Error Address */

/* ----------------------------------------------------------------------------------------------------
          SRAMECCD1                                             Value             Description
   ---------------------------------------------------------------------------------------------------- */
#define BITP_SUBSYS_SRAMECCD1_DATA                            (0U)           /* ECC Error Raw Data */
#define BITL_SUBSYS_SRAMECCD1_DATA                            (32U)          /* ECC Error Raw Data */
#define BITM_SUBSYS_SRAMECCD1_DATA                            (0XFFFFFFFFU)  /* ECC Error Raw Data */

/* ----------------------------------------------------------------------------------------------------
          SRAMECCP1                                             Value             Description
   ---------------------------------------------------------------------------------------------------- */
#define BITP_SUBSYS_SRAMECCP1_PARITY                          (0U)           /* ECC Error Raw Parity */
#define BITL_SUBSYS_SRAMECCP1_PARITY                          (7U)           /* ECC Error Raw Parity */
#define BITM_SUBSYS_SRAMECCP1_PARITY                          (0X0000007FU)  /* ECC Error Raw Parity */

/* ----------------------------------------------------------------------------------------------------
          SRAMECCA2                                             Value             Description
   ---------------------------------------------------------------------------------------------------- */
#define BITP_SUBSYS_SRAMECCA2_ADDR                            (0U)           /* ECC Error Address */
#define BITL_SUBSYS_SRAMECCA2_ADDR                            (32U)          /* ECC Error Address */
#define BITM_SUBSYS_SRAMECCA2_ADDR                            (0XFFFFFFFFU)  /* ECC Error Address */

/* ----------------------------------------------------------------------------------------------------
          SRAMECCD2                                             Value             Description
   ---------------------------------------------------------------------------------------------------- */
#define BITP_SUBSYS_SRAMECCD2_DATA                            (0U)           /* ECC Error Raw Data */
#define BITL_SUBSYS_SRAMECCD2_DATA                            (32U)          /* ECC Error Raw Data */
#define BITM_SUBSYS_SRAMECCD2_DATA                            (0XFFFFFFFFU)  /* ECC Error Raw Data */

/* ----------------------------------------------------------------------------------------------------
          SRAMECCP2                                             Value             Description
   ---------------------------------------------------------------------------------------------------- */
#define BITP_SUBSYS_SRAMECCP2_PARITY                          (0U)           /* ECC Error Raw Parity */
#define BITL_SUBSYS_SRAMECCP2_PARITY                          (7U)           /* ECC Error Raw Parity */
#define BITM_SUBSYS_SRAMECCP2_PARITY                          (0X0000007FU)  /* ECC Error Raw Parity */

#endif  /* end ifndef SUBSYS_ADDR_RDEF_H_ */


#ifndef CRC_ADDR_RDEF_H_
#define CRC_ADDR_RDEF_H_    /* CRC: CRC Accelerator */

/* ====================================================================================================
        CRC Module Instances Address and Mask Definitions
   ==================================================================================================== */
#define INST_CRC                                                 (0X40066000U)    /* crc: */

