ChibiOS/ChibiOS/os/common/ext/ADI/ADUCM41x/ADuCM410.h
#define MASK_CRC                                                 (0X000000FFU)    /* CRC: CRC Accelerator */

/* ====================================================================================================
        CRC Module Register Address Offset Definitions
   ==================================================================================================== */
#define IDX_CRC_CTL                                             (0X00U)    /* CRC Control Register */
#define IDX_CRC_IPDATA                                          (0X04U)    /* Input Data Word Register */
#define IDX_CRC_RESULT                                          (0X08U)    /* CRC Result Register */
#define IDX_CRC_POLY                                            (0X0CU)    /* Programmable CRC Polynomial */

/* ====================================================================================================
        CRC Module Register ResetValue Definitions
   ==================================================================================================== */
#define RSTVAL_CRC_CTL                                             (0X10000000) 
#define RSTVAL_CRC_IPDATA                                          (0X0) 
#define RSTVAL_CRC_RESULT                                          (0X0) 
#define RSTVAL_CRC_POLY                                            (0X4C11DB7) 

/* ====================================================================================================
        CRC Module Register BitPositions, Lengths, Masks and Enumerations Definitions
   ==================================================================================================== */

/* ----------------------------------------------------------------------------------------------------
          CTL                                                   Value             Description
   ---------------------------------------------------------------------------------------------------- */
#define BITP_CRC_CTL_EN                                       (0U)           /* CRC Peripheral Enable */
#define BITL_CRC_CTL_EN                                       (1U)           /* CRC Peripheral Enable */
#define BITM_CRC_CTL_EN                                       (0X00000001U)  /* CRC Peripheral Enable */
#define BITP_CRC_CTL_LSBFIRST                                 (1U)           /* LSB First Calculation Order */
#define BITL_CRC_CTL_LSBFIRST                                 (1U)           /* LSB First Calculation Order */
#define BITM_CRC_CTL_LSBFIRST                                 (0X00000002U)  /* LSB First Calculation Order */
#define BITP_CRC_CTL_BITMIRR                                  (2U)           /* Bit Mirroring */
#define BITL_CRC_CTL_BITMIRR                                  (1U)           /* Bit Mirroring */
#define BITM_CRC_CTL_BITMIRR                                  (0X00000004U)  /* Bit Mirroring */
#define BITP_CRC_CTL_BYTMIRR                                  (3U)           /* Byte Mirroring */
#define BITL_CRC_CTL_BYTMIRR                                  (1U)           /* Byte Mirroring */
#define BITM_CRC_CTL_BYTMIRR                                  (0X00000008U)  /* Byte Mirroring */
#define BITP_CRC_CTL_W16SWP                                   (4U)           /* Word16 Swap */
#define BITL_CRC_CTL_W16SWP                                   (1U)           /* Word16 Swap */
#define BITM_CRC_CTL_W16SWP                                   (0X00000010U)  /* Word16 Swap */
#define BITP_CRC_CTL_REVID                                    (28U)          /* Revision ID */
#define BITL_CRC_CTL_REVID                                    (4U)           /* Revision ID */
#define BITM_CRC_CTL_REVID                                    (0XF0000000U)  /* Revision ID */

/* ----------------------------------------------------------------------------------------------------
          IPDATA                                                Value             Description
   ---------------------------------------------------------------------------------------------------- */
#define BITP_CRC_IPDATA_DATA_WORD                             (0U)           /* Data Input. */
#define BITL_CRC_IPDATA_DATA_WORD                             (32U)          /* Data Input. */
#define BITM_CRC_IPDATA_DATA_WORD                             (0XFFFFFFFFU)  /* Data Input. */

/* ----------------------------------------------------------------------------------------------------
          RESULT                                                Value             Description
   ---------------------------------------------------------------------------------------------------- */
#define BITP_CRC_RESULT_RESIDUE                               (0U)           /* CRC Residue */
#define BITL_CRC_RESULT_RESIDUE                               (32U)          /* CRC Residue */
#define BITM_CRC_RESULT_RESIDUE                               (0XFFFFFFFFU)  /* CRC Residue */

/* ----------------------------------------------------------------------------------------------------
          POLY                                                  Value             Description
   ---------------------------------------------------------------------------------------------------- */
#define BITP_CRC_POLY_REDUCTION_POLY                          (0U)           /* CRC Reduction Polynomial */
#define BITL_CRC_POLY_REDUCTION_POLY                          (32U)          /* CRC Reduction Polynomial */
#define BITM_CRC_POLY_REDUCTION_POLY                          (0XFFFFFFFFU)  /* CRC Reduction Polynomial */

#endif  /* end ifndef CRC_ADDR_RDEF_H_ */


#ifndef ADC_ADDR_RDEF_H_
#define ADC_ADDR_RDEF_H_    /* ADC: Your module description, here. */

/* ====================================================================================================
        ADC Module Instances Address and Mask Definitions
   ==================================================================================================== */
#define INST_ADC                                                 (0X40068000U)    /* adc: */

