ChibiOS/ChibiOS/os/common/ext/ADI/ADUCM41x/ADuCM410.h
/* ====================================================================================================
        ADC Module Register ResetValue Definitions
   ==================================================================================================== */
#define RSTVAL_ADC_ADCDAT0                                         (0X0) 
#define RSTVAL_ADC_ADCDAT1                                         (0X0) 
#define RSTVAL_ADC_ADCDAT2                                         (0X0) 
#define RSTVAL_ADC_ADCDAT3                                         (0X0) 
#define RSTVAL_ADC_ADCDAT4                                         (0X0) 
#define RSTVAL_ADC_ADCDAT5                                         (0X0) 
#define RSTVAL_ADC_ADCDAT6                                         (0X0) 
#define RSTVAL_ADC_ADCDAT7                                         (0X0) 
#define RSTVAL_ADC_ADCDAT8                                         (0X0) 
#define RSTVAL_ADC_ADCDAT9                                         (0X0) 
#define RSTVAL_ADC_ADCDAT10                                        (0X0) 
#define RSTVAL_ADC_ADCDAT11                                        (0X0) 
#define RSTVAL_ADC_ADCDAT12                                        (0X0) 
#define RSTVAL_ADC_ADCDAT13                                        (0X0) 
#define RSTVAL_ADC_ADCDAT14                                        (0X0) 
#define RSTVAL_ADC_ADCDAT15                                        (0X0) 
#define RSTVAL_ADC_ADCDAT16                                        (0X0) 
#define RSTVAL_ADC_ADCDAT17                                        (0X0) 
#define RSTVAL_ADC_ADCDAT18                                        (0X0) 
#define RSTVAL_ADC_ADCDAT19                                        (0X0) 
#define RSTVAL_ADC_ADCDAT20                                        (0X0) 
#define RSTVAL_ADC_ADCDAT21                                        (0X0) 
#define RSTVAL_ADC_ADCDAT22                                        (0X0) 
#define RSTVAL_ADC_ADCDAT23                                        (0X0) 
#define RSTVAL_ADC_ADCDAT24                                        (0X0) 
#define RSTVAL_ADC_ADCDAT25                                        (0X0) 
#define RSTVAL_ADC_ADCDAT26                                        (0X0) 
#define RSTVAL_ADC_ADCDAT27                                        (0X0) 
#define RSTVAL_ADC_ADCDAT28                                        (0X0) 
#define RSTVAL_ADC_ADCDAT29                                        (0X0) 
#define RSTVAL_ADC_ADCCON                                          (0X200) 
#define RSTVAL_ADC_PREBUFCON                                       (0X3) 
#define RSTVAL_ADC_ADCCNVC                                         (0X10) 
#define RSTVAL_ADC_ADCCNVCSLOW                                     (0X140) 
#define RSTVAL_ADC_ADCCHA                                          (0X0) 
#define RSTVAL_ADC_ADCIRQSTAT                                      (0X0) 
#define RSTVAL_ADC_ADCSEQ                                          (0X0) 
#define RSTVAL_ADC_ADCSEQC                                         (0X0) 
#define RSTVAL_ADC_ADCSEQS                                         (0X0) 
#define RSTVAL_ADC_ADCSEQCH                                        (0X0) 
#define RSTVAL_ADC_ADCSEQCHMUX0                                    (0X0) 
#define RSTVAL_ADC_ADCSEQCHMUX1                                    (0X0) 
#define RSTVAL_ADC_ADCCMP                                          (0X40000) 
#define RSTVAL_ADC_ADCCMPIRQSTAT                                   (0X0) 
#define RSTVAL_ADC_ADCOFGNDIFF                                     (0X4000) 
#define RSTVAL_ADC_ADCOFTEMP                                       (0X0) 
#define RSTVAL_ADC_ADCGNTEMP                                       (0X80000) 
#define RSTVAL_ADC_ADCOFGNPGA0                                     (0X4000) 
#define RSTVAL_ADC_ADCOFGNPGA1                                     (0X4000) 
#define RSTVAL_ADC_ADCOFGNPGA2                                     (0X4000) 
#define RSTVAL_ADC_ADCOFGNPGA3                                     (0X4000) 
#define RSTVAL_ADC_ADCOFGNPGA0TIA                                  (0X4000) 
#define RSTVAL_ADC_ADCOFGNPGA1TIA                                  (0X4000) 
#define RSTVAL_ADC_ADCOFGNPGA2TIA                                  (0X4000) 
#define RSTVAL_ADC_ADCOFGNPGA3TIA                                  (0X4000) 
#define RSTVAL_ADC_ADCCMP1                                         (0X40000) 
#define RSTVAL_ADC_ADCCMP2                                         (0X40000) 
#define RSTVAL_ADC_ADCCMP3                                         (0X40000) 

/* ====================================================================================================
        ADC Module Register BitPositions, Lengths, Masks and Enumerations Definitions
   ==================================================================================================== */

/* ----------------------------------------------------------------------------------------------------
          ADCDAT0                                               Value             Description
   ---------------------------------------------------------------------------------------------------- */
#define BITP_ADC_ADCDAT_N__OVF                                (0U)           /* Overflow Flag */
#define BITL_ADC_ADCDAT_N__OVF                                (1U)           /* Overflow Flag */
#define BITM_ADC_ADCDAT_N__OVF                                (0X00000001U)  /* Overflow Flag */
#define BITP_ADC_ADCDAT_N__UVF                                (1U)           /* Underflow Flag */
#define BITL_ADC_ADCDAT_N__UVF                                (1U)           /* Underflow Flag */
#define BITM_ADC_ADCDAT_N__UVF                                (0X00000002U)  /* Underflow Flag */
#define BITP_ADC_ADCDAT_N__RDY                                (2U)           /* Data Read Flag */
#define BITL_ADC_ADCDAT_N__RDY                                (1U)           /* Data Read Flag */
#define BITM_ADC_ADCDAT_N__RDY                                (0X00000004U)  /* Data Read Flag */
#define BITP_ADC_ADCDAT_N__DAT                                (4U)           /* ADCx Data */
#define BITL_ADC_ADCDAT_N__DAT                                (16U)          /* ADCx Data */
#define BITM_ADC_ADCDAT_N__DAT                                (0X000FFFF0U)  /* ADCx Data */

#define ENUM_ADC_ADCDAT_N__RDY_NORDY                          (0X00000000U)  /* Data is Not Ready or Has Been Read Out */
#define ENUM_ADC_ADCDAT_N__RDY_RDY                            (0X00000001U)  /* Data is Ready to Be Read */
#define ENUM_ADC_ADCDAT_N__UVF_NUNF                           (0X00000000U)  /* Not Underflow */
#define ENUM_ADC_ADCDAT_N__UVF_UNF                            (0X00000001U)  /* Underflow */
#define ENUM_ADC_ADCDAT_N__OVF_NOVF                           (0X00000000U)  /* Not Overflow */
#define ENUM_ADC_ADCDAT_N__OVF_OVF                            (0X00000001U)  /* Overflow */

