ChibiOS/ChibiOS/os/common/ext/ADI/ADUCM41x/ADuCM410.h
/* ----------------------------------------------------------------------------------------------------
          ADCCON                                                Value             Description
   ---------------------------------------------------------------------------------------------------- */
#define BITP_ADC_ADCCON_CONVTYPE                              (0U)           /* ADC Conversion Type Selection */
#define BITL_ADC_ADCCON_CONVTYPE                              (3U)           /* ADC Conversion Type Selection */
#define BITM_ADC_ADCCON_CONVTYPE                              (0X00000007U)  /* ADC Conversion Type Selection */
#define BITP_ADC_ADCCON_CNVDMA                                (3U)           /* DMA Request Enable for ADC Non-sequence Conversion */
#define BITL_ADC_ADCCON_CNVDMA                                (1U)           /* DMA Request Enable for ADC Non-sequence Conversion */
#define BITM_ADC_ADCCON_CNVDMA                                (0X00000008U)  /* DMA Request Enable for ADC Non-sequence Conversion */
#define BITP_ADC_ADCCON_SEQDMA                                (4U)           /* DMA Request Enable for ADC Sequence Conversion */
#define BITL_ADC_ADCCON_SEQDMA                                (1U)           /* DMA Request Enable for ADC Sequence Conversion */
#define BITM_ADC_ADCCON_SEQDMA                                (0X00000010U)  /* DMA Request Enable for ADC Sequence Conversion */
#define BITP_ADC_ADCCON_PINMOD                                (5U)           /* PIN Conversion Mode Selection */
#define BITL_ADC_ADCCON_PINMOD                                (1U)           /* PIN Conversion Mode Selection */
#define BITM_ADC_ADCCON_PINMOD                                (0X00000020U)  /* PIN Conversion Mode Selection */
#define BITP_ADC_ADCCON_RESTARTADC                            (6U)           /* Restart ADC, Reset Analog Part of ADC */
#define BITL_ADC_ADCCON_RESTARTADC                            (1U)           /* Restart ADC, Reset Analog Part of ADC */
#define BITM_ADC_ADCCON_RESTARTADC                            (0X00000040U)  /* Restart ADC, Reset Analog Part of ADC */
#define BITP_ADC_ADCCON_PDREFBUF                              (7U)           /* ADC Refbuf Power Down */
#define BITL_ADC_ADCCON_PDREFBUF                              (1U)           /* ADC Refbuf Power Down */
#define BITM_ADC_ADCCON_PDREFBUF                              (0X00000080U)  /* ADC Refbuf Power Down */
#define BITP_ADC_ADCCON_VDDSEL                                (8U)           /* Select Whether Channel 29 is DVDD Channel or AVDD Channel */
#define BITL_ADC_ADCCON_VDDSEL                                (1U)           /* Select Whether Channel 29 is DVDD Channel or AVDD Channel */
#define BITM_ADC_ADCCON_VDDSEL                                (0X00000100U)  /* Select Whether Channel 29 is DVDD Channel or AVDD Channel */
#define BITP_ADC_ADCCON_PDADC                                 (9U)           /* ADC Power Down */
#define BITL_ADC_ADCCON_PDADC                                 (1U)           /* ADC Power Down */
#define BITM_ADC_ADCCON_PDADC                                 (0X00000200U)  /* ADC Power Down */
#define BITP_ADC_ADCCON_OSR                                   (10U)          /* Oversampling Ratio */
#define BITL_ADC_ADCCON_OSR                                   (3U)           /* Oversampling Ratio */
#define BITM_ADC_ADCCON_OSR                                   (0X00001C00U)  /* Oversampling Ratio */
#define BITP_ADC_ADCCON_CNVIRQEN                              (14U)          /* Enable Conversion Interrupt Generation */
#define BITL_ADC_ADCCON_CNVIRQEN                              (1U)           /* Enable Conversion Interrupt Generation */
#define BITM_ADC_ADCCON_CNVIRQEN                              (0X00004000U)  /* Enable Conversion Interrupt Generation */
#define BITP_ADC_ADCCON_GPTEVENTEN                            (15U)          /* Enable GPT Event to Trigger Conversion */
#define BITL_ADC_ADCCON_GPTEVENTEN                            (5U)           /* Enable GPT Event to Trigger Conversion */
#define BITM_ADC_ADCCON_GPTEVENTEN                            (0X000F8000U)  /* Enable GPT Event to Trigger Conversion */
#define BITP_ADC_ADCCON_GPTTRIGMD                             (20U)          /* Mux Select GP Timer Trigger Mode */
#define BITL_ADC_ADCCON_GPTTRIGMD                             (1U)           /* Mux Select GP Timer Trigger Mode */
#define BITM_ADC_ADCCON_GPTTRIGMD                             (0X00100000U)  /* Mux Select GP Timer Trigger Mode */

#define ENUM_ADC_ADCCON_GPTTRIGMD_MD0                         (0X00000000U)  /* Two Timeout Events Trigger One Conversion */
#define ENUM_ADC_ADCCON_GPTTRIGMD_MD1                         (0X00000001U)  /* One Timeout Events Trigger One Conversion */
#define ENUM_ADC_ADCCON_OSR_OSR_NS1                           (0X00000000U)  /* Oversampling Disable */
#define ENUM_ADC_ADCCON_OSR_OSR2                              (0X00000001U)  /* Oversampling X2 */
#define ENUM_ADC_ADCCON_OSR_OSR4                              (0X00000002U)  /* Oversampling X4 */
#define ENUM_ADC_ADCCON_OSR_OSR8                              (0X00000003U)  /* Oversampling X8 */
#define ENUM_ADC_ADCCON_OSR_OSR16                             (0X00000004U)  /* Oversampling X16 */
#define ENUM_ADC_ADCCON_OSR_OSR_NS32                          (0X00000005U)  /* Oversampling X32 */
#define ENUM_ADC_ADCCON_OSR_OSR_NS64                          (0X00000006U)  /* Oversampling Disable */
#define ENUM_ADC_ADCCON_OSR_OSR_NS128                         (0X00000007U)  /* Oversampling Disable */
#define ENUM_ADC_ADCCON_PDADC_ADCPU                           (0X00000000U)  /* Not Power Down ADC */
#define ENUM_ADC_ADCCON_PDADC_ADCPD                           (0X00000001U)  /* Power Down ADC */
#define ENUM_ADC_ADCCON_VDDSEL_DVDD                           (0X00000000U)  /* Channel 29 is Half of DVDD Channel */
#define ENUM_ADC_ADCCON_VDDSEL_AVSS                           (0X00000001U)  /* Channel 29 is AVSS Channel */
#define ENUM_ADC_ADCCON_PDREFBUF_REFBUFPU                     (0X00000000U)  /* Normal Mode */
#define ENUM_ADC_ADCCON_PDREFBUF_REFBUFPD                     (0X00000001U)  /* Power Down Reference Mode */
#define ENUM_ADC_ADCCON_RESTARTADC_ADCPU                      (0X00000000U)  /* Not Power Down ADC */
#define ENUM_ADC_ADCCON_RESTARTADC_ADCPD                      (0X00000001U)  /* Power Down ADC */
#define ENUM_ADC_ADCCON_PINMOD_PIN_LVL                        (0X00000000U)  /* CNV is Controlled by PIN Level */
#define ENUM_ADC_ADCCON_PINMOD_PIN_EDGE                       (0X00000001U)  /* CNV is Controlled by PIN Edge */
#define ENUM_ADC_ADCCON_CONVTYPE_IDLE                         (0X00000000U)  /* No Conversion */
#define ENUM_ADC_ADCCON_CONVTYPE_GPIO                         (0X00000001U)  /* ADC Controlled by GPIO Pin */
#define ENUM_ADC_ADCCON_CONVTYPE_SINGL                        (0X00000002U)  /* Software Single Conversion */
#define ENUM_ADC_ADCCON_CONVTYPE_CONT                         (0X00000003U)  /* Software Continue Conversion */
#define ENUM_ADC_ADCCON_CONVTYPE_PLA                          (0X00000004U)  /* PLA Conversion */
#define ENUM_ADC_ADCCON_CONVTYPE_GPT                          (0X00000005U)  /* GPT Triggered Conversion */

