ChibiOS/ChibiOS/os/common/ext/ADI/ADUCM41x/ADuCM410.h
/* ----------------------------------------------------------------------------------------------------
          ADCIRQSTAT                                            Value             Description
   ---------------------------------------------------------------------------------------------------- */
#define BITP_ADC_ADCIRQSTAT_CNVIRQSTAT                        (0U)           /* Single Conversion IRQ Status */
#define BITL_ADC_ADCIRQSTAT_CNVIRQSTAT                        (1U)           /* Single Conversion IRQ Status */
#define BITM_ADC_ADCIRQSTAT_CNVIRQSTAT                        (0X00000001U)  /* Single Conversion IRQ Status */
#define BITP_ADC_ADCIRQSTAT_SEQIRQSTAT                        (1U)           /* Sequence Conversion IRQ Status */
#define BITL_ADC_ADCIRQSTAT_SEQIRQSTAT                        (1U)           /* Sequence Conversion IRQ Status */
#define BITM_ADC_ADCIRQSTAT_SEQIRQSTAT                        (0X00000002U)  /* Sequence Conversion IRQ Status */

#define ENUM_ADC_ADCIRQSTAT_SEQIRQSTAT_IRQCLR                 (0X00000000U)  /* Interrupt Clear */
#define ENUM_ADC_ADCIRQSTAT_SEQIRQSTAT_IRQSET                 (0X00000001U)  /* Interrupt Set */
#define ENUM_ADC_ADCIRQSTAT_CNVIRQSTAT_IRQCLR                 (0X00000000U)  /* Interrupt Clear */
#define ENUM_ADC_ADCIRQSTAT_CNVIRQSTAT_IRQSET                 (0X00000001U)  /* Interrupt Set */

/* ----------------------------------------------------------------------------------------------------
          ADCSEQ                                                Value             Description
   ---------------------------------------------------------------------------------------------------- */
#define BITP_ADC_ADCSEQ_SEQEN                                 (0U)           /* Sequence Enable */
#define BITL_ADC_ADCSEQ_SEQEN                                 (1U)           /* Sequence Enable */
#define BITM_ADC_ADCSEQ_SEQEN                                 (0X00000001U)  /* Sequence Enable */
#define BITP_ADC_ADCSEQ_SEQREN                                (1U)           /* Sequence Restart */
#define BITL_ADC_ADCSEQ_SEQREN                                (1U)           /* Sequence Restart */
#define BITM_ADC_ADCSEQ_SEQREN                                (0X00000002U)  /* Sequence Restart */
#define BITP_ADC_ADCSEQ_SEQSTL                                (2U)           /* Sequence Stall */
#define BITL_ADC_ADCSEQ_SEQSTL                                (1U)           /* Sequence Stall */
#define BITM_ADC_ADCSEQ_SEQSTL                                (0X00000004U)  /* Sequence Stall */
#define BITP_ADC_ADCSEQ_SEQIRQEN                              (3U)           /* Enable Sequencer Interrupt Generation */
#define BITL_ADC_ADCSEQ_SEQIRQEN                              (1U)           /* Enable Sequencer Interrupt Generation */
#define BITM_ADC_ADCSEQ_SEQIRQEN                              (0X00000008U)  /* Enable Sequencer Interrupt Generation */

#define ENUM_ADC_ADCSEQ_SEQSTL_SEQNSTALL                      (0X00000000U)  /* Running Sequence */
#define ENUM_ADC_ADCSEQ_SEQSTL_SEQSTALL                       (0X00000001U)  /* Stalling Sequence */

/* ----------------------------------------------------------------------------------------------------
          ADCSEQC                                               Value             Description
   ---------------------------------------------------------------------------------------------------- */
#define BITP_ADC_ADCSEQC_SEQT                                 (0U)           /* Repeat Sequence Interval */
#define BITL_ADC_ADCSEQC_SEQT                                 (8U)           /* Repeat Sequence Interval */
#define BITM_ADC_ADCSEQC_SEQT                                 (0X000000FFU)  /* Repeat Sequence Interval */

/* ----------------------------------------------------------------------------------------------------
          ADCSEQS                                               Value             Description
   ---------------------------------------------------------------------------------------------------- */
#define BITP_ADC_ADCSEQS_CNVSTAT                              (0U)           /* ADC Conversion Idle/Busy Flag */
#define BITL_ADC_ADCSEQS_CNVSTAT                              (1U)           /* ADC Conversion Idle/Busy Flag */
#define BITM_ADC_ADCSEQS_CNVSTAT                              (0X00000001U)  /* ADC Conversion Idle/Busy Flag */
#define BITP_ADC_ADCSEQS_SEQSTLSTAT                           (1U)           /* Stall Sequencer Status */
#define BITL_ADC_ADCSEQS_SEQSTLSTAT                           (1U)           /* Stall Sequencer Status */
#define BITM_ADC_ADCSEQS_SEQSTLSTAT                           (0X00000002U)  /* Stall Sequencer Status */
#define BITP_ADC_ADCSEQS_SEQSTAT                              (2U)           /* Sequencer Status */
#define BITL_ADC_ADCSEQS_SEQSTAT                              (1U)           /* Sequencer Status */
#define BITM_ADC_ADCSEQS_SEQSTAT                              (0X00000004U)  /* Sequencer Status */

#define ENUM_ADC_ADCSEQS_SEQSTAT_SEQBUSY                      (0X00000001U)  /* Sequence is Busy */
#define ENUM_ADC_ADCSEQS_SEQSTAT_SEQNBUSY                     (0X00000000U)  /* Sequence is Idle */
#define ENUM_ADC_ADCSEQS_SEQSTLSTAT_SEQNSTOP                  (0X00000000U)  /* Sequence Still Run */
#define ENUM_ADC_ADCSEQS_SEQSTLSTAT_SEQSTOP                   (0X00000001U)  /* Sequence Has Stalled */
#define ENUM_ADC_ADCSEQS_CNVSTAT_CNVIDLE                      (0X00000000U)  /* ADC Conversion is Idle */
#define ENUM_ADC_ADCSEQS_CNVSTAT_CNVBUSY                      (0X00000001U)  /* ADC Conversion is Busy */

/* ----------------------------------------------------------------------------------------------------
          ADCSEQCH                                              Value             Description
   ---------------------------------------------------------------------------------------------------- */
#define BITP_ADC_ADCSEQCH_SEQCH                               (0U)           /* Sequence Channel Selection */
#define BITL_ADC_ADCSEQCH_SEQCH                               (30U)          /* Sequence Channel Selection */
#define BITM_ADC_ADCSEQCH_SEQCH                               (0X3FFFFFFFU)  /* Sequence Channel Selection */

