ChibiOS/ChibiOS/os/common/ext/ADI/ADUCM41x/ADuCM410.h
/* ----------------------------------------------------------------------------------------------------
          ADCSEQCHMUX0                                          Value             Description
   ---------------------------------------------------------------------------------------------------- */
#define BITP_ADC_ADCSEQCHMUX0_DIF0                            (0U)           /* When AIN0 is P Ch. N Ch. Mux Selection in Sequencer Mode */
#define BITL_ADC_ADCSEQCHMUX0_DIF0                            (4U)           /* When AIN0 is P Ch. N Ch. Mux Selection in Sequencer Mode */
#define BITM_ADC_ADCSEQCHMUX0_DIF0                            (0X0000000FU)  /* When AIN0 is P Ch. N Ch. Mux Selection in Sequencer Mode */
#define BITP_ADC_ADCSEQCHMUX0_DIF1                            (4U)           /* When AIN1 is N Ch. P Ch. Mux Selection in Sequencer Mode */
#define BITL_ADC_ADCSEQCHMUX0_DIF1                            (1U)           /* When AIN1 is N Ch. P Ch. Mux Selection in Sequencer Mode */
#define BITM_ADC_ADCSEQCHMUX0_DIF1                            (0X00000010U)  /* When AIN1 is N Ch. P Ch. Mux Selection in Sequencer Mode */
#define BITP_ADC_ADCSEQCHMUX0_DIF2                            (5U)           /* When AIN2 is P Ch. N Ch. Mux Selection in Sequencer Mode */
#define BITL_ADC_ADCSEQCHMUX0_DIF2                            (4U)           /* When AIN2 is P Ch. N Ch. Mux Selection in Sequencer Mode */
#define BITM_ADC_ADCSEQCHMUX0_DIF2                            (0X000001E0U)  /* When AIN2 is P Ch. N Ch. Mux Selection in Sequencer Mode */
#define BITP_ADC_ADCSEQCHMUX0_DIF3                            (9U)           /* When AIN3 is N Ch. P Ch. Mux Selection in Sequencer Mode */
#define BITL_ADC_ADCSEQCHMUX0_DIF3                            (1U)           /* When AIN3 is N Ch. P Ch. Mux Selection in Sequencer Mode */
#define BITM_ADC_ADCSEQCHMUX0_DIF3                            (0X00000200U)  /* When AIN3 is N Ch. P Ch. Mux Selection in Sequencer Mode */
#define BITP_ADC_ADCSEQCHMUX0_DIF4                            (10U)          /* When AIN4 is P Ch. N Ch. Mux Selection in Sequencer Mode */
#define BITL_ADC_ADCSEQCHMUX0_DIF4                            (4U)           /* When AIN4 is P Ch. N Ch. Mux Selection in Sequencer Mode */
#define BITM_ADC_ADCSEQCHMUX0_DIF4                            (0X00003C00U)  /* When AIN4 is P Ch. N Ch. Mux Selection in Sequencer Mode */
#define BITP_ADC_ADCSEQCHMUX0_DIF5                            (14U)          /* When AIN5 is N Ch. P Ch. Mux Selection in Sequencer Mode */
#define BITL_ADC_ADCSEQCHMUX0_DIF5                            (1U)           /* When AIN5 is N Ch. P Ch. Mux Selection in Sequencer Mode */
#define BITM_ADC_ADCSEQCHMUX0_DIF5                            (0X00004000U)  /* When AIN5 is N Ch. P Ch. Mux Selection in Sequencer Mode */
#define BITP_ADC_ADCSEQCHMUX0_DIF6                            (15U)          /* When AIN6 is P Ch. N Ch. Mux Selection in Sequencer Mode */
#define BITL_ADC_ADCSEQCHMUX0_DIF6                            (4U)           /* When AIN6 is P Ch. N Ch. Mux Selection in Sequencer Mode */
#define BITM_ADC_ADCSEQCHMUX0_DIF6                            (0X00078000U)  /* When AIN6 is P Ch. N Ch. Mux Selection in Sequencer Mode */
#define BITP_ADC_ADCSEQCHMUX0_DIF7                            (19U)          /* When AIN7 is N Ch. P Ch. Mux Selection in Sequencer Mode */
#define BITL_ADC_ADCSEQCHMUX0_DIF7                            (1U)           /* When AIN7 is N Ch. P Ch. Mux Selection in Sequencer Mode */
#define BITM_ADC_ADCSEQCHMUX0_DIF7                            (0X00080000U)  /* When AIN7 is N Ch. P Ch. Mux Selection in Sequencer Mode */
#define BITP_ADC_ADCSEQCHMUX0_DIF8                            (20U)          /* When AIN8 is P Ch. N Ch. Mux Selection in Sequencer Mode */
#define BITL_ADC_ADCSEQCHMUX0_DIF8                            (4U)           /* When AIN8 is P Ch. N Ch. Mux Selection in Sequencer Mode */
#define BITM_ADC_ADCSEQCHMUX0_DIF8                            (0X00F00000U)  /* When AIN8 is P Ch. N Ch. Mux Selection in Sequencer Mode */
#define BITP_ADC_ADCSEQCHMUX0_DIF9                            (24U)          /* When AIN9 is N Ch. P Ch. Mux Selection in Sequencer Mode */
#define BITL_ADC_ADCSEQCHMUX0_DIF9                            (1U)           /* When AIN9 is N Ch. P Ch. Mux Selection in Sequencer Mode */
#define BITM_ADC_ADCSEQCHMUX0_DIF9                            (0X01000000U)  /* When AIN9 is N Ch. P Ch. Mux Selection in Sequencer Mode */
#define BITP_ADC_ADCSEQCHMUX0_DIF10                           (25U)          /* When AIN10 is P Ch. N Ch. Mux Selection in Sequencer Mode */
#define BITL_ADC_ADCSEQCHMUX0_DIF10                           (4U)           /* When AIN10 is P Ch. N Ch. Mux Selection in Sequencer Mode */
#define BITM_ADC_ADCSEQCHMUX0_DIF10                           (0X1E000000U)  /* When AIN10 is P Ch. N Ch. Mux Selection in Sequencer Mode */
#define BITP_ADC_ADCSEQCHMUX0_DIF11                           (29U)          /* When AIN11 is N Ch. P Ch. Mux Selection in Sequencer Mode */
#define BITL_ADC_ADCSEQCHMUX0_DIF11                           (1U)           /* When AIN11 is N Ch. P Ch. Mux Selection in Sequencer Mode */
#define BITM_ADC_ADCSEQCHMUX0_DIF11                           (0X20000000U)  /* When AIN11 is N Ch. P Ch. Mux Selection in Sequencer Mode */

#define ENUM_ADC_ADCSEQCHMUX0_DIF11_REFN                      (0X00000000U)  /* No description provided */
#define ENUM_ADC_ADCSEQCHMUX0_DIF11_REFP                      (0X00000001U)  /* No description provided */
#define ENUM_ADC_ADCSEQCHMUX0_DIF10_REFN                      (0X00000000U)  /* No description provided */
#define ENUM_ADC_ADCSEQCHMUX0_DIF10_REFP                      (0X00000001U)  /* No description provided */
#define ENUM_ADC_ADCSEQCHMUX0_DIF10_AIN1                      (0X00000002U)  /* No description provided */
#define ENUM_ADC_ADCSEQCHMUX0_DIF10_AIN3                      (0X00000003U)  /* No description provided */
#define ENUM_ADC_ADCSEQCHMUX0_DIF10_AIN5                      (0X00000004U)  /* No description provided */
#define ENUM_ADC_ADCSEQCHMUX0_DIF10_AIN7                      (0X00000005U)  /* No description provided */
#define ENUM_ADC_ADCSEQCHMUX0_DIF10_AIN9                      (0X00000006U)  /* No description provided */
#define ENUM_ADC_ADCSEQCHMUX0_DIF10_AIN11                     (0X00000007U)  /* No description provided */
#define ENUM_ADC_ADCSEQCHMUX0_DIF10_AIN13                     (0X00000008U)  /* No description provided */
#define ENUM_ADC_ADCSEQCHMUX0_DIF10_AIN15                     (0X00000009U)  /* No description provided */
#define ENUM_ADC_ADCSEQCHMUX0_DIF9_REFN                       (0X00000000U)  /* No description provided */
#define ENUM_ADC_ADCSEQCHMUX0_DIF9_REFP                       (0X00000001U)  /* No description provided */
#define ENUM_ADC_ADCSEQCHMUX0_DIF8_REFN                       (0X00000000U)  /* No description provided */
#define ENUM_ADC_ADCSEQCHMUX0_DIF8_REFP                       (0X00000001U)  /* No description provided */
#define ENUM_ADC_ADCSEQCHMUX0_DIF8_AIN1                       (0X00000002U)  /* No description provided */
#define ENUM_ADC_ADCSEQCHMUX0_DIF8_AIN3                       (0X00000003U)  /* No description provided */
#define ENUM_ADC_ADCSEQCHMUX0_DIF8_AIN5                       (0X00000004U)  /* No description provided */
#define ENUM_ADC_ADCSEQCHMUX0_DIF8_AIN7                       (0X00000005U)  /* No description provided */
#define ENUM_ADC_ADCSEQCHMUX0_DIF8_AIN9                       (0X00000006U)  /* No description provided */
#define ENUM_ADC_ADCSEQCHMUX0_DIF8_AIN11                      (0X00000007U)  /* No description provided */
#define ENUM_ADC_ADCSEQCHMUX0_DIF8_AIN13                      (0X00000008U)  /* No description provided */
#define ENUM_ADC_ADCSEQCHMUX0_DIF8_AIN15                      (0X00000009U)  /* No description provided */
#define ENUM_ADC_ADCSEQCHMUX0_DIF7_REFN                       (0X00000000U)  /* No description provided */
#define ENUM_ADC_ADCSEQCHMUX0_DIF7_REFP                       (0X00000001U)  /* No description provided */
#define ENUM_ADC_ADCSEQCHMUX0_DIF6_REFN                       (0X00000000U)  /* No description provided */
#define ENUM_ADC_ADCSEQCHMUX0_DIF6_REFP                       (0X00000001U)  /* No description provided */
#define ENUM_ADC_ADCSEQCHMUX0_DIF6_AIN1                       (0X00000002U)  /* No description provided */
#define ENUM_ADC_ADCSEQCHMUX0_DIF6_AIN3                       (0X00000003U)  /* No description provided */
#define ENUM_ADC_ADCSEQCHMUX0_DIF6_AIN5                       (0X00000004U)  /* No description provided */
#define ENUM_ADC_ADCSEQCHMUX0_DIF6_AIN7                       (0X00000005U)  /* No description provided */
#define ENUM_ADC_ADCSEQCHMUX0_DIF6_AIN9                       (0X00000006U)  /* No description provided */
#define ENUM_ADC_ADCSEQCHMUX0_DIF6_AIN11                      (0X00000007U)  /* No description provided */
#define ENUM_ADC_ADCSEQCHMUX0_DIF6_AIN13                      (0X00000008U)  /* No description provided */
#define ENUM_ADC_ADCSEQCHMUX0_DIF6_AIN15                      (0X00000009U)  /* No description provided */
#define ENUM_ADC_ADCSEQCHMUX0_DIF5_REFN                       (0X00000000U)  /* No description provided */
#define ENUM_ADC_ADCSEQCHMUX0_DIF5_REFP                       (0X00000001U)  /* No description provided */
#define ENUM_ADC_ADCSEQCHMUX0_DIF4_REFN                       (0X00000000U)  /* No description provided */
#define ENUM_ADC_ADCSEQCHMUX0_DIF4_REFP                       (0X00000001U)  /* No description provided */
#define ENUM_ADC_ADCSEQCHMUX0_DIF4_AIN1                       (0X00000002U)  /* No description provided */
#define ENUM_ADC_ADCSEQCHMUX0_DIF4_AIN3                       (0X00000003U)  /* No description provided */
#define ENUM_ADC_ADCSEQCHMUX0_DIF4_AIN5                       (0X00000004U)  /* No description provided */
#define ENUM_ADC_ADCSEQCHMUX0_DIF4_AIN7                       (0X00000005U)  /* No description provided */
#define ENUM_ADC_ADCSEQCHMUX0_DIF4_AIN9                       (0X00000006U)  /* No description provided */
#define ENUM_ADC_ADCSEQCHMUX0_DIF4_AIN11                      (0X00000007U)  /* No description provided */
#define ENUM_ADC_ADCSEQCHMUX0_DIF4_AIN13                      (0X00000008U)  /* No description provided */
#define ENUM_ADC_ADCSEQCHMUX0_DIF4_AIN15                      (0X00000009U)  /* No description provided */
#define ENUM_ADC_ADCSEQCHMUX0_DIF3_REFN                       (0X00000000U)  /* No description provided */
#define ENUM_ADC_ADCSEQCHMUX0_DIF3_REFP                       (0X00000001U)  /* No description provided */
#define ENUM_ADC_ADCSEQCHMUX0_DIF2_REFN                       (0X00000000U)  /* No description provided */
#define ENUM_ADC_ADCSEQCHMUX0_DIF2_REFP                       (0X00000001U)  /* No description provided */
#define ENUM_ADC_ADCSEQCHMUX0_DIF2_AIN1                       (0X00000002U)  /* No description provided */
#define ENUM_ADC_ADCSEQCHMUX0_DIF2_AIN3                       (0X00000003U)  /* No description provided */
#define ENUM_ADC_ADCSEQCHMUX0_DIF2_AIN5                       (0X00000004U)  /* No description provided */
#define ENUM_ADC_ADCSEQCHMUX0_DIF2_AIN7                       (0X00000005U)  /* No description provided */
#define ENUM_ADC_ADCSEQCHMUX0_DIF2_AIN9                       (0X00000006U)  /* No description provided */
#define ENUM_ADC_ADCSEQCHMUX0_DIF2_AIN11                      (0X00000007U)  /* No description provided */
#define ENUM_ADC_ADCSEQCHMUX0_DIF2_AIN13                      (0X00000008U)  /* No description provided */
#define ENUM_ADC_ADCSEQCHMUX0_DIF2_AIN15                      (0X00000009U)  /* No description provided */
#define ENUM_ADC_ADCSEQCHMUX0_DIF1_REFN                       (0X00000000U)  /* No description provided */
#define ENUM_ADC_ADCSEQCHMUX0_DIF1_REFP                       (0X00000001U)  /* No description provided */
#define ENUM_ADC_ADCSEQCHMUX0_DIF0_REFN                       (0X00000000U)  /* No description provided */
#define ENUM_ADC_ADCSEQCHMUX0_DIF0_REFP                       (0X00000001U)  /* No description provided */
#define ENUM_ADC_ADCSEQCHMUX0_DIF0_AIN1                       (0X00000002U)  /* No description provided */
#define ENUM_ADC_ADCSEQCHMUX0_DIF0_AIN3                       (0X00000003U)  /* No description provided */
#define ENUM_ADC_ADCSEQCHMUX0_DIF0_AIN5                       (0X00000004U)  /* No description provided */
#define ENUM_ADC_ADCSEQCHMUX0_DIF0_AIN7                       (0X00000005U)  /* No description provided */
#define ENUM_ADC_ADCSEQCHMUX0_DIF0_AIN9                       (0X00000006U)  /* No description provided */
#define ENUM_ADC_ADCSEQCHMUX0_DIF0_AIN11                      (0X00000007U)  /* No description provided */
#define ENUM_ADC_ADCSEQCHMUX0_DIF0_AIN13                      (0X00000008U)  /* No description provided */
#define ENUM_ADC_ADCSEQCHMUX0_DIF0_AIN15                      (0X00000009U)  /* No description provided */

