ChibiOS/ChibiOS/os/common/ext/ADI/ADUCM41x/ADuCM410.h
/* ----------------------------------------------------------------------------------------------------
          ADCOFGNPGA0                                           Value             Description
   ---------------------------------------------------------------------------------------------------- */
#define BITP_ADC_ADCOFGNPGA0_GAIN                             (0U)           /* Gain Error Correction */
#define BITL_ADC_ADCOFGNPGA0_GAIN                             (15U)          /* Gain Error Correction */
#define BITM_ADC_ADCOFGNPGA0_GAIN                             (0X00007FFFU)  /* Gain Error Correction */

/* ----------------------------------------------------------------------------------------------------
          ADCOFGNPGA1                                           Value             Description
   ---------------------------------------------------------------------------------------------------- */
#define BITP_ADC_ADCOFGNPGA1_GAIN                             (0U)           /* Gain Error Correction */
#define BITL_ADC_ADCOFGNPGA1_GAIN                             (15U)          /* Gain Error Correction */
#define BITM_ADC_ADCOFGNPGA1_GAIN                             (0X00007FFFU)  /* Gain Error Correction */

/* ----------------------------------------------------------------------------------------------------
          ADCOFGNPGA2                                           Value             Description
   ---------------------------------------------------------------------------------------------------- */
#define BITP_ADC_ADCOFGNPGA2_GAIN                             (0U)           /* Gain Error Correction */
#define BITL_ADC_ADCOFGNPGA2_GAIN                             (15U)          /* Gain Error Correction */
#define BITM_ADC_ADCOFGNPGA2_GAIN                             (0X00007FFFU)  /* Gain Error Correction */

/* ----------------------------------------------------------------------------------------------------
          ADCOFGNPGA3                                           Value             Description
   ---------------------------------------------------------------------------------------------------- */
#define BITP_ADC_ADCOFGNPGA3_GAIN                             (0U)           /* Gain Error Correction */
#define BITL_ADC_ADCOFGNPGA3_GAIN                             (15U)          /* Gain Error Correction */
#define BITM_ADC_ADCOFGNPGA3_GAIN                             (0X00007FFFU)  /* Gain Error Correction */

/* ----------------------------------------------------------------------------------------------------
          ADCOFGNPGA0TIA                                        Value             Description
   ---------------------------------------------------------------------------------------------------- */
#define BITP_ADC_ADCOFGNPGA0TIA_GAIN                          (0U)           /* Gain Error Correction */
#define BITL_ADC_ADCOFGNPGA0TIA_GAIN                          (15U)          /* Gain Error Correction */
#define BITM_ADC_ADCOFGNPGA0TIA_GAIN                          (0X00007FFFU)  /* Gain Error Correction */

/* ----------------------------------------------------------------------------------------------------
          ADCOFGNPGA1TIA                                        Value             Description
   ---------------------------------------------------------------------------------------------------- */
#define BITP_ADC_ADCOFGNPGA1TIA_GAIN                          (0U)           /* Gain Error Correction */
#define BITL_ADC_ADCOFGNPGA1TIA_GAIN                          (15U)          /* Gain Error Correction */
#define BITM_ADC_ADCOFGNPGA1TIA_GAIN                          (0X00007FFFU)  /* Gain Error Correction */

/* ----------------------------------------------------------------------------------------------------
          ADCOFGNPGA2TIA                                        Value             Description
   ---------------------------------------------------------------------------------------------------- */
#define BITP_ADC_ADCOFGNPGA2TIA_GAIN                          (0U)           /* Gain Error Correction */
#define BITL_ADC_ADCOFGNPGA2TIA_GAIN                          (15U)          /* Gain Error Correction */
#define BITM_ADC_ADCOFGNPGA2TIA_GAIN                          (0X00007FFFU)  /* Gain Error Correction */

/* ----------------------------------------------------------------------------------------------------
          ADCOFGNPGA3TIA                                        Value             Description
   ---------------------------------------------------------------------------------------------------- */
#define BITP_ADC_ADCOFGNPGA3TIA_GAIN                          (0U)           /* Gain Error Correction */
#define BITL_ADC_ADCOFGNPGA3TIA_GAIN                          (15U)          /* Gain Error Correction */
#define BITM_ADC_ADCOFGNPGA3TIA_GAIN                          (0X00007FFFU)  /* Gain Error Correction */

/* ----------------------------------------------------------------------------------------------------
          ADCCMP1                                               Value             Description
   ---------------------------------------------------------------------------------------------------- */
#define BITP_ADC_ADCCMP1_EN                                   (0U)           /* Digital Comparator Enable */
#define BITL_ADC_ADCCMP1_EN                                   (1U)           /* Digital Comparator Enable */
#define BITM_ADC_ADCCMP1_EN                                   (0X00000001U)  /* Digital Comparator Enable */
#define BITP_ADC_ADCCMP1_CMPDIR                               (1U)           /* Select Digital Comparator Direction */
#define BITL_ADC_ADCCMP1_CMPDIR                               (1U)           /* Select Digital Comparator Direction */
#define BITM_ADC_ADCCMP1_CMPDIR                               (0X00000002U)  /* Select Digital Comparator Direction */
#define BITP_ADC_ADCCMP1_THR                                  (2U)           /* Compare Threshold */
#define BITL_ADC_ADCCMP1_THR                                  (16U)          /* Compare Threshold */
#define BITM_ADC_ADCCMP1_THR                                  (0X0003FFFCU)  /* Compare Threshold */
#define BITP_ADC_ADCCMP1_IRQEN                                (18U)          /* Enable IRQ Generation */
#define BITL_ADC_ADCCMP1_IRQEN                                (1U)           /* Enable IRQ Generation */
#define BITM_ADC_ADCCMP1_IRQEN                                (0X00040000U)  /* Enable IRQ Generation */
#define BITP_ADC_ADCCMP1_CH                                   (19U)          /* Channel Index for Data Comparison */
#define BITL_ADC_ADCCMP1_CH                                   (5U)           /* Channel Index for Data Comparison */
#define BITM_ADC_ADCCMP1_CH                                   (0X00F80000U)  /* Channel Index for Data Comparison */

