ChibiOS/ChibiOS/os/common/ext/ADI/ADUCM41x/ADuCM410.h
/* ----------------------------------------------------------------------------------------------------
          ADCCMP2                                               Value             Description
   ---------------------------------------------------------------------------------------------------- */
#define BITP_ADC_ADCCMP2_EN                                   (0U)           /* Digital Comparator Enable */
#define BITL_ADC_ADCCMP2_EN                                   (1U)           /* Digital Comparator Enable */
#define BITM_ADC_ADCCMP2_EN                                   (0X00000001U)  /* Digital Comparator Enable */
#define BITP_ADC_ADCCMP2_CMPDIR                               (1U)           /* Select Digital Comparator Direction */
#define BITL_ADC_ADCCMP2_CMPDIR                               (1U)           /* Select Digital Comparator Direction */
#define BITM_ADC_ADCCMP2_CMPDIR                               (0X00000002U)  /* Select Digital Comparator Direction */
#define BITP_ADC_ADCCMP2_THR                                  (2U)           /* Compare Threshold */
#define BITL_ADC_ADCCMP2_THR                                  (16U)          /* Compare Threshold */
#define BITM_ADC_ADCCMP2_THR                                  (0X0003FFFCU)  /* Compare Threshold */
#define BITP_ADC_ADCCMP2_IRQEN                                (18U)          /* Enable IRQ Generation */
#define BITL_ADC_ADCCMP2_IRQEN                                (1U)           /* Enable IRQ Generation */
#define BITM_ADC_ADCCMP2_IRQEN                                (0X00040000U)  /* Enable IRQ Generation */
#define BITP_ADC_ADCCMP2_CH                                   (19U)          /* Channel Index for Data Comparison */
#define BITL_ADC_ADCCMP2_CH                                   (5U)           /* Channel Index for Data Comparison */
#define BITM_ADC_ADCCMP2_CH                                   (0X00F80000U)  /* Channel Index for Data Comparison */

/* ----------------------------------------------------------------------------------------------------
          ADCCMP3                                               Value             Description
   ---------------------------------------------------------------------------------------------------- */
#define BITP_ADC_ADCCMP3_EN                                   (0U)           /* Digital Comparator Enable */
#define BITL_ADC_ADCCMP3_EN                                   (1U)           /* Digital Comparator Enable */
#define BITM_ADC_ADCCMP3_EN                                   (0X00000001U)  /* Digital Comparator Enable */
#define BITP_ADC_ADCCMP3_CMPDIR                               (1U)           /* Select Digital Comparator Direction */
#define BITL_ADC_ADCCMP3_CMPDIR                               (1U)           /* Select Digital Comparator Direction */
#define BITM_ADC_ADCCMP3_CMPDIR                               (0X00000002U)  /* Select Digital Comparator Direction */
#define BITP_ADC_ADCCMP3_THR                                  (2U)           /* Compare Threshold */
#define BITL_ADC_ADCCMP3_THR                                  (16U)          /* Compare Threshold */
#define BITM_ADC_ADCCMP3_THR                                  (0X0003FFFCU)  /* Compare Threshold */
#define BITP_ADC_ADCCMP3_IRQEN                                (18U)          /* Enable IRQ Generation */
#define BITL_ADC_ADCCMP3_IRQEN                                (1U)           /* Enable IRQ Generation */
#define BITM_ADC_ADCCMP3_IRQEN                                (0X00040000U)  /* Enable IRQ Generation */
#define BITP_ADC_ADCCMP3_CH                                   (19U)          /* Channel Index for Data Comparison */
#define BITL_ADC_ADCCMP3_CH                                   (5U)           /* Channel Index for Data Comparison */
#define BITM_ADC_ADCCMP3_CH                                   (0X00F80000U)  /* Channel Index for Data Comparison */

#endif  /* end ifndef ADC_ADDR_RDEF_H_ */


#ifndef COMP_ADDR_RDEF_H_
#define COMP_ADDR_RDEF_H_    /* COMP: Your module description, here. */

/* ====================================================================================================
        COMP Module Instances Address and Mask Definitions
   ==================================================================================================== */
#define INST_COMP                                                (0X40068A00U)    /* comp: */

#define MASK_COMP                                                (0X000001FFU)    /* COMP: Your module description, here. */

/* ====================================================================================================
        COMP Module Register Address Offset Definitions
   ==================================================================================================== */
#define IDX_COMP_COMPCON0                                       (0X000U)    /* No description provided */
#define IDX_COMP_COMPCON1                                       (0X004U)    /* No description provided */
#define IDX_COMP_COMPCON2                                       (0X008U)    /* No description provided */
#define IDX_COMP_COMPCON3                                       (0X00CU)    /* No description provided */
#define IDX_COMP_COMPIRQSTAT                                    (0X010U)    /* No description provided */

/* ====================================================================================================
        COMP Module Register ResetValue Definitions
   ==================================================================================================== */
#define RSTVAL_COMP_COMPCON0                                       (0X60) 
#define RSTVAL_COMP_COMPCON1                                       (0X60) 
#define RSTVAL_COMP_COMPCON2                                       (0X60) 
#define RSTVAL_COMP_COMPCON3                                       (0X60) 
#define RSTVAL_COMP_COMPIRQSTAT                                    (0X0) 

