ChibiOS/ChibiOS/os/common/ext/ADI/ADUCM41x/ADuCM410.h
/* ====================================================================================================
        COMP Module Register BitPositions, Lengths, Masks and Enumerations Definitions
   ==================================================================================================== */

/* ----------------------------------------------------------------------------------------------------
          COMPCON0                                              Value             Description
   ---------------------------------------------------------------------------------------------------- */
#define BITP_COMP_COMPCON_N__HYS                              (0U)           /* Comp Hysteresis Register */
#define BITL_COMP_COMPCON_N__HYS                              (5U)           /* Comp Hysteresis Register */
#define BITM_COMP_COMPCON_N__HYS                              (0X0000001FU)  /* Comp Hysteresis Register */
#define BITP_COMP_COMPCON_N__INV                              (7U)           /* Select Output Logic State */
#define BITL_COMP_COMPCON_N__INV                              (1U)           /* Select Output Logic State */
#define BITM_COMP_COMPCON_N__INV                              (0X00000080U)  /* Select Output Logic State */
#define BITP_COMP_COMPCON_N__OUT                              (8U)           /* Comp Interrupt Select */
#define BITL_COMP_COMPCON_N__OUT                              (2U)           /* Comp Interrupt Select */
#define BITM_COMP_COMPCON_N__OUT                              (0X00000300U)  /* Comp Interrupt Select */
#define BITP_COMP_COMPCON_N__INNEG                            (10U)          /* Select Comparator Negative Input Source */
#define BITL_COMP_COMPCON_N__INNEG                            (3U)           /* Select Comparator Negative Input Source */
#define BITM_COMP_COMPCON_N__INNEG                            (0X00001C00U)  /* Select Comparator Negative Input Source */
#define BITP_COMP_COMPCON_N__INPOS                            (13U)          /* Select Comparator Positive Input Source */
#define BITL_COMP_COMPCON_N__INPOS                            (3U)           /* Select Comparator Positive Input Source */
#define BITM_COMP_COMPCON_N__INPOS                            (0X0000E000U)  /* Select Comparator Positive Input Source */
#define BITP_COMP_COMPCON_N__HYSTYP                           (16U)          /* Select Hysteresis Type */
#define BITL_COMP_COMPCON_N__HYSTYP                           (1U)           /* Select Hysteresis Type */
#define BITM_COMP_COMPCON_N__HYSTYP                           (0X00010000U)  /* Select Hysteresis Type */
#define BITP_COMP_COMPCON_N__EN                               (17U)          /* Enable Comparator */
#define BITL_COMP_COMPCON_N__EN                               (1U)           /* Enable Comparator */
#define BITM_COMP_COMPCON_N__EN                               (0X00020000U)  /* Enable Comparator */
#define BITP_COMP_COMPCON_N__INTEN                            (18U)          /* Interrupt Enable */
#define BITL_COMP_COMPCON_N__INTEN                            (1U)           /* Interrupt Enable */
#define BITM_COMP_COMPCON_N__INTEN                            (0X00040000U)  /* Interrupt Enable */
#define BITP_COMP_COMPCON_N__INTMODE                          (19U)          /* Interrupt Mode */
#define BITL_COMP_COMPCON_N__INTMODE                          (2U)           /* Interrupt Mode */
#define BITM_COMP_COMPCON_N__INTMODE                          (0X00180000U)  /* Interrupt Mode */

#define ENUM_COMP_COMPCON_N__INTMODE_RISEEDGE                 (0X00000000U)  /* Generate Interrupt if Rising Edge Happens */
#define ENUM_COMP_COMPCON_N__INTMODE_FALLEDGE                 (0X00000001U)  /* Generate Interrupt if Falling Edge Happens */
#define ENUM_COMP_COMPCON_N__INTMODE_LOWLEVEL                 (0X00000002U)  /* Generate Interrupt if Low Level Happens */
#define ENUM_COMP_COMPCON_N__INTMODE_HIGHLEVEL                (0X00000003U)  /* Generate Interrupt if High Level Happens */
#define ENUM_COMP_COMPCON_N__HYSTYP_EXTHYS                    (0X00000000U)  /* Select External Hysteresis */
#define ENUM_COMP_COMPCON_N__HYSTYP_INTHYS                    (0X00000001U)  /* Select Internal Hysteresis */
#define ENUM_COMP_COMPCON_N__INPOS_NO_INPUT                   (0X00000000U)  /* All Input Switches Off */
#define ENUM_COMP_COMPCON_N__INPOS_AINXP                      (0X00000001U)  /* Enable AIN8/10/12/14 for comp 0/1/2/3 */
#define ENUM_COMP_COMPCON_N__INPOS_PGAIN                      (0X00000002U)  /* Enable PGA0/1/2/3 for comp 0/1/2/3 */
#define ENUM_COMP_COMPCON_N__INPOS_GPIO_ANAIN                 (0X00000003U)  /* Enable GPIO0.6/0.7/2.0/2.1 Analog Signal Input for comp 0/1/2/3 */
#define ENUM_COMP_COMPCON_N__INNEG_NO_INPUT                   (0X00000000U)  /* All Input Switches Off */
#define ENUM_COMP_COMPCON_N__INNEG_AHIDIV2IN                  (0X00000001U)  /* Enable Half Avdd Input */
#define ENUM_COMP_COMPCON_N__INNEG_AINXN                      (0X00000002U)  /* Enable AIN9/11/13/15 for Comp 0/1/2/3 */
#define ENUM_COMP_COMPCON_N__INNEG_VDAC8IN                    (0X00000003U)  /* Enable VDAC8 Input */
#define ENUM_COMP_COMPCON_N__INNEG_VDAC9IN                    (0X00000004U)  /* Enable VDAC9 Input */
#define ENUM_COMP_COMPCON_N__INNEG_VDAC10IN                   (0X00000005U)  /* Enable VDAC10 Input */
#define ENUM_COMP_COMPCON_N__INNEG_VDAC11IN                   (0X00000006U)  /* Enable VDAC11 Input */
#define ENUM_COMP_COMPCON_N__INNEG_V1P25REFIN                 (0X00000007U)  /* Enable 1.25V Ref Input from AIN15(BUF1) */
#define ENUM_COMP_COMPCON_N__OUT_DIS00                        (0X00000000U)  /* Output to Test Pad Disable */
#define ENUM_COMP_COMPCON_N__OUT_DIS01                        (0X00000001U)  /* Output to Test Pad Disable */
#define ENUM_COMP_COMPCON_N__OUT_EN10                         (0X00000002U)  /* Output to Test Pad Enable */
#define ENUM_COMP_COMPCON_N__OUT_DIS11                        (0X00000003U)  /* Output to Test Pad Disable */
#define ENUM_COMP_COMPCON_N__INV_NOM                          (0X00000000U)  /* Output is High if +ve is higher than -ve input */
#define ENUM_COMP_COMPCON_N__INV_COV                          (0X00000001U)  /* Output is High if -ve is higher than +ve input */
#define ENUM_COMP_COMPCON_N__HYS_DIS                          (0X00000000U)  /* hysteresis disabled */
#define ENUM_COMP_COMPCON_N__HYS_EN10MV                       (0X00000001U)  /* 10mv hysteresis enabled */
#define ENUM_COMP_COMPCON_N__HYS_EN25MV                       (0X00000002U)  /* 25mv hysteresis */
#define ENUM_COMP_COMPCON_N__HYS_EN35MV                       (0X00000003U)  /* 35mv hysteresis */
#define ENUM_COMP_COMPCON_N__HYS_EN50MV                       (0X00000006U)  /* 50mv hysteresis */
#define ENUM_COMP_COMPCON_N__HYS_EN60MV                       (0X00000007U)  /* 60mv hysteresis */
#define ENUM_COMP_COMPCON_N__HYS_EN75MV                       (0X0000000CU)  /* 75mv hysteresis */
#define ENUM_COMP_COMPCON_N__HYS_EN85MV                       (0X0000000DU)  /* 85mv hysteresis */
#define ENUM_COMP_COMPCON_N__HYS_EN100MV                      (0X0000000EU)  /* 100mv hysteresis */
#define ENUM_COMP_COMPCON_N__HYS_EN110MV                      (0X00000011U)  /* 110mv hysteresis */
#define ENUM_COMP_COMPCON_N__HYS_EN125MV                      (0X00000012U)  /* 125mv hysteresis */
#define ENUM_COMP_COMPCON_N__HYS_EN135MV                      (0X00000013U)  /* 135mv hysteresis */
#define ENUM_COMP_COMPCON_N__HYS_EN150MV                      (0X00000016U)  /* 150mv hysteresis */
#define ENUM_COMP_COMPCON_N__HYS_EN160MV                      (0X00000017U)  /* 160mv hysteresis */
#define ENUM_COMP_COMPCON_N__HYS_EN175MV                      (0X0000001CU)  /* 175mv hysteresis */
#define ENUM_COMP_COMPCON_N__HYS_EN185MV                      (0X0000001DU)  /* 185mv hysteresis */
#define ENUM_COMP_COMPCON_N__HYS_EN200MV                      (0X0000001EU)  /* 200mv hysteresis */
#define ENUM_COMP_COMPCON_N__HYS_EN210MV                      (0X0000001FU)  /* 210mv hysteresis */

