ChibiOS/ChibiOS/os/common/ext/ADI/ADUCM41x/ADuCM410.h
/* ----------------------------------------------------------------------------------------------------
          COMPIRQSTAT                                           Value             Description
   ---------------------------------------------------------------------------------------------------- */
#define BITP_COMP_COMPIRQSTAT_COMP0                           (0U)           /* Comparator 0 Interrupt Status */
#define BITL_COMP_COMPIRQSTAT_COMP0                           (1U)           /* Comparator 0 Interrupt Status */
#define BITM_COMP_COMPIRQSTAT_COMP0                           (0X00000001U)  /* Comparator 0 Interrupt Status */
#define BITP_COMP_COMPIRQSTAT_COMP1                           (1U)           /* Comparator 1 Interrupt Status */
#define BITL_COMP_COMPIRQSTAT_COMP1                           (1U)           /* Comparator 1 Interrupt Status */
#define BITM_COMP_COMPIRQSTAT_COMP1                           (0X00000002U)  /* Comparator 1 Interrupt Status */
#define BITP_COMP_COMPIRQSTAT_COMP2                           (2U)           /* Comparator 2 Interrupt Status */
#define BITL_COMP_COMPIRQSTAT_COMP2                           (1U)           /* Comparator 2 Interrupt Status */
#define BITM_COMP_COMPIRQSTAT_COMP2                           (0X00000004U)  /* Comparator 2 Interrupt Status */
#define BITP_COMP_COMPIRQSTAT_COMP3                           (3U)           /* Comparator 3 Interrupt Status */
#define BITL_COMP_COMPIRQSTAT_COMP3                           (1U)           /* Comparator 3 Interrupt Status */
#define BITM_COMP_COMPIRQSTAT_COMP3                           (0X00000008U)  /* Comparator 3 Interrupt Status */

#endif  /* end ifndef COMP_ADDR_RDEF_H_ */


#ifndef OSC_MMRS_ADDR_RDEF_H_
#define OSC_MMRS_ADDR_RDEF_H_    /* OSC_MMRS: Your module description, here. */

/* ====================================================================================================
        OSC_MMRS Module Instances Address and Mask Definitions
   ==================================================================================================== */
#define INST_OSC                                                 (0X40068E00U)    /* osc: */

#define MASK_OSC_MMRS                                            (0X000001FFU)    /* OSC_MMRS: Your module description, here. */

/* ====================================================================================================
        OSC_MMRS Module Register Address Offset Definitions
   ==================================================================================================== */
#define IDX_OSC_MMRS_HFOSCCTRL                                  (0X004U)    /* No description provided */
#define IDX_OSC_MMRS_HFXTALCTRL                                 (0X018U)    /* No description provided */

/* ====================================================================================================
        OSC_MMRS Module Register ResetValue Definitions
   ==================================================================================================== */
#define RSTVAL_OSC_MMRS_HFOSCCTRL                                  (0X0) 
#define RSTVAL_OSC_MMRS_HFXTALCTRL                                 (0X2) 

/* ====================================================================================================
        OSC_MMRS Module Register BitPositions, Lengths, Masks and Enumerations Definitions
   ==================================================================================================== */

/* ----------------------------------------------------------------------------------------------------
          HFOSCCTRL                                             Value             Description
   ---------------------------------------------------------------------------------------------------- */
#define BITP_OSC_MMRS_HFOSCCTRL_CLKSEL                        (0U)           /* Selects Either Xtal RC */
#define BITL_OSC_MMRS_HFOSCCTRL_CLKSEL                        (2U)           /* Selects Either Xtal RC */
#define BITM_OSC_MMRS_HFOSCCTRL_CLKSEL                        (0X00000003U)  /* Selects Either Xtal RC */
#define BITP_OSC_MMRS_HFOSCCTRL_PDOSC16M                      (2U)           /* Power Down Pin Oscillator */
#define BITL_OSC_MMRS_HFOSCCTRL_PDOSC16M                      (1U)           /* Power Down Pin Oscillator */
#define BITM_OSC_MMRS_HFOSCCTRL_PDOSC16M                      (0X00000004U)  /* Power Down Pin Oscillator */

#define ENUM_OSC_MMRS_HFOSCCTRL_CLKSEL_SELRC                  (0X00000000U)  /* RC clock */
#define ENUM_OSC_MMRS_HFOSCCTRL_CLKSEL_SELXTAL                (0X00000001U)  /* Xtal clock */
#define ENUM_OSC_MMRS_HFOSCCTRL_CLKSEL_SELEXT                 (0X00000002U)  /* External Clock */
#define ENUM_OSC_MMRS_HFOSCCTRL_CLKSEL_SELGND                 (0X00000003U)  /* gnd */

/* ----------------------------------------------------------------------------------------------------
          HFXTALCTRL                                            Value             Description
   ---------------------------------------------------------------------------------------------------- */
#define BITP_OSC_MMRS_HFXTALCTRL_ENXTAL                       (0U)           /* Enable Xtal */
#define BITL_OSC_MMRS_HFXTALCTRL_ENXTAL                       (1U)           /* Enable Xtal */
#define BITM_OSC_MMRS_HFXTALCTRL_ENXTAL                       (0X00000001U)  /* Enable Xtal */

#endif  /* end ifndef OSC_MMRS_ADDR_RDEF_H_ */


#ifndef PGA_ADDR_RDEF_H_
#define PGA_ADDR_RDEF_H_    /* PGA: Your module description, here. */

/* ====================================================================================================
        PGA Module Instances Address and Mask Definitions
   ==================================================================================================== */
#define INST_PGA                                                 (0X40069000U)    /* pga: */

#define MASK_PGA                                                 (0X000001FFU)    /* PGA: Your module description, here. */

