ChibiOS/ChibiOS/os/common/ext/ADI/ADUCM41x/ADuCM410.h
/* ====================================================================================================
        PGA Module Register Address Offset Definitions
   ==================================================================================================== */
#define IDX_PGA_PGABIASCON                                      (0X000U)    /* PGA Bias Circuit Control Signal */
#define IDX_PGA_PGA0CON                                         (0X020U)    /* PGA0 Control Register */
#define IDX_PGA_PGA0CHPCON                                      (0X024U)    /* PGA0 Chop Function Ctrl */
#define IDX_PGA_PGA3CHPCON                                      (0X028U)    /* PGA3 Chop Function Ctrl */
#define IDX_PGA_PGA1CON                                         (0X070U)    /* PGA1 Control Register */
#define IDX_PGA_PGA1CHPCON                                      (0X074U)    /* PGA1 Chop Function Ctrl */
#define IDX_PGA_PGA2CON                                         (0X0A0U)    /* PGA2 Control Register */
#define IDX_PGA_PGA2CHPCON                                      (0X0A4U)    /* PGA2 Chop Function Ctrl */
#define IDX_PGA_PGA3CON                                         (0X0D0U)    /* PGA3 Control Register */

/* ====================================================================================================
        PGA Module Register ResetValue Definitions
   ==================================================================================================== */
#define RSTVAL_PGA_PGABIASCON                                      (0X3F) 
#define RSTVAL_PGA_PGA0CON                                         (0X19) 
#define RSTVAL_PGA_PGA0CHPCON                                      (0X1) 
#define RSTVAL_PGA_PGA3CHPCON                                      (0X1) 
#define RSTVAL_PGA_PGA1CON                                         (0X11) 
#define RSTVAL_PGA_PGA1CHPCON                                      (0X1) 
#define RSTVAL_PGA_PGA2CON                                         (0X19) 
#define RSTVAL_PGA_PGA2CHPCON                                      (0X1) 
#define RSTVAL_PGA_PGA3CON                                         (0X11) 

/* ====================================================================================================
        PGA Module Register BitPositions, Lengths, Masks and Enumerations Definitions
   ==================================================================================================== */

/* ----------------------------------------------------------------------------------------------------
          PGABIASCON                                            Value             Description
   ---------------------------------------------------------------------------------------------------- */
#define BITP_PGA_PGABIASCON_PD0BUF0P2                         (0U)           /* Buf_200mv Power Down */
#define BITL_PGA_PGABIASCON_PD0BUF0P2                         (1U)           /* Buf_200mv Power Down */
#define BITM_PGA_PGABIASCON_PD0BUF0P2                         (0X00000001U)  /* Buf_200mv Power Down */
#define BITP_PGA_PGABIASCON_PD1BUF0P2                         (1U)           /* Buf_200mv Power Down */
#define BITL_PGA_PGABIASCON_PD1BUF0P2                         (1U)           /* Buf_200mv Power Down */
#define BITM_PGA_PGABIASCON_PD1BUF0P2                         (0X00000002U)  /* Buf_200mv Power Down */
#define BITP_PGA_PGABIASCON_PD0BUF1P25                        (2U)           /* BUF1P25 Power Down */
#define BITL_PGA_PGABIASCON_PD0BUF1P25                        (1U)           /* BUF1P25 Power Down */
#define BITM_PGA_PGABIASCON_PD0BUF1P25                        (0X00000004U)  /* BUF1P25 Power Down */
#define BITP_PGA_PGABIASCON_PD1BUF1P25                        (3U)           /* BUF1P25 Power Down */
#define BITL_PGA_PGABIASCON_PD1BUF1P25                        (1U)           /* BUF1P25 Power Down */
#define BITM_PGA_PGABIASCON_PD1BUF1P25                        (0X00000008U)  /* BUF1P25 Power Down */
#define BITP_PGA_PGABIASCON_PD2BUF1P25                        (4U)           /* BUF1P25 Power Down */
#define BITL_PGA_PGABIASCON_PD2BUF1P25                        (1U)           /* BUF1P25 Power Down */
#define BITM_PGA_PGABIASCON_PD2BUF1P25                        (0X00000010U)  /* BUF1P25 Power Down */
#define BITP_PGA_PGABIASCON_PD3BUF1P25                        (5U)           /* BUF1P25 Power Down */
#define BITL_PGA_PGABIASCON_PD3BUF1P25                        (1U)           /* BUF1P25 Power Down */
#define BITM_PGA_PGABIASCON_PD3BUF1P25                        (0X00000020U)  /* BUF1P25 Power Down */

#define ENUM_PGA_PGABIASCON_PD3BUF1P25_ENABLE                 (0X00000000U)  /* BUF1p25 Enable */
#define ENUM_PGA_PGABIASCON_PD3BUF1P25_OFF                    (0X00000001U)  /* BUF1p25 Power Down */
#define ENUM_PGA_PGABIASCON_PD2BUF1P25_ENABLE                 (0X00000000U)  /* BUF1p25 Enable */
#define ENUM_PGA_PGABIASCON_PD2BUF1P25_OFF                    (0X00000001U)  /* BUF1p25 Power Down */
#define ENUM_PGA_PGABIASCON_PD1BUF1P25_ENABLE                 (0X00000000U)  /* BUF1p25 Enable */
#define ENUM_PGA_PGABIASCON_PD1BUF1P25_OFF                    (0X00000001U)  /* BUF1p25 Power Down */
#define ENUM_PGA_PGABIASCON_PD0BUF1P25_ENABLE                 (0X00000000U)  /* BUF1p25 Enable */
#define ENUM_PGA_PGABIASCON_PD0BUF1P25_OFF                    (0X00000001U)  /* BUF1p25 Power Down */
#define ENUM_PGA_PGABIASCON_PD1BUF0P2_ENABLE                  (0X00000000U)  /* Buf_200mV Enable */
#define ENUM_PGA_PGABIASCON_PD1BUF0P2_OFF                     (0X00000001U)  /* Buf_200mv Power Down */
#define ENUM_PGA_PGABIASCON_PD0BUF0P2_ENABLE                  (0X00000000U)  /* Buf_200mV Enable */
#define ENUM_PGA_PGABIASCON_PD0BUF0P2_OFF                     (0X00000001U)  /* Buf_200mv Power Down */

/* ----------------------------------------------------------------------------------------------------
          PGA0CON                                               Value             Description
   ---------------------------------------------------------------------------------------------------- */
#define BITP_PGA_PGA0CON_PDPGACORE                            (0U)           /* PGA Core Power Down */
#define BITL_PGA_PGA0CON_PDPGACORE                            (1U)           /* PGA Core Power Down */
#define BITM_PGA_PGA0CON_PDPGACORE                            (0X00000001U)  /* PGA Core Power Down */
#define BITP_PGA_PGA0CON_MODE                                 (1U)           /* PGA or TIA Mode Selection */
#define BITL_PGA_PGA0CON_MODE                                 (1U)           /* PGA or TIA Mode Selection */
#define BITM_PGA_PGA0CON_MODE                                 (0X00000002U)  /* PGA or TIA Mode Selection */
#define BITP_PGA_PGA0CON_PGAMODE                              (2U)           /* PGA DC Mode or AC Couple Mode Selection */
#define BITL_PGA_PGA0CON_PGAMODE                              (1U)           /* PGA DC Mode or AC Couple Mode Selection */
#define BITM_PGA_PGA0CON_PGAMODE                              (0X00000004U)  /* PGA DC Mode or AC Couple Mode Selection */
#define BITP_PGA_PGA0CON_CAPBYPASS                            (3U)           /* Bypass the External Cap */
#define BITL_PGA_PGA0CON_CAPBYPASS                            (1U)           /* Bypass the External Cap */
#define BITM_PGA_PGA0CON_CAPBYPASS                            (0X00000008U)  /* Bypass the External Cap */
#define BITP_PGA_PGA0CON_PGAGAIN                              (5U)           /* PGA Gain Configuration */
#define BITL_PGA_PGA0CON_PGAGAIN                              (3U)           /* PGA Gain Configuration */
#define BITM_PGA_PGA0CON_PGAGAIN                              (0X000000E0U)  /* PGA Gain Configuration */
#define BITP_PGA_PGA0CON_TIAGAIN                              (8U)           /* TIA Gain Configuration */
#define BITL_PGA_PGA0CON_TIAGAIN                              (3U)           /* TIA Gain Configuration */
#define BITM_PGA_PGA0CON_TIAGAIN                              (0X00000700U)  /* TIA Gain Configuration */
#define BITP_PGA_PGA0CON_TIAVDACSEL                           (11U)          /* TIA Vbias Selection of VDAC Channel */
#define BITL_PGA_PGA0CON_TIAVDACSEL                           (2U)           /* TIA Vbias Selection of VDAC Channel */
#define BITM_PGA_PGA0CON_TIAVDACSEL                           (0X00001800U)  /* TIA Vbias Selection of VDAC Channel */
#define BITP_PGA_PGA0CON_DRVEN                                (14U)          /* Sink Current Ability Improve */
#define BITL_PGA_PGA0CON_DRVEN                                (1U)           /* Sink Current Ability Improve */
#define BITM_PGA_PGA0CON_DRVEN                                (0X00004000U)  /* Sink Current Ability Improve */
#define BITP_PGA_PGA0CON_TIASRCEN                             (15U)          /* Select Between Source Mode and Sink Mode */
#define BITL_PGA_PGA0CON_TIASRCEN                             (1U)           /* Select Between Source Mode and Sink Mode */
#define BITM_PGA_PGA0CON_TIASRCEN                             (0X00008000U)  /* Select Between Source Mode and Sink Mode */

#define ENUM_PGA_PGA0CON_TIASRCEN_SINKMD                      (0X00000000U)  /* Sink Mode */
#define ENUM_PGA_PGA0CON_TIASRCEN_SOURCEMD                    (0X00000001U)  /* Source Mode */
#define ENUM_PGA_PGA0CON_DRVEN_DRVDISABLE                     (0X00000000U)  /* Disable Isink Ability Improvement, Normal Drive */
#define ENUM_PGA_PGA0CON_DRVEN_DRVENABLE                      (0X00000001U)  /* Enable Isink Ability Improvement */
#define ENUM_PGA_PGA0CON_TIAVDACSEL_VDAC8SEL                  (0X00000000U)  /* Select VDAC8 as TIA Vbias */
#define ENUM_PGA_PGA0CON_TIAVDACSEL_VDAC9SEL                  (0X00000001U)  /* Select VDAC9 as TIA Vbias */
#define ENUM_PGA_PGA0CON_TIAVDACSEL_VDAC10SEL                 (0X00000002U)  /* Select VDAC10 as TIA Vbias */
#define ENUM_PGA_PGA0CON_TIAVDACSEL_VDAC11SEL                 (0X00000003U)  /* Select VDAC11 as TIA Vbias */
#define ENUM_PGA_PGA0CON_TIAGAIN_RES250                       (0X00000000U)  /* TIARES=250ohm */
#define ENUM_PGA_PGA0CON_TIAGAIN_RES750                       (0X00000001U)  /* TIARES=750ohm */
#define ENUM_PGA_PGA0CON_TIAGAIN_RES2K                        (0X00000002U)  /* TIARES=2kohm */
#define ENUM_PGA_PGA0CON_TIAGAIN_RES5K                        (0X00000003U)  /* TIARES=5kohm */
#define ENUM_PGA_PGA0CON_TIAGAIN_RES10K                       (0X00000004U)  /* TIARES=10kohm */
#define ENUM_PGA_PGA0CON_TIAGAIN_RES20K                       (0X00000005U)  /* TIARES=20kohm */
#define ENUM_PGA_PGA0CON_TIAGAIN_RES100K                      (0X00000006U)  /* TIARES=100kohm */
#define ENUM_PGA_PGA0CON_PGAGAIN_GAIN1                        (0X00000000U)  /* Gain=1 */
#define ENUM_PGA_PGA0CON_PGAGAIN_GAIN2                        (0X00000001U)  /* GAIN=2 */
#define ENUM_PGA_PGA0CON_PGAGAIN_GAIN4                        (0X00000002U)  /* GAIN=4 */
#define ENUM_PGA_PGA0CON_PGAGAIN_GAIN6                        (0X00000003U)  /* GAIN=6 */
#define ENUM_PGA_PGA0CON_PGAGAIN_GAIN8                        (0X00000004U)  /* GAIN=8 */
#define ENUM_PGA_PGA0CON_PGAGAIN_GAIN10                       (0X00000005U)  /* GAIN=10 */
#define ENUM_PGA_PGA0CON_CAPBYPASS_BYPEN                      (0X00000001U)  /* Bypass the External Cap */
#define ENUM_PGA_PGA0CON_CAPBYPASS_BYPDISABLE                 (0X00000000U)  /* Select the External CAP */
#define ENUM_PGA_PGA0CON_PGAMODE_DCCOUPLE                     (0X00000000U)  /* PGA DC Mode Enable */
#define ENUM_PGA_PGA0CON_PGAMODE_ACCOUPLE                     (0X00000001U)  /* PGA AC Coupling Mode Enable */
#define ENUM_PGA_PGA0CON_MODE_PGAMODE                         (0X00000000U)  /* PGA Mode Enable */
#define ENUM_PGA_PGA0CON_MODE_TIAMODE                         (0X00000001U)  /* TIA Mode Enable */

