ChibiOS/ChibiOS/os/common/ext/ADI/ADUCM41x/ADuCM410.h
/* ====================================================================================================
        DAC Module Register BitPositions, Lengths, Masks and Enumerations Definitions
   ==================================================================================================== */

/* ----------------------------------------------------------------------------------------------------
          DACCON0                                               Value             Description
   ---------------------------------------------------------------------------------------------------- */
#define BITP_DAC_DACCON_N__EN                                 (4U)           /* DAC Input Data Clear, Won't Be Controlled by Sync Mode. */
#define BITL_DAC_DACCON_N__EN                                 (1U)           /* DAC Input Data Clear, Won't Be Controlled by Sync Mode. */
#define BITM_DAC_DACCON_N__EN                                 (0X00000010U)  /* DAC Input Data Clear, Won't Be Controlled by Sync Mode. */
#define BITP_DAC_DACCON_N__FSLVL                              (5U)           /* Select Output Full Scale */
#define BITL_DAC_DACCON_N__FSLVL                              (1U)           /* Select Output Full Scale */
#define BITM_DAC_DACCON_N__FSLVL                              (0X00000020U)  /* Select Output Full Scale */
#define BITP_DAC_DACCON_N__PD                                 (8U)           /* DAC Top Power Down */
#define BITL_DAC_DACCON_N__PD                                 (1U)           /* DAC Top Power Down */
#define BITM_DAC_DACCON_N__PD                                 (0X00000100U)  /* DAC Top Power Down */
#define BITP_DAC_DACCON_N__DRV                                (9U)           /* Drive Ability Boost Enable, Can Drive 10mA Load. */
#define BITL_DAC_DACCON_N__DRV                                (1U)           /* Drive Ability Boost Enable, Can Drive 10mA Load. */
#define BITM_DAC_DACCON_N__DRV                                (0X00000200U)  /* Drive Ability Boost Enable, Can Drive 10mA Load. */

#define ENUM_DAC_DACCON_N__DRV_NORMAL                         (0X00000000U)  /* Normal Work Mode */
#define ENUM_DAC_DACCON_N__DRV_DRIVEBOOST                     (0X00000001U)  /* Drive Ability Boost Mode */
#define ENUM_DAC_DACCON_N__PD_DACON                           (0X00000000U)  /* DAC Top Enable */
#define ENUM_DAC_DACCON_N__PD_DACOFF                          (0X00000001U)  /* DAC TOP Power Down */
#define ENUM_DAC_DACCON_N__FSLVL_OUT2P5                       (0X00000000U)  /* Full Scale is 2.5V */
#define ENUM_DAC_DACCON_N__FSLVL_OUT3V3                       (0X00000001U)  /* Full Scale is 3.3V */
#define ENUM_DAC_DACCON_N__EN_CLEAR                           (0X00000000U)  /* DAC DATA Clear */
#define ENUM_DAC_DACCON_N__EN_CLEAROFF                        (0X00000001U)  /* DAC DATA Normal Input */

/* ----------------------------------------------------------------------------------------------------
          DACDAT0                                               Value             Description
   ---------------------------------------------------------------------------------------------------- */
#define BITP_DAC_DACDAT_N__DATAIN                             (12U)          /* DAC Input Data */
#define BITL_DAC_DACDAT_N__DATAIN                             (16U)          /* DAC Input Data */
#define BITM_DAC_DACDAT_N__DATAIN                             (0X0FFFF000U)  /* DAC Input Data */

#endif  /* end ifndef DAC_ADDR_RDEF_H_ */

/*! ========================================================================
 *  \struct ADI_TMR_TypeDef
 *  \brief GPT0
 *  ======================================================================== */
typedef struct _ADI_TMR_TypeDef
{
    volatile       uint16_t LD;                              /**< 0 16-bit Load Value Register */
    volatile const uint8_t RESERVED0[2];                   
    volatile const uint16_t VAL;                             /**< 4 16-bit Timer Value Register */
    volatile const uint8_t RESERVED1[2];                   
    volatile       uint16_t CON;                             /**< 8 Control Register */
    volatile const uint8_t RESERVED2[2];                   
    volatile       uint16_t CLRI;                            /**< C Clear Interrupt Register */
    volatile const uint8_t RESERVED3[14];                  
    volatile const uint16_t STA;                             /**< 1C Status Register */
} ADI_TMR_TypeDef;

/*! ========================================================================
 *  \struct ADI_TIMER_TypeDef
 *  \brief Timer
 *  ======================================================================== */
typedef struct _ADI_TIMER_TypeDef
{
    volatile       uint32_t CTL;                             /**< 0 Timer Control */
    volatile       uint32_t CNT;                             /**< 4 Count Value */
    volatile       uint32_t STATUS;                          /**< 8 Timer Status */
    volatile const uint8_t RESERVED0[4];                   
    volatile       uint32_t CFG0;                            /**< 10 Capture Compare Configuration */
    volatile       uint32_t CFG1;                            /**< 14 Capture Compare Configuration */
    volatile       uint32_t CFG2;                            /**< 18 Capture Compare Configuration */
    volatile       uint32_t CFG3;                            /**< 1C Capture Compare Configuration */
    volatile       uint32_t CC0;                             /**< 20 Compare and Capture Value */
    volatile       uint32_t CC1;                             /**< 24 Compare and Capture Value */
    volatile       uint32_t CC2;                             /**< 28 Compare and Capture Value */
    volatile       uint32_t CC3;                             /**< 2C Compare and Capture Value */
} ADI_TIMER_TypeDef;

/*! ========================================================================
 *  \struct ADI_MISC16_TypeDef
 *  \brief Your module description, here.
 *  ======================================================================== */
typedef struct _ADI_MISC16_TypeDef
{
    volatile const uint8_t RESERVED0[32];                  
    volatile const uint32_t ADIID;                           /**< 20 ADI ID */
    volatile const uint32_t CHIPID;                          /**< 24 Chip ID */
    volatile const uint8_t RESERVED1[268];                 
    volatile       uint32_t USERKEY;                         /**< 134 Open to Customer to Protect Important Registers */
} ADI_MISC16_TypeDef;

/*! ========================================================================
 *  \struct ADI_WUT_TypeDef
 *  \brief WUT
 *  ======================================================================== */
typedef struct _ADI_WUT_TypeDef
{
    volatile const uint16_t T4VAL0;                          /**< 0 Current Count Value - LS 16 Bits */
    volatile const uint8_t RESERVED0[2];                   
    volatile const uint16_t T4VAL1;                          /**< 4 Current Count Value - MS 16 Bits */
    volatile const uint8_t RESERVED1[2];                   
    volatile       uint16_t T4CON;                           /**< 8 Control Register */
    volatile const uint8_t RESERVED2[2];                   
    volatile       uint16_t T4INC;                           /**< C 12-bit Interval for Wakeup Field a */
    volatile const uint8_t RESERVED3[2];                   
    volatile       uint16_t T4WUFB0;                         /**< 10 Wakeup Field B - LS 16 Bits */
    volatile const uint8_t RESERVED4[2];                   
    volatile       uint16_t T4WUFB1;                         /**< 14 Wakeup Field B - MS 16 Bits */
    volatile const uint8_t RESERVED5[2];                   
    volatile       uint16_t T4WUFC0;                         /**< 18 Wakeup Field C - LS 16 Bits */
    volatile const uint8_t RESERVED6[2];                   
    volatile       uint16_t T4WUFC1;                         /**< 1C Wakeup Field C - MS 16 Bits */
    volatile const uint8_t RESERVED7[2];                   
    volatile       uint16_t T4WUFD0;                         /**< 20 Wakeup Field D - LS 16 Bits */
    volatile const uint8_t RESERVED8[2];                   
    volatile       uint16_t T4WUFD1;                         /**< 24 Wakeup Field D - MS 16 Bits */
    volatile const uint8_t RESERVED9[2];                   
    volatile       uint16_t T4IEN;                           /**< 28 Interrupt Enable Register */
    volatile const uint8_t RESERVED10[2];                  
    volatile const uint16_t T4STA;                           /**< 2C Status Register */
    volatile const uint8_t RESERVED11[2];                  
    volatile       uint16_t T4CLRI;                          /**< 30 Clear Interrupt Register */
    volatile const uint8_t RESERVED12[10];                 
    volatile       uint16_t T4WUFA0;                         /**< 3C Wakeup Field a - LS 16 Bits */
    volatile const uint8_t RESERVED13[2];                  
    volatile       uint16_t T4WUFA1;                         /**< 40 Wakeup Field a - MS 16 Bits */
} ADI_WUT_TypeDef;

/*! ========================================================================
 *  \struct ADI_WDT_TypeDef
 *  \brief Watchdog Timer Register Map
 *  ======================================================================== */
typedef struct _ADI_WDT_TypeDef
{
    volatile       uint16_t LD;                              /**< 0 Watchdog Timer Load Value */
    volatile const uint8_t RESERVED0[2];                   
    volatile const uint16_t VALS;                            /**< 4 Current Count Value */
    volatile const uint8_t RESERVED1[2];                   
    volatile       uint16_t CON;                             /**< 8 Watchdog Timer Control Register */
    volatile const uint8_t RESERVED2[2];                   
    volatile       uint16_t CLRI;                            /**< C Refresh Watchdog Register */
    volatile const uint8_t RESERVED3[10];                  
    volatile const uint16_t STA;                             /**< 18 Timer Status */
    volatile const uint8_t RESERVED4[2];                   
    volatile       uint16_t MINLD;                           /**< 1C Minimum Load Value */
} ADI_WDT_TypeDef;

/*! ========================================================================
 *  \struct ADI_ALWAYS_ON_TypeDef
 *  \brief Always on clock, reset, power management and test
 *  ======================================================================== */
typedef struct _ADI_ALWAYS_ON_TypeDef
{
    volatile       uint16_t PWRMOD;                          /**< 0 Power Modes */
    volatile const uint8_t RESERVED0[2];                   
    volatile       uint16_t PWRKEY;                          /**< 4 Key Protection for PWRMOD */
    volatile const uint8_t RESERVED1[2];                   
    volatile       uint16_t RSTCFG;                          /**< 8 Reset Configuration */
    volatile const uint8_t RESERVED2[2];                   
    volatile       uint16_t RSTKEY;                          /**< C Key Protection for RSTCFG */
    volatile const uint8_t RESERVED3[18];                  
    volatile       uint16_t EI0CFG;                          /**< 20 External Interrupt Configuration 0 */
    volatile const uint8_t RESERVED4[2];                   
    volatile       uint16_t EI1CFG;                          /**< 24 External Interrupt Configuration 1 */
    volatile const uint8_t RESERVED5[2];                   
    volatile       uint16_t EI2CFG;                          /**< 28 External Interrupt Configuration 2 */
    volatile const uint8_t RESERVED6[6];                   
    volatile       uint16_t EICLR;                           /**< 30 External Interrupt Clear */
    volatile const uint8_t RESERVED7[14];                  
    volatile       uint16_t RSTSTA;                          /**< 40 Reset Status */
} ADI_ALWAYS_ON_TypeDef;

/*! ========================================================================
 *  \struct ADI_PLA_TypeDef
 *  \brief PLA Register Map
 *  ======================================================================== */
typedef struct _ADI_PLA_TypeDef
{
    volatile       uint16_t PLA_ELEM0;                       /**< 0 ELEMx Configuration Register */
    volatile const uint8_t RESERVED0[2];                   
    volatile       uint16_t PLA_ELEM1;                       /**< 4 ELEMx Configuration Register */
    volatile const uint8_t RESERVED1[2];                   
    volatile       uint16_t PLA_ELEM2;                       /**< 8 ELEMx Configuration Register */
    volatile const uint8_t RESERVED2[2];                   
    volatile       uint16_t PLA_ELEM3;                       /**< C ELEMx Configuration Register */
    volatile const uint8_t RESERVED3[2];                   
    volatile       uint16_t PLA_ELEM4;                       /**< 10 ELEMx Configuration Register */
    volatile const uint8_t RESERVED4[2];                   
    volatile       uint16_t PLA_ELEM5;                       /**< 14 ELEMx Configuration Register */
    volatile const uint8_t RESERVED5[2];                   
    volatile       uint16_t PLA_ELEM6;                       /**< 18 ELEMx Configuration Register */
    volatile const uint8_t RESERVED6[2];                   
    volatile       uint16_t PLA_ELEM7;                       /**< 1C ELEMx Configuration Register */
    volatile const uint8_t RESERVED7[2];                   
    volatile       uint16_t PLA_ELEM8;                       /**< 20 ELEMx Configuration Register */
    volatile const uint8_t RESERVED8[2];                   
    volatile       uint16_t PLA_ELEM9;                       /**< 24 ELEMx Configuration Register */
    volatile const uint8_t RESERVED9[2];                   
    volatile       uint16_t PLA_ELEM10;                      /**< 28 ELEMx Configuration Register */
    volatile const uint8_t RESERVED10[2];                  
    volatile       uint16_t PLA_ELEM11;                      /**< 2C ELEMx Configuration Register */
    volatile const uint8_t RESERVED11[2];                  
    volatile       uint16_t PLA_ELEM12;                      /**< 30 ELEMx Configuration Register */
    volatile const uint8_t RESERVED12[2];                  
    volatile       uint16_t PLA_ELEM13;                      /**< 34 ELEMx Configuration Register */
    volatile const uint8_t RESERVED13[2];                  
    volatile       uint16_t PLA_ELEM14;                      /**< 38 ELEMx Configuration Register */
    volatile const uint8_t RESERVED14[2];                  
    volatile       uint16_t PLA_ELEM15;                      /**< 3C ELEMx Configuration Register */
    volatile const uint8_t RESERVED15[2];                  
    volatile       uint16_t PLA_ELEM16;                      /**< 40 ELEMx Configuration Register */
    volatile const uint8_t RESERVED16[2];                  
    volatile       uint16_t PLA_ELEM17;                      /**< 44 ELEMx Configuration Register */
    volatile const uint8_t RESERVED17[2];                  
    volatile       uint16_t PLA_ELEM18;                      /**< 48 ELEMx Configuration Register */
    volatile const uint8_t RESERVED18[2];                  
    volatile       uint16_t PLA_ELEM19;                      /**< 4C ELEMx Configuration Register */
    volatile const uint8_t RESERVED19[2];                  
    volatile       uint16_t PLA_ELEM20;                      /**< 50 ELEMx Configuration Register */
    volatile const uint8_t RESERVED20[2];                  
    volatile       uint16_t PLA_ELEM21;                      /**< 54 ELEMx Configuration Register */
    volatile const uint8_t RESERVED21[2];                  
    volatile       uint16_t PLA_ELEM22;                      /**< 58 ELEMx Configuration Register */
    volatile const uint8_t RESERVED22[2];                  
    volatile       uint16_t PLA_ELEM23;                      /**< 5C ELEMx Configuration Register */
    volatile const uint8_t RESERVED23[2];                  
    volatile       uint16_t PLA_ELEM24;                      /**< 60 ELEMx Configuration Register */
    volatile const uint8_t RESERVED24[2];                  
    volatile       uint16_t PLA_ELEM25;                      /**< 64 ELEMx Configuration Register */
    volatile const uint8_t RESERVED25[2];                  
    volatile       uint16_t PLA_ELEM26;                      /**< 68 ELEMx Configuration Register */
    volatile const uint8_t RESERVED26[2];                  
    volatile       uint16_t PLA_ELEM27;                      /**< 6C ELEMx Configuration Register */
    volatile const uint8_t RESERVED27[2];                  
    volatile       uint16_t PLA_ELEM28;                      /**< 70 ELEMx Configuration Register */
    volatile const uint8_t RESERVED28[2];                  
    volatile       uint16_t PLA_ELEM29;                      /**< 74 ELEMx Configuration Register */
    volatile const uint8_t RESERVED29[2];                  
    volatile       uint16_t PLA_ELEM30;                      /**< 78 ELEMx Configuration Register */
    volatile const uint8_t RESERVED30[2];                  
    volatile       uint16_t PLA_ELEM31;                      /**< 7C ELEMx Configuration Register */
    volatile const uint8_t RESERVED31[2];                  
    volatile       uint16_t PLA_CLK;                         /**< 80 PLA Clock Select */
    volatile const uint8_t RESERVED32[2];                  
    volatile       uint16_t PLA_IRQ0;                        /**< 84 Interrupt Register for Block 0 */
    volatile const uint8_t RESERVED33[2];                  
    volatile       uint16_t PLA_IRQ1;                        /**< 88 Interrupt Register for Block1 */
    volatile const uint8_t RESERVED34[2];                  
    volatile       uint16_t PLA_ADC;                         /**< 8C ADC Configuration Register */
    volatile const uint8_t RESERVED35[2];                  
    volatile       int16_t PLA_DIN0;                        /**< 90 AMBA Bus Data Input for Block 0 */
    volatile const uint8_t RESERVED36[6];                  
    volatile const uint16_t PLA_DOUT0;                       /**< 98 AMBA Bus Data Output for Block 0 */
    volatile const uint8_t RESERVED37[2];                  
    volatile const uint16_t PLA_DOUT1;                       /**< 9C AMBA Bus Data Output for Block1 */
    volatile const uint8_t RESERVED38[2];                  
    volatile       uint16_t PLA_LCK;                         /**< A0 Write Lock Register. */
    volatile const uint8_t RESERVED39[2];                  
    volatile       uint16_t PLA_IRQTYPE;                     /**< A4 PLA Interrupt Request and DMA Request Type */
} ADI_PLA_TypeDef;

/*! ========================================================================
 *  \struct ADI_DMAREQ_TypeDef
 *  \brief Your module description, here.
 *  ======================================================================== */
typedef struct _ADI_DMAREQ_TypeDef
{
    volatile       uint8_t REQEN;                           /**< 0 GPT/GPT32 and PLA DMA Request Enable */
    volatile const uint8_t RESERVED0[3];                   
    volatile       uint8_t REQ0SEL;                         /**< 4 GPT/GPT32 and PLA DMA Request 0 Select */
    volatile const uint8_t RESERVED1[3];                   
    volatile       uint8_t REQ1SEL;                         /**< 8 GPT/GPT32 and PLA DMA Request 1 Select */
    volatile const uint8_t RESERVED2[3];                   
    volatile       uint8_t PLAREQEN;                        /**< C PLA DMA Requests Enable */
    volatile const uint8_t RESERVED3[3];                   
    volatile       uint8_t GPTREQEN;                        /**< 10 GPT/GPT32 DMA Requests Enable */
    volatile const uint8_t RESERVED4[3];                   
    volatile       uint16_t GPT_MDA_REQ_TTYPE;               /**< 14 GPT and GPT32 Require Type */
} ADI_DMAREQ_TypeDef;

/*! ========================================================================
 *  \struct ADI_UART_TypeDef
 *  \brief Universal Asynchronous Receiver/Transmitter
 *  ======================================================================== */
typedef struct _ADI_UART_TypeDef
{
    union {
    volatile const uint16_t   RX;                         /*!< Receive Buffer Register */
    volatile       uint16_t   TX;                         /*!< Transmit Holding Register */
    };
    volatile const uint8_t RESERVED0[2];                   
    volatile       uint16_t IEN;                             /**< 4 Interrupt Enable */
    volatile const uint8_t RESERVED1[2];                   
    volatile const uint16_t IIR;                             /**< 8 Interrupt ID */
    volatile const uint8_t RESERVED2[2];                   
    volatile       uint16_t LCR;                             /**< C Line Control */
    volatile const uint8_t RESERVED3[2];                   
    volatile       uint16_t MCR;                             /**< 10 Modem Control */
    volatile const uint8_t RESERVED4[2];                   
    volatile const uint16_t LSR;                             /**< 14 Line Status */
    volatile const uint8_t RESERVED5[2];                   
    volatile const uint16_t MSR;                             /**< 18 Modem Status */
    volatile const uint8_t RESERVED6[2];                   
    volatile       uint16_t SCR;                             /**< 1C Scratch Buffer */
    volatile const uint8_t RESERVED7[2];                   
    volatile       uint16_t FCR;                             /**< 20 FIFO Control */
    volatile const uint8_t RESERVED8[2];                   
    volatile       uint16_t FBR;                             /**< 24 Fractional Baud Rate */
    volatile const uint8_t RESERVED9[2];                   
    volatile       uint16_t DIV;                             /**< 28 Baudrate Divider */
    volatile const uint8_t RESERVED10[2];                  
    volatile       uint16_t LCR2;                            /**< 2C Second Line Control */
    volatile const uint8_t RESERVED11[2];                  
    volatile       uint16_t CTL;                             /**< 30 UART Control Register */
    volatile const uint8_t RESERVED12[2];                  
    volatile const uint16_t RFC;                             /**< 34 RX FIFO Byte Count */
    volatile const uint8_t RESERVED13[2];                  
    volatile const uint16_t TFC;                             /**< 38 TX FIFO Byte Count */
    volatile const uint8_t RESERVED14[2];                  
    volatile       uint16_t RSC;                             /**< 3C RS485 Half-duplex Control */
    volatile const uint8_t RESERVED15[2];                  
    volatile       uint16_t ACR;                             /**< 40 Auto Baud Control */
    volatile const uint8_t RESERVED16[2];                  
    volatile const uint16_t ASRL;                            /**< 44 Auto Baud Status (Low) */
    volatile const uint8_t RESERVED17[2];                  
    volatile const uint16_t ASRH;                            /**< 48 Auto Baud Status (High) */
} ADI_UART_TypeDef;

