ChibiOS/ChibiOS/os/common/ext/ADI/ADUCM41x/ADuCM410.h
/*! ========================================================================
 *  \struct ADI_I2C_TypeDef
 *  \brief I2C Master/Slave
 *  ======================================================================== */
typedef struct _ADI_I2C_TypeDef
{
    volatile       uint16_t MCTL;                            /**< 0 Master Control */
    volatile const uint8_t RESERVED0[2];                   
    volatile       uint16_t MSTAT;                           /**< 4 Master Status */
    volatile const uint8_t RESERVED1[2];                   
    volatile const uint16_t MRX;                             /**< 8 Master Receive Data */
    volatile const uint8_t RESERVED2[2];                   
    volatile       uint16_t MTX;                             /**< C Master Transmit Data */
    volatile const uint8_t RESERVED3[2];                   
    volatile       uint16_t MRXCNT;                          /**< 10 Master Receive Data Count */
    volatile const uint8_t RESERVED4[2];                   
    volatile const uint16_t MCRXCNT;                         /**< 14 Master Current Receive Data Count */
    volatile const uint8_t RESERVED5[2];                   
    volatile       uint16_t ADDR0;                           /**< 18 1st Master Address Byte */
    volatile const uint8_t RESERVED6[2];                   
    volatile       uint16_t ADDR1;                           /**< 1C 2nd Master Address Byte */
    volatile const uint8_t RESERVED7[2];                   
    volatile       uint16_t BYT;                             /**< 20 Start Byte */
    volatile const uint8_t RESERVED8[2];                   
    volatile       uint16_t DIV;                             /**< 24 Serial Clock Period Divisor */
    volatile const uint8_t RESERVED9[2];                   
    volatile       uint16_t SCTL;                            /**< 28 Slave Control */
    volatile const uint8_t RESERVED10[2];                  
    volatile       uint16_t SSTAT;                           /**< 2C Slave I2C Status/Error/IRQ */
    volatile const uint8_t RESERVED11[2];                  
    volatile const uint16_t SRX;                             /**< 30 Slave Receive */
    volatile const uint8_t RESERVED12[2];                  
    volatile       uint16_t STX;                             /**< 34 Slave Transmit */
    volatile const uint8_t RESERVED13[2];                  
    volatile       uint16_t ALT;                             /**< 38 Hardware General Call ID */
    volatile const uint8_t RESERVED14[2];                  
    volatile       uint16_t ID0;                             /**< 3C 1st Slave Address Device ID */
    volatile const uint8_t RESERVED15[2];                  
    volatile       uint16_t ID1;                             /**< 40 2nd Slave Address Device ID */
    volatile const uint8_t RESERVED16[2];                  
    volatile       uint16_t ID2;                             /**< 44 3rd Slave Address Device ID */
    volatile const uint8_t RESERVED17[2];                  
    volatile       uint16_t ID3;                             /**< 48 4th Slave Address Device ID */
    volatile const uint8_t RESERVED18[2];                  
    volatile       uint16_t STAT;                            /**< 4C Master and Slave FIFO Status */
    volatile const uint8_t RESERVED19[2];                  
    volatile       uint16_t SHCTL;                           /**< 50 Shared Control */
    volatile const uint8_t RESERVED20[2];                  
    volatile       uint16_t TCTL;                            /**< 54 Timing Control Register */
    volatile const uint8_t RESERVED21[2];                  
    volatile       uint16_t ASTRETCH_SCL;                    /**< 58 Automatic Stretch SCL Register */
    volatile const uint8_t RESERVED22[2];                  
    volatile       uint16_t IDFSTA;                          /**< 5C ID FIFO Status Register */
    volatile const uint8_t RESERVED23[2];                  
    volatile       uint16_t SLV_ADDR1;                       /**< 60 Slave 10 Bits Address 1st Byte. */
    volatile const uint8_t RESERVED24[2];                  
    volatile       uint16_t SLV_ADDR2;                       /**< 64 Slave 10 Bits Address 2nd Byte. */
    volatile const uint8_t RESERVED25[2];                  
    volatile const uint16_t SSTAT2;                          /**< 68 Slave I2C Status/IRQ 2 */
} ADI_I2C_TypeDef;

/*! ========================================================================
 *  \struct ADI_MDIO_TypeDef
 *  \brief MDIO Interface
 *  ======================================================================== */
typedef struct _ADI_MDIO_TypeDef
{
    volatile       uint16_t MDCON;                           /**< 0 MDIO Block Control */
    volatile const uint8_t RESERVED0[2];                   
    volatile const uint16_t MDFRM;                           /**< 4 MDIO Received Frame Control Information */
    volatile const uint8_t RESERVED1[2];                   
    volatile const uint16_t MDRXD;                           /**< 8 MDIO Received Data */
    volatile const uint8_t RESERVED2[2];                   
    volatile const uint16_t MDADR;                           /**< C MDIO Received Address */
    volatile const uint8_t RESERVED3[2];                   
    volatile       uint16_t MDTXD;                           /**< 10 MDIO Data for Transmission */
    volatile const uint8_t RESERVED4[2];                   
    volatile       uint16_t MDPHY;                           /**< 14 MDIO PHYADDR Software Values and Selection and DEVADD */
    volatile const uint8_t RESERVED5[2];                   
    volatile const uint16_t MDSTA;                           /**< 18 MDIO Progress Signaling Through Frame */
    volatile const uint8_t RESERVED6[2];                   
    volatile       uint16_t MDIEN;                           /**< 1C MDIO Interrupt Enables */
    volatile const uint8_t RESERVED7[2];                   
    volatile const uint16_t MDPIN;                           /**< 20 MDIO Read PHYADDR Pins */
    volatile const uint8_t RESERVED8[6];                   
    volatile       uint16_t DMAEN;                           /**< 28 MDIO DMA Enable */
    volatile const uint8_t RESERVED9[2];                   
    volatile       uint16_t MDTESTCON;                       /**< 2C MDIO Test Controller Protected by Test Key */
} ADI_MDIO_TypeDef;

/*! ========================================================================
 *  \struct ADI_DMA_TypeDef
 *  \brief DMA
 *  ======================================================================== */
typedef struct _ADI_DMA_TypeDef
{
    volatile const uint32_t STAT;                            /**< 0 DMA Status */
    volatile       uint32_t CFG;                             /**< 4 DMA Configuration */
    volatile       uint32_t PDBPTR;                          /**< 8 DMA Channel Primary Control Data Base Pointer */
    volatile const uint32_t ADBPTR;                          /**< C DMA Channel Alternate Control Data Base Pointer */
    volatile const uint8_t RESERVED0[4];                   
    volatile       uint32_t SWREQ;                           /**< 14 DMA Channel Software Request */
    volatile const uint8_t RESERVED1[8];                   
    volatile       uint32_t RMSKSET;                         /**< 20 DMA Channel Request Mask Set */
    volatile       uint32_t RMSKCLR;                         /**< 24 DMA Channel Request Mask Clear */
    volatile       uint32_t ENSET;                           /**< 28 DMA Channel Enable Set */
    volatile       uint32_t ENCLR;                           /**< 2C DMA Channel Enable Clear */
    volatile       uint32_t ALTSET;                          /**< 30 DMA Channel Primary-alternate Set */
    volatile       uint32_t ALTCLR;                          /**< 34 DMA Channel Primary-alternate Clear */
    volatile       uint32_t PRISET;                          /**< 38 DMA Channel Priority Set */
    volatile       uint32_t PRICLR;                          /**< 3C DMA Channel Priority Clear */
    volatile const uint8_t RESERVED2[8];                   
    volatile       uint32_t ERRCHNLCLR;                      /**< 48 DMA per Channel Error Clear */
    volatile       uint32_t ERRCLR;                          /**< 4C DMA Bus Error Clear */
    volatile       uint32_t INVALIDDESCCLR;                  /**< 50 DMA per Channel Invalid Descriptor Clear */
    volatile const uint8_t RESERVED3[1964];                
    volatile       uint32_t BSSET;                           /**< 800 DMA Channel Bytes Swap Enable Set */
    volatile       uint32_t BSCLR;                           /**< 804 DMA Channel Bytes Swap Enable Clear */
    volatile const uint8_t RESERVED4[8];                   
    volatile       uint32_t SRCADDRSET;                      /**< 810 DMA Channel Source Address Decrement Enable Set */
    volatile       uint32_t SRCADDRCLR;                      /**< 814 DMA Channel Source Address Decrement Enable Clear */
    volatile       uint32_t DSTADDRSET;                      /**< 818 DMA Channel Destination Address Decrement Enable Set */
    volatile       uint32_t DSTADDRCLR;                      /**< 81C DMA Channel Destination Address Decrement Enable Clear */
    volatile const uint8_t RESERVED5[1984];                
    volatile const uint32_t REVID;                           /**< FE0 DMA Controller Revision ID */
} ADI_DMA_TypeDef;

/*! ========================================================================
 *  \struct ADI_CC_TypeDef
 *  \brief Cache Controller
 *  ======================================================================== */
typedef struct _ADI_CC_TypeDef
{
    volatile const uint32_t STAT;                            /**< 0 Cache Status Register */
    volatile       uint32_t SETUP;                           /**< 4 Cache Setup Register */
    volatile       uint32_t KEY;                             /**< 8 Cache Key Register */
    volatile       uint32_t PERFSETUP;                       /**< C Cache Performance Monitor Setup Register */
    volatile const uint32_t ACCESSCNTR;                      /**< 10 Cache Miss Counter */
    volatile const uint8_t RESERVED0[16];                  
    volatile       uint32_t MSTRSETUP;                       /**< 24 Cache Master Setup Register */
    volatile const uint8_t RESERVED1[12];                  
    volatile const uint32_t ECCSTAT;                         /**< 34 Cache SRAM ECC Status Register */
    volatile const uint32_t ECCADDR;                         /**< 38 Cache SRAM ECC Address Register */
} ADI_CC_TypeDef;

/*! ========================================================================
 *  \struct ADI_FLASH_TypeDef
 *  \brief Flash Controller
 *  ======================================================================== */
typedef struct _ADI_FLASH_TypeDef
{
    volatile const uint32_t FEESTA;                          /**< 0 Status Register */
    volatile       uint32_t FEECON0;                         /**< 4 Command Control Register – Interrupt Enable Register */
    volatile       uint32_t FEECMD;                          /**< 8 Command Register */
    volatile       uint32_t FEEFLADR;                        /**< C Flash Address Key - Hole Register */
    volatile       uint32_t FEEFLDATA0;                      /**< 10 Flash Data Register - Key - Hole Interface Lower 32 Bits */
    volatile       uint32_t FEEFLDATA1;                      /**< 14 Flash Data Register - Key - Hole Interface Upper 32 Bits */
    volatile       uint32_t FEEADR0;                         /**< 18 Lower Page Address */
    volatile       uint32_t FEEADR1;                         /**< 1C Upper Page Address */
    volatile       uint32_t FEEKEY;                          /**< 20 Flash Key Register. */
    volatile const uint8_t RESERVED0[4];                   
    volatile       uint32_t FEEPRO0;                         /**< 28 Write Protection Register for Flash0 */
    volatile       uint32_t FEEPRO1;                         /**< 2C Write Protection Register for Flash1 */
    volatile const uint8_t RESERVED1[4];                   
    volatile const uint32_t FEESIG;                          /**< 34 Flash Signature */
    volatile       uint32_t FEECON1;                         /**< 38 User Setup Register */
    volatile const uint8_t RESERVED2[4];                   
    volatile const uint32_t FEEWRADDRA;                      /**< 40 Write Abort Address Register */
    volatile const uint8_t RESERVED3[4];                   
    volatile       uint32_t FEEAEN0;                         /**< 48 Lower 32 Bits of the Sys Irq Abort Enable Register. */
    volatile       uint32_t FEEAEN1;                         /**< 4C Middle 32 Bits of the Sys Irq Abort Enable Register. */
    volatile       uint32_t FEEAEN2;                         /**< 50 Upper 32 Bits of the Sys Irq Abort Enable Register. */
    volatile const uint8_t RESERVED4[16];                  
    volatile       uint32_t FEEECCCONFIG;                    /**< 64 Configurable ECC Enable/disable, Error Response */
    volatile const uint8_t RESERVED5[12];                  
    volatile const uint32_t FEEECCADDRC0;                    /**< 74 Flash 0 ECC Error Address via CODE Bus */
    volatile const uint32_t FEEECCADDRC1;                    /**< 78 Flash 1 ECC Error Address via CODE Bus */
    volatile const uint8_t RESERVED6[24];                  
    volatile const uint32_t FEEECCADDRD0;                    /**< 94 Flash 0 ECC Error Address via DMA Bus */
    volatile const uint32_t FEEECCADDRD1;                    /**< 98 Flash 1 ECC Error Address via DMA Bus */
} ADI_FLASH_TypeDef;

/*! ========================================================================
 *  \struct ADI_GPIO_TypeDef
 *  \brief GPIO
 *  ======================================================================== */
typedef struct _ADI_GPIO_TypeDef
{
    volatile       uint16_t CON;                             /**< 0 Port Configuration */
    volatile const uint8_t RESERVED0[2];                   
    volatile       uint8_t OE;                              /**< 4 Port Output Enable */
    volatile const uint8_t RESERVED1[3];                   
    volatile       uint8_t IE;                              /**< 8 Port Input Path Enable */
    volatile const uint8_t RESERVED2[3];                   
    volatile const uint8_t IN;                              /**< C Port Registered Data Input */
    volatile const uint8_t RESERVED3[3];                   
    volatile       uint8_t OUT;                             /**< 10 Port Data Output */
    volatile const uint8_t RESERVED4[3];                   
    volatile       uint8_t SET;                             /**< 14 Port Data Out Set */
    volatile const uint8_t RESERVED5[3];                   
    volatile       uint8_t CLR;                             /**< 18 Port Data Out Clear */
    volatile const uint8_t RESERVED6[3];                   
    volatile       uint8_t TGL;                             /**< 1C Port Pin Toggle */
    volatile const uint8_t RESERVED7[3];                   
    volatile       uint8_t ODE;                             /**< 20 Port Open Drain Enable */
    volatile const uint8_t RESERVED8[3];                   
    volatile       uint8_t IS;                              /**< 24 Port Input Select */
    volatile const uint8_t RESERVED9[3];                   
    volatile       uint8_t PE;                              /**< 28 Port Pull Enable */
    volatile const uint8_t RESERVED10[3];                  
    volatile       uint8_t PS;                              /**< 2C Port Pull Select */
    volatile const uint8_t RESERVED11[3];                  
    volatile       uint8_t SR;                              /**< 30 Port Slew Rate */
    volatile const uint8_t RESERVED12[3];                  
    volatile       uint16_t DS;                              /**< 34 Port Drive Select */
    volatile const uint8_t RESERVED13[2];                  
    volatile       uint8_t PWR;                             /**< 38 Port Power Select */
    volatile const uint8_t RESERVED14[3];                  
    volatile       uint8_t POL;                             /**< 3C GPIO Interrupt Polarity Select */
    volatile const uint8_t RESERVED15[3];                  
    volatile       uint8_t IENA;                            /**< 40 InterruptA Enable */
    volatile const uint8_t RESERVED16[3];                  
    volatile       uint8_t IENB;                            /**< 44 InterruptB Enable */
    volatile const uint8_t RESERVED17[3];                  
    volatile       uint8_t INT;                             /**< 48 Interrupt Status */
    volatile const uint8_t RESERVED18[3]; 
} ADI_GPIO_TypeDef;

/*! ========================================================================
 *  \struct ADI_SPI_TypeDef
 *  \brief Serial Peripheral Interface
 *  ======================================================================== */
typedef struct _ADI_SPI_TypeDef
{
    volatile       uint16_t STAT;                            /**< 0 Status */
    volatile const uint8_t RESERVED0[2];                   
    volatile const uint16_t RX;                              /**< 4 Receive */
    volatile const uint8_t RESERVED1[2];                   
    volatile       uint16_t TX;                              /**< 8 Transmit */
    volatile const uint8_t RESERVED2[2];                   
    volatile       uint16_t DIV;                             /**< C SPI Baud Rate Selection */
    volatile const uint8_t RESERVED3[2];                   
    volatile       uint16_t CTL;                             /**< 10 SPI Configuration 1 */
    volatile const uint8_t RESERVED4[2];                   
    volatile       uint16_t IEN;                             /**< 14 SPI Configuration 2 */
    volatile const uint8_t RESERVED5[2];                   
    volatile       uint16_t CNT;                             /**< 18 Transfer Byte Count */
    volatile const uint8_t RESERVED6[2];                   
    volatile       uint16_t DMA;                             /**< 1C SPI DMA Enable */
    volatile const uint8_t RESERVED7[2];                   
    volatile const uint16_t FIFOSTAT;                        /**< 20 FIFO Status */
    volatile const uint8_t RESERVED8[2];                   
    volatile       uint16_t RDCTL;                           /**< 24 Read Control */
    volatile const uint8_t RESERVED9[2];                   
    volatile       uint16_t FLOWCTL;                         /**< 28 Flow Control */
    volatile const uint8_t RESERVED10[2];                  
    volatile       uint16_t WAITTMR;                         /**< 2C Wait Timer for Flow Control */
    volatile const uint8_t RESERVED11[6];                  
    volatile       uint16_t CSOVERRIDE;                      /**< 34 Chip-Select Override */
} ADI_SPI_TypeDef;

/*! ========================================================================
 *  \struct ADI_CLOCK_TypeDef
 *  \brief Clock Gating and Other Settings
 *  ======================================================================== */
typedef struct _ADI_CLOCK_TypeDef
{
    volatile       uint16_t CLKCON0;                         /**< 0 Misc Clock Settings Register */
    volatile const uint8_t RESERVED0[2];                   
    volatile       uint16_t CLKCON1;                         /**< 4 Clock Dividers Register */
    volatile const uint8_t RESERVED1[2];                   
    volatile       uint16_t CLKSTAT0;                        /**< 8 Clocking Status */
} ADI_CLOCK_TypeDef;

/*! ========================================================================
 *  \struct ADI_PWM_TypeDef
 *  \brief PWM MMR
 *  ======================================================================== */
typedef struct _ADI_PWM_TypeDef
{
    volatile       uint16_t PWMCON0;                         /**< 0 PWM Control Register */
    volatile const uint8_t RESERVED0[2];                   
    volatile       uint16_t PWMCON1;                         /**< 4 ADC Conversion Start and Trip Control Register */
    volatile const uint8_t RESERVED1[2];                   
    volatile       uint16_t PWMICLR;                         /**< 8 Hardware Trip Configuration Register */
    volatile const uint8_t RESERVED2[6];                   
    volatile       uint16_t PWM0COM0;                        /**< 10 Compare Register 0 for PWM0 and PWM1 */
    volatile const uint8_t RESERVED3[2];                   
    volatile       uint16_t PWM0COM1;                        /**< 14 Compare Register 1 for PWM0 and PWM1 */
    volatile const uint8_t RESERVED4[2];                   
    volatile       uint16_t PWM0COM2;                        /**< 18 Compare Register 2 for PWM0 and PWM1 */
    volatile const uint8_t RESERVED5[2];                   
    volatile       uint16_t PWM0LEN;                         /**< 1C Period Value Register for PWM0 and PWM1 */
    volatile const uint8_t RESERVED6[2];                   
    volatile       uint16_t PWM1COM0;                        /**< 20 Compare Register 0 for PWM2 and PWM3 */
    volatile const uint8_t RESERVED7[2];                   
    volatile       uint16_t PWM1COM1;                        /**< 24 Compare Register 1 for PWM2 and PWM3 */
    volatile const uint8_t RESERVED8[2];                   
    volatile       uint16_t PWM1COM2;                        /**< 28 Compare Register 2 for PWM2 and PWM3 */
    volatile const uint8_t RESERVED9[2];                   
    volatile       uint16_t PWM1LEN;                         /**< 2C Period Value Register for PWM2 and PWM3 */
    volatile const uint8_t RESERVED10[2];                  
    volatile       uint16_t PWM2COM0;                        /**< 30 Compare Register 0 for PWM4 and PWM5 */
    volatile const uint8_t RESERVED11[2];                  
    volatile       uint16_t PWM2COM1;                        /**< 34 Compare Register 1 for PWM4 and PWM5 */
    volatile const uint8_t RESERVED12[2];                  
    volatile       uint16_t PWM2COM2;                        /**< 38 Compare Register 2 for PWM4 and PWM5 */
    volatile const uint8_t RESERVED13[2];                  
    volatile       uint16_t PWM2LEN;                         /**< 3C Period Value Register for PWM4 and PWM5 */
} ADI_PWM_TypeDef;

