ChibiOS/ChibiOS/os/common/ext/ADI/ADUCM41x/ADuCM410.h
/*  =========================================================================
 *! \enum   DMA_CHANn_TypeDef
 *! \brief  DMAChannel Number Assignments
 *  ========================================================================= */

typedef enum
{
    SPI0_TX_CHANn                               =     0,    /*!<* SPI0_TX */
    SPI0_RX_CHANn                               =     1,    /*!<* SPI0_RX */
    SPI1_TX_CHANn                               =     2,    /*!<* SPI1_TX */
    SPI1_RX_CHANn                               =     3,    /*!<* SPI1_RX */
    SPI2_TX_CHANn                               =     4,    /*!<* SPI2_TX */
    SPI2_RX_CHANn                               =     5,    /*!<* SPI2_RX */
    UART0_TX_CHANn                              =     6,    /*!<* UART0_TX */
    UART0_RX_CHANn                              =     7,    /*!<* UART0_RX */
    UART1_TX_CHANn                              =     8,    /*!<* UART1_TX */
    UART1_RX_CHANn                              =     9,    /*!<* UART1_RX */
    I2C0S_TX_CHANn                              =    10,    /*!<* I2C0S_TX */
    I2C0S_RX_CHANn                              =    11,    /*!<* I2C0S_RX */
    I2C0M_CHANn                                 =    12,    /*!<* I2C0M */
    I2C1S_TX_CHANn                              =    13,    /*!<* I2C1S_TX */
    I2C1S_RX_CHANn                              =    14,    /*!<* I2C1S_RX */
    I2C1M_CHANn                                 =    15,    /*!<* I2C1M */
    I2C2S_TX_CHANn                              =    16,    /*!<* I2C2S_TX */
    I2C2S_RX_CHANn                              =    17,    /*!<* I2C2S_RX */
    I2C2M_CHANn                                 =    18,    /*!<* I2C2M */
    MDIO_TX_CHANn                               =    19,    /*!<* MDIO_TX */
    MDIO_RX_CHANn                               =    20,    /*!<* MDIO_RX */
    FLASH_KHWR_CHANn                            =    21,    /*!<* FLASH_KHWR */
    ADC_RD_CHANn                                =    22,    /*!<* ADC_RD */
    sys_Trig0_CHANn                             =    27,    /*!<* sys_Trig0 */
    sys_Trig1_CHANn                             =    28,    /*!<* sys_Trig1 */
    sys_SW0_CHANn                               =    29,    /*!<* sys_SW0 */
    sys_SW1_CHANn                               =    30,    /*!<* sys_SW1 */
} DMA_CHANn_TypeDef;  /* typedef name for fixed DMA channel assignment */


#ifdef __cplusplus
}
#endif

#endif // __ADUCM410_H__

